#task1------------------------------------------------------------
"""
Дано два цілих числа. Вивести найменше з них.
"""

a=int(input('Введіть перше число:'))
b=int(input('Введіть друге число:'))
if a<b:  
    print(a)
elif b<a: 
    print(b)

#-----------------------------------------------------------------


#task2------------------------------------------------------------
"""
Вивести результат функції sign(x), що визначається наступним чином: 
sign(x) = 1, if x > 0, 
sign(x) = -1, if x < 0, 
sign(x) = 0, if x = 0.
"""

y=0
x=int(input('Введіть дійсне число:'))
if x>0:
    y=1
if x<0:
    y=-1
if x==0:
    y=0
print(y)

#-----------------------------------------------------------------


#task3------------------------------------------------------------
"""
Дано три цілих числа. Вивести найменше з них.
"""

a=int(input('Введіть перше ціле число:'))
b=int(input('Введіть друге ціле число:'))
c=int(input('Введіть третє ціле число:'))
if a<b and a<c:  
    print(a)
if b<a and b<c:
    print(b)
if c<a and c<b:
    print(c)

#-----------------------------------------------------------------


#task4------------------------------------------------------------
"""
Дано ціле число, що визначає рік. Визначити, чи є вказаний рік 
високосним. Якщо так, то вивести користувачу "LEAP", в іншому 
випадку – "СOMMON".
Рік високосний, якщо виконується хоча б одна з умов:
  рік завжди високосним, якщо його номер ділиться на 4 без остачі 
  і не ділиться без остачі на 100;
  рік завжди високосним, якщо його номер ділиться на 400 без 
  остачі.
"""

r=int(input('Введіть рік:'))
if (r%4)==0: 
    print(‘LEAP')
else:
    print(‘COMMON’)

#-----------------------------------------------------------------


#task5------------------------------------------------------------
"""
Дано три цілих числа. Визначте, скільки з них дорівнюють один 
одному. Програма повинна виводити одне з чисел: 3 (якщо всі числа 
однакові), 2 (якщо два з них дорівнюють один одному, а третє 
відрізняється) або 0 (якщо всі числа різні).
"""

y=0
a=int(input('Введіть перше ціле число:'))
b=int(input('Введіть друге ціле число:'))
c=int(input('Введіть третє ціле число:'))
if a==b or b==c or a==c:
    y=2
if a==b and a==c and b==c:
    y=3
elif a!=b and a!=c and b!=c:
    print('Немає однакових')
print(y)

#-----------------------------------------------------------------


#task6------------------------------------------------------------
"""
Шахова тура переміщається по горизонталі або по вертикалі. Дано 
координати двох клітин шахової дошки. Визначити, чи може тура 
перейти з першої клітини у другу за один хід. Користувач вводить 
чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку 
та стовпчика клітини. Перші два числа - для першої клітини, 
останні два числа – для другої. Програма має вивести "YES", якщо 
тура може виконати переміщення, або "NO" в іншому випадку.
"""

a=int(input('Введіть перше ціле число(Від 1-8):'))
b=int(input('Введіть друге ціле число(Від 1-8):'))
c=int(input('Введіть третє ціле число(Від 1-8):'))
d=int(input('Введіть четверте ціле число(Від 1-8):'))
if a==c or b==d:
    print('Yes')
else:
    print('No')

#-----------------------------------------------------------------


#task7------------------------------------------------------------
"""
Дано координати двох клітин шахової дошки. Визначити, чи 
однакового вони кольору. Користувач вводить чотири цілих числа 
від 1 до 8, кожне з яких визначає номер рядку та стовпчика 
клітини. Перші два числа - для першої клітини, останні два числа – 
для другої. Програма має вивести "YES", якщо колір однаковий, або 
"NO" в іншому випадку.
"""

a=int(input('Введіть перше ціле число(Від 1-8):'))
b=int(input('Введіть друге ціле число(Від 1-8):'))
c=int(input('Введіть третє ціле число(Від 1-8):'))
d=int(input('Введіть четверте ціле число(Від 1-8):'))
if ((a + b) % 2) == ((c + d) % 2):
    print("YES")
else:
    print("NO")

#-----------------------------------------------------------------


#task8------------------------------------------------------------
"""
Шаховий король переміщується по горизонталі, по вертикалі або по 
діагоналі на будь-яку сусідню клітинку. Дано координати двох 
клітин шахової дошки. Визначити, чи може король перейти з першої 
клітини у другу за один хід. Користувач вводить чотири цілих 
числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика 
клітини. Перші два числа - для першої клітини, останні два числа
– для другої. Програма має вивести "YES", якщо хід можливий, або 
"NO" в іншому випадку.
"""

a=int(input('Введіть перше ціле число(Від 1-8):'))
b=int(input('Введіть друге ціле число(Від 1-8):'))
c=int(input('Введіть третє ціле число(Від 1-8):'))
d=int(input('Введіть четверте ціле число(Від 1-8):'))
if (c>=a-1) and (c<=a+1) and (d>=b-1) and (d<=b+1):
    print('Yes')
else:
    print('No')

#-----------------------------------------------------------------


#task9------------------------------------------------------------
"""
Шаховий слон рухається по діагоналі на будь-яку кількість клітин. 
Дано координати двох клітин шахової дошки. Визначити, чи може слон 
перейти з першої клітини у другу за один хід. Користувач вводить 
чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку 
та стовпчика клітини. Перші два числа - для першої клітини, 
останні два числа – для другої. Програма має вивести "YES", якщо 
хід можливий, або "NO" в іншому випадку.
"""

a=int(input('Введіть перше ціле число(Від 1-8):'))
b=int(input('Введіть друге ціле число(Від 1-8):'))
c=int(input('Введіть третє ціле число(Від 1-8):'))
d=int(input('Введіть четверте ціле число(Від 1-8):'))
if (a-c)==(b-d) or (a+b)==(c+d):
    print('Yes')
else:
    print('No')

#-----------------------------------------------------------------


#task10-----------------------------------------------------------
"""
Шахова королева рухається по горизонталі, по вертикалі або по 
діагоналі на будь-яку кількість клітин. Дано координати двох 
клітин шахової дошки. Визначити, чи може королева перейти з першої 
літини у другу за один хід. Користувач вводить чотири цілих числа 
від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини. 
Перші два числа - для першої клітини, останні два числа – для 
другої. Програма має вивести "YES", якщо хід можливий, або "NO" 
в іншому випадку.
"""

a=int(input('Введіть перше ціле число(Від 1-8):'))
b=int(input('Введіть друге ціле число(Від 1-8):'))
c=int(input('Введіть третє ціле число(Від 1-8):'))
d=int(input('Введіть четверте ціле число(Від 1-8):'))
if (a-c)==(b-d) or (a+b)==(c+d) or (a==c) or (b==d):
    print('Yes')
else:
    print('No')

#-----------------------------------------------------------------


#task11-----------------------------------------------------------
"""
Шаховий кінь рухається як літера L. Він може переміщатись на дві 
клітинки по горизонталі і одну клітинку по вертикалі або на дві 
клітинки по вертикалі і одну по горизонталі. Дано координати двох 
клітин шахової дошки. Визначити, чи може кінь перейти з першої 
клітини у другу за один хід. Користувач вводить чотири цілих 
числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика 
клітини. Перші два числа - для першої клітини, останні два числа
– для другої. Програма має вивести "YES", якщо хід можливий, або 
"NO" в іншому випадку.
"""

a = int(input())
b = int(input())
c = int(input())
d = int(input())
if (((b-d)==2) or ((d-b)==2)) and (((a-c)==1)or((c-a)==1)) or (((a-c)==2) or ((c-a)==2)) and (((b-d)==1)or((d-b)==1)):
    print ('YES')
else:
    print('NO')

#-----------------------------------------------------------------


#task12-----------------------------------------------------------
"""
Шоколад має форму прямокутника, розділеного на n×m клітин. Шоколад 
може бути розділений на дві частини тільки по горизонталі або по 
вертикалі, при цьому клітини мають бути цілими. Визначити, чи 
можна розділити шоколад за один крок таким чином, щоб одна з 
частин матиме точно k клітин. Програма має вивести "YES", якщо 
шоколад можна поділити, або "NO" в іншому випадку.
"""

n = int(input())
m = int(input())
k = int(input())
a=n*m
b=a-k
if b>0 and (b%n==0 or b%m==0):
    print ('YES')
else:
    print ('NO')

#-----------------------------------------------------------------
