#task1--------------------------------------------------------------------
'''
Напишите программу, которая считывает три числа и 
выводит их сумму. Каждое число записано в отдельной строке. 
'''

A = input('Значення перше:')
B = input('Значення друге:’)
C = input('Значення третє:')
print(int(A) + int(B) + int(C))
    
#--------------------------------------------------------------------------


#task2---------------------------------------------------------------------
'''
Напишите программу, которая считывает длины двух катетов в 
прямоугольном треугольнике и выводит его площадь. Каждое 
число записано в отдельной строке. 
'''

Kat1 = input('Перший катет:')
Kat2 = input('Другий катет:')
print(0.5 * int(Kat1) * int(Kat2))
    
#--------------------------------------------------------------------------


#task3---------------------------------------------------------------------
'''
N студентів отримали K яблук і розподілити їх між собою порівну. Неподілені 
яблука залишились у кошику. Скільки яблук отримає кожен студент? Скільки 
яблук залишиться в кошику?
'''

s = input('Кількість студентів:')
a = input('Кількість яблук:')
print(int(a)//int(s), int(a)%int(s))

#--------------------------------------------------------------------------


#task4----------------------------------------------------------------------
'''
Нехай число N - кількість хвилин, відрахованих після півночі. Скільки годин 
хвилин буде показувати цифровий годинник, якщо за відлік взяти 00:00?
'''
   
r=0
n=int(input(‘Введіть кількість хвилин:’))
if n>=60:
    hours=n//60
    minutes=n%60
    if hours>=24:
        days=hours//24
        hours=hours%24
        print(str(hours)+str(minutes))
        r=1
    if k==0:
        print(str(hours)+str(minutes))
        r=1
else:
    if r==0:
        print(str(n))
            
#---------------------------------------------------------------------------

            
#task5-----------------------------------------------------------------------
''' Напишіть програму, яка вітає користувача, друкуючи слово "Hello", ім'я 
користувача і знак оклику після нього.
'''

name = input(‘Введіть своє ім’я:’)
print('Hello,%s!' %(name))
    
#----------------------------------------------------------------------------


#task6-----------------------------------------------------------------------
'''
Напишіть програму, яка зчитує ціле число і друкує його попереднє і наступне 
значення за форматом:
The next number for the number 179 is 180.
The previous number for the number 179 is 178.
'''

chuslo = int(input())
print('The next number for the number %s is %s' % (chuslo, chuslo+1))
print('The previous number for the number %s is %s' % (chuslo, chuslo-1))
    
#----------------------------------------------------------------------------


#task7------------------------------------------------------------------------
'''Школа вирішила сформувати три нові групи учнів та надати їм окремі класи. 
У кожному класі необхідно встановити столи для учнів, у розрахунку, що за 
одним столом може сидіти не більше двох учнів. Яку мінімальну кількість столів 
необхідно придбати?
'''

Stud1 = int(input(‘Кількість студентів в першій групі:’))
Stud2 = int(input(‘Кількість студентів в другій групі:’))
Stud3 = int(input(‘Кількість студентів в третій групі:’))
if (Stud1 % 2) == 0:
    Table = Stud1 // 2
else:
    Table = (Stud1 // 2) + 1
if (Stud2 % 2) == 0:
    Table += Stud2 // 2
else:
    Table += (Stud2 // 2) + 1
if (Stud3 % 2) == 0:
    Table += Stud3 // 2
else:
    Table += (Stud3 // 2) + 1
print(Table)
    
#------------------------------------------------------------------------------
