#task1------------------------------------------------------------
"""
Напишіть програму, яка отримує три числа і друкує їх суму. 
Кожне число користувач вводить у окремому рядку.
"""

a=input('Введіт значення №1:')
b=input('Введіть значення №2:')
c=input('Введіть значення №3:')
print(int(a)+int(b)+int(c))
  
#-----------------------------------------------------------------


#task2------------------------------------------------------------
"""
Напишіть програму, яка отримує довжини двох катетів прямокутного трикутника та виводить його площу. 
Користувач вводить довжини катетів у окремих рядках.
"""

k1=input('Введіть значення довжини першого катета')
k2=input('Введіть значення довжини другого катета')
print(0,5*int(k1)*int(k2))
  
#-----------------------------------------------------------------


#task3------------------------------------------------------------
"""
N студентів отримали K яблук і розподілити їх між собою порівну. 
Неподілені яблука залишились у кошику. Скільки яблук отримає кожен студент? 
Скільки яблук залишиться в кошику?
"""

s = input('Введіть кількість студентів:')
a = input('Введіть кількість яблук:')
print(int(a)//int(s), int(a)%int(s))

#-----------------------------------------------------------------


#task4------------------------------------------------------------
"""
Нехай число N - кількість хвилин, відрахованих після півночі. 
Скільки годин і хвилин буде показувати цифровий годинник, якщо за відлік взяти 00:00?
"""

k = 0
n = int(input('Введіть кількість хвилин:'))
if n>=60:
    hours = n // 60
    minutes = n % 60
    if hours >= 24:
        days = hours // 24
        hours = hours % 24
        print(str(hours) + str(minutes))
        k = 1
    if k == 0:
        print(str(hours) + str(minutes))
        k = 1
else:
    if k == 0:
        print(str(n))
  
#-----------------------------------------------------------------


#task5------------------------------------------------------------
"""
Напишіть програму, яка вітає користувача, друкуючи слово "Hello", ім'я користувача і знак оклику після нього. 
Наприклад “Hello, Mike!”
"""

name = input('Введіть ім’я користувача:')
print('Hello,%s!' %(name))

#-----------------------------------------------------------------


#task6------------------------------------------------------------
"""
Напишіть програму, яка зчитує ціле число і друкує його попереднє і наступне значення за форматом:
The next number for the number 179 is 180.
The previous number for the number 179 is 178.
"""

num = int(input('Введіть задане число:'))
print('Наступним числом після %s є %s' % (num, num+1))
print('Попереднім числом %s є %s' % (num, num-1))
  
#-----------------------------------------------------------------


#task7------------------------------------------------------------
"""
Школа вирішила сформувати три нові групи учнів та надати їм окремі класи. 
У кожному класі необхідно встановити столи для учнів, у розрахунку, що за одним столом може сидіти не більше двох учнів. 
Яку мінімальну кількість столів необхідно придбати?
"""

intSt_1 = int(input('Кількість учнів у першій групі:'))
intSt_2 = int(input('Кількість учнів у другій групі:'))
intSt_3 = int(input('Кількість учнів у третій групі:'))
if (intSt_1 % 2) == 0:
        intTable = intSt_1 // 2
else:
    intTable = (intSt_1 // 2) + 1
if (intSt_2 % 2) == 0:
    intTable += intSt_2 // 2
else:
    intTable += (intSt_2 // 2) + 1
if (intSt_3 % 2) == 0:
    intTable += intSt_3 // 2
else:
    intTable += (intSt // 2) + 1
print(intTable)
  
#-----------------------------------------------------------------
