#task1------------------------------------------------------------
"""
Напишіть програму, яка отримує три числа і друкує їх суму.
Кожне число користувач вводить у окремому рядку.
"""



#write your answer here...
x=float(input())       #Input first number
y=float(input())       #Input second number
z=float(input())       #Input third number

print(x+y+z)           #Output sum
#-----------------------------------------------------------------


#task2------------------------------------------------------------
"""
Напишіть програму, яка отримує довжини двох катетів 
прямокутного трикутника та виводить його площу.
Користувач вводить довжини катетів у окремих рядках.
"""



#write your answer here...
a=float(input())    #Input first leg
b=float(input())    #Input second leg

print(a*b/2)        #Output Area
#-----------------------------------------------------------------


#task3------------------------------------------------------------
"""
N студентів отримали K яблук і розподілити їх між собою порівну.
Неподілені яблука залишились у кошику.
Скільки яблук отримає кожен студент?
Скільки яблук залишиться в кошику?

Програма отримує числа N і K.
Вона повинна вивести два числа: відповіді на поставлені вище питання.
"""



#write your answer here...
n = int(input())    #n-number of students
k = int(input())    #k-number of apples

print(k // n)       #One student`s apples
print(k % n)        #Apples in bascket
#-----------------------------------------------------------------


#task4------------------------------------------------------------
"""
Нехай число N - кількість хвилин, відрахованих після півночі.
Скільки годин і хвилин буде показувати цифровий годинник, якщо за відлік взяти 00:00?

Програма повинна виводити два числа: кількість годин (від 0 до 23) і кількість хвилин (від 0 до 59).
Візьміть до уваги, що починаючи з півночі може пройти декілька днів, тому число N може бути достатньо великим.
"""



#write your answer here...
n = int(input())                     #n - number of minutes

print((n // 60)-n//((60*24))*24)     #out hours
print(n % 60)                        #out minutes
#-----------------------------------------------------------------


#task5------------------------------------------------------------
"""
Напишіть програму, яка вітає користувача, друкуючи слово "Hello",
ім'я користувача і знак оклику після нього. Наприклад “Hello, Mike!”
"""



#write your answer here...
a = str(input())        #input name

print("Hello,",a+"!")   #output greating
#-----------------------------------------------------------------


#task6------------------------------------------------------------
"""
Напишіть програму, яка зчитує ціле число і друкує його попереднє і наступне значення за форматом:
  	
The next number for the number 179 is 180.
The previous number for the number 179 is 178.
"""



#write your answer here...
a = int(input())   #input number

print("The next number for the number",a,"is",a+1)          #output next number
print("The  previous number for the number",a,"is",a-1)     #output previous number
#-----------------------------------------------------------------


#task7------------------------------------------------------------
"""
Школа вирішила сформувати три нові групи учнів та надати їм окремі класи.
У кожному класі необхідно встановити столи для учнів, у розрахунку,
що за одним столом може сидіти не більше двох учнів.
Яку мінімальну кількість столів необхідно придбати?
"""



#write your answer here...
group_a = int(input())   #input number of pupiles in first group
group_b = int(input())   #input number of pupiles in second group
group_c = int(input())   #input number of pupiles in third group

print(group_a//2+group_b//2+group_c//2+group_a%2+group_b%2+group_c%2)  #output number of desks
#-----------------------------------------------------------------