#task1------------------------------------------------------------
"""
Дано два цілих числа. Вивести найменше з них.
"""



#Minimum of two numbers
x1 = int(input())   #first number
x2 = int(input())   #second number

if (x1>x2):
    print(x2)   #output result
else:
    print(x1)   #output result

	
	
#-----------------------------------------------------------------


#task2------------------------------------------------------------
"""
Вивести результат функціїsign(x), що визначається наступним чином: 
sign(x) = 1, if x > 0, 
sign(x) = -1, if x < 0, 
sign(x) = 0, if x = 0.
"""



#Sign function
x = int(input()) #input argument

if x>0:
    print(1)   #output result
elif x==0:
    print(0)   #output result
else:
    print(-1)  #output result

	
	
#-----------------------------------------------------------------


#task3------------------------------------------------------------
"""
Дано три цілих числа. Вивести найменше з них.
"""



#Minimum of three numbers
a = int(input()) #first number
b = int(input()) #second number
c = int(input()) #third number

if (a<=b) & (a<=c):
    print(a)     #output result
elif (b<=a) & (b<=c):
    print(b)     #output result
else:
    print(c)     #output result
	
	
	
#-----------------------------------------------------------------


#task4------------------------------------------------------------
"""
Дано ціле число, що визначає рік. Визначити, чи є вказаний рік високосним.
Якщо так, то вивести користувачу "LEAP", в іншому випадку – "СOMMON".

Рік високосний, якщо виконується хоча б одна з умов:

рік завжди високосним, якщо його номер ділиться на 4 без остачі і не ділиться без остачі на 100
рік завжди високосним, якщо його номер ділиться на 400 без остачі
"""


#Leap year
year = int(input())     #input year

if (year%400==0) or ((year%4==0) & (year%100!=0)):
    print("LEAP")          #output result
else:
    print("COMMON")        #output result

	
	
#-----------------------------------------------------------------


#task5------------------------------------------------------------
"""
Дано три цілих числа. Визначте, скільки з них дорівнюють один одному.
Програма повинна виводити одне з чисел: 3 (якщо всі числа однакові),
2 (якщо два з них дорівнюють один одному, а третє відрізняється)
або 0 (якщо всі числа різні).
"""



#Equal numbers
a = int(input())    #first number
b = int(input())    #second number
c = int(input())    #third number

if a==b==c:
    print(3)     #output result
elif (a!=b) & (a!=c) & (b!=c): 
    print(0)     #output result
else:
    print(2)     #output result
	
	
	
#-----------------------------------------------------------------


#task6------------------------------------------------------------
"""
Шахова тура переміщається по горизонталі або по вертикалі. Дано координати двох клітин шахової дошки.
Визначити, чи може тура перейти з першої клітини у другу за один хід.
Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини.
Перші два числа - для першої клітини, останні два числа – для другої.
Програма має вивести "YES", якщо тура може виконати переміщення, або "NO" в іншому випадку.
"""



#Rook move
x1 = int(input())   #x of first cell
y1 = int(input())   #y of first cell
x2 = int(input())   #x of second cell
y2 = int(input())   #y of second cell

if x1==x2 or y1==y2:
    print("YES")    #output result
else:
    print("NO")     #output result

	
	
#-----------------------------------------------------------------


#task7------------------------------------------------------------
"""
Дано координати двох клітин шахової дошки. Визначити, чи однакового вони кольору.
Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини.
Перші два числа - для першої клітини, останні два числа – для другої.
Програма має вивести "YES", якщо колір однаковий, або "NO" в іншому випадку.
"""



#Chess board
x1 = int(input())   #x of first cell
y1 = int(input())   #y of first cell
x2 = int(input())   #x of second cell
y2 = int(input())   #y of second cell

if ((x1+y1)%2==(x2+y2)%2):
    print("YES")    #output result
else:
    print("NO")     #output result

	
	
#-----------------------------------------------------------------


#task8------------------------------------------------------------
"""
Шаховий король переміщується по горизонталі, по вертикалі або по діагоналі на будь-яку сусідню клітинку.
Дано координати двох клітин шахової дошки. Визначити, чи може король перейти з першої клітини у другу за один хід.
Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини.
Перші два числа - для першої клітини, останні два числа – для другої.
Програма має вивести "YES", якщо хід можливий, або "NO" в іншому випадку.
"""



#King move
x1 = int(input())   #x of first cell
y1 = int(input())   #y of first cell
x2 = int(input())   #x of second cell
y2 = int(input())   #y of second cell

if ((x1==x2+1) or (x1==x2-1) or (x1==x2)) & ((y1==y2+1) or (y1==y2-1) or (y1==y2)):
    print("YES")    #output result
else:
    print("NO")     #output result

	
	
#-----------------------------------------------------------------


#task9------------------------------------------------------------
"""
Шаховий слон рухається по діагоналі на будь-яку кількість клітин. Дано координати двох клітин шахової дошки.
Визначити, чи може слон перейти з першої клітини у другу за один хід.
Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини.
Перші два числа - для першої клітини, останні два числа – для другої.
Програма має вивести "YES", якщо хід можливий, або "NO" в іншому випадку.
"""



#Bishop move
x1 = int(input())   #x of first cell
y1 = int(input())   #y of first cell
x2 = int(input())   #x of second cell
y2 = int(input())   #y of second cell

if (x1+y1==x2+y2) or (x1-y1==x2-y2):
    print("YES")    #output result
else:
    print("NO")     #output result

	
	
#-----------------------------------------------------------------


#task10------------------------------------------------------------
"""
Шахова королева рухається по горизонталі, по вертикалі або по діагоналі на будь-яку кількість клітин.
Дано координати двох клітин шахової дошки. Визначити, чи може королева перейти з першої клітини у другу за один хід.
Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини.
Перші два числа - для першої клітини, останні два числа – для другої.
Програма має вивести "YES", якщо хід можливий, або "NO" в іншому випадку.
"""



#Queen move
x1 = int(input())   #x of first cell
y1 = int(input())   #y of first cell
x2 = int(input())   #x of second cell
y2 = int(input())   #y of second cell

if (x1+y1==x2+y2) or (x1-y1==x2-y2) or x1==x2 or y1==y2:
    print("YES")    #output result
else:
    print("NO")     #output result

	
	
#-----------------------------------------------------------------


#task11------------------------------------------------------------
"""
Шаховий кінь рухається як літера L.
Він може переміщатись на дві клітинки по горизонталі і одну клітинку по вертикалі або на дві клітинки по вертикалі і одну по горизонталі.
Дано координати двох клітин шахової дошки. Визначити, чи може кінь перейти з першої клітини у другу за один хід.
Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини.
Перші два числа - для першої клітини, останні два числа – для другої. Програма має вивести "YES", якщо хід можливий, або "NO" в іншому випадку.
"""



#Knight move
x1 = int(input())   #x of first cell
y1 = int(input())   #y of first cell
x2 = int(input())   #x of second cell
y2 = int(input())   #y of second cell

if (((x1==x2+1) or (x1==x2-1)) & ((y1==y2+2) or (y1==y2-2))) or (((x1==x2+2) or (x1==x2-2)) & ((y1==y2+1) or (y1==y2-1))):
    print("YES")    #output result
else:
    print("NO")     #output result

	
	
#-----------------------------------------------------------------


#task12------------------------------------------------------------
"""
Шоколад має форму прямокутника, розділеного на n×m клітин.
Шоколад може бути розділений на дві частини тільки по горизонталі або по вертикалі, при цьому клітини мають бути цілими.
Визначити, чи можна розділити шоколад за один крок таким чином, щоб одна з частин матиме точно k клітин.
Програма має вивести "YES", якщо шоколад можна поділити, або "NO" в іншому випадку.
"""



#Chocolate bar
n = int(input())
m = int(input())
k = int(input())

if ((k%n==0) or (k%m==0)) & (m*n>k):
    print("YES")
else:
    print("NO")

	
#-----------------------------------------------------------------


