#task1-------------------------------------------------------------------------
"""

Ряд - 1
Даны два целых числа A и B (при этом A ≤ B). Выведите все числа от A до B 
включительно.
"""
#Програма для виводу чисел від А до В
#a- ціле число, менше за b
#b- ціле число
a = int(input())
b = int(input())
# вивід даних чисел від A до В
print( *range(a, b+1))
#------------------------------------------------------------------------------


#task2-------------------------------------------------------------------------
"""

Ряд - 2
Даны два целых числа A и В. Выведите все числа от A до B включительно, в 
порядке возрастания, если A < B, или в порядке убывания в противном случае.
"""
#Програма для виведення чисел від А до В, в порядку 
#збільшення, якщо А<В, чи в порядку спадання в іншому випадку
#А- початкове число; В- кінцеве число
a = int(input())
b = int(input())
# вивід якщо А менше за В
if a<b:
    print(*range(a, b+1))
# Вивід в випадкі відіному від А менше за В
else:
    for i in range(b ,a+1):
        print(a)
        a -= 1
#------------------------------------------------------------------------------


#task3-------------------------------------------------------------------------
"""

Ряд - 3
Даны два целых числа A и В, A>B. Выведите все нечётные числа от A до B 
включительно. В этой задаче можно обойтись без инструкции if.
"""
#Програма для виводу всіх непарних чисел від А до В, де А>В
#a- число з якого пчинається перелік b- число яким закінчується.
a = int (input())
b = int (input())
#Вивід числового ряду
for i in range(a, b-1, -1):
    if i%2==1:
        print(i)

#------------------------------------------------------------------------------


#task4-------------------------------------------------------------------------
"""

Сумма десяти чисел
Дано 10 целых чисел. Вычислите их сумму. Напишите программу, 
использующую наименьшее число переменных.
"""
#Програма  для підрахунку 10 цілих чисел 
print(sum(int(input()) for i in range (10)))

#------------------------------------------------------------------------------


#task5-------------------------------------------------------------------------
"""

Сумма N чисел
Дано несколько чисел. Вычислите их сумму. Сначала вводите количество чисел N, 
затем вводится ровно N целых чисел. Какое наименьшее число переменных нужно 
для решения этой задачи?
"""
#програма для підрахунку суми N цілих чисел 
print(sum(int(input()) for i in range(int(input( )))))

#------------------------------------------------------------------------------


#task6-------------------------------------------------------------------------
"""

Сумма кубов
По данному натуральном n вычислите сумму 1^3+2^3+3^3+...+n^3.
"""
№6
#Програма обчисленя 1**3 + 2**3 + ... + n**3
# sum - стала для обчислення 
sum = 0
for i in range(int(input())):
    sum += (i+1)**3
#Вивід результату обчисленого рівняння
print(sum)

#------------------------------------------------------------------------------


#task7-------------------------------------------------------------------------
"""

Факториал
Факториалом числа n называется произведение 1 × 2 × ... × n. Обозначение: n!.
По данному натуральному n вычислите значение n!. Пользоваться математической 
библиотекой math в этой задаче запрещено.
"""
# Програма для обчислення n!
# res- стала для обчислення
res = 1
for i in range(int(input())):
    res *= (i+1)
# Вивід обчисленої відповіді
print(res)

#------------------------------------------------------------------------------


#task8-------------------------------------------------------------------------
"""

Сумма факториалов
По данному натуральном n вычислите сумму 1!+2!+3!+...+n!. В решении этой 
задачи можно использовать только один цикл. Пользоваться математической 
библиотекой math в этой задаче запрещено.
"""
# Програма для підрахунку суми факторіалів
# sum- стала для підрхунку суми 
# fakt- стала для підрахунку факторіала
sum=0 
fact = 1
for i in range(int(input())):
   #Обчислення факторіала
   fact*=(i+1) 
   sum+=fact 
# Виведення відповіді
print(sum)

#------------------------------------------------------------------------------


#task9-------------------------------------------------------------------------
"""

Количество нулей
Дано N чисел: сначала вводится число N, затем вводится ровно N целых чисел. 
Подсчитайте количество нулей среди введенных чисел и выведите это количество. 
Вам нужно подсчитать количество чисел, равных нулю, а не количество цифр.
"""
# Програма для знаходження кількості 0 серед n чисел 
# sum- стала для знаходження кылькосты
sum=0
for i in range(int(input())):
    # перевірка чи 0
    if int(input()) == 0:
        # лічильник нулів
        sum += 1;
#вивід відповіді
print(sum)

#------------------------------------------------------------------------------


#task10------------------------------------------------------------------------
"""

Лесенка
По данному натуральному n ≤ 9 выведите лесенку из n ступенек, i-я ступенька 
состоит из чисел от 1 до i без пробелов.
"""
#Програма для виведення "лесенки"
#Загальний цикл
for i in range(int(input())):
    #Цикл для одного рядка 
    for j in range(i+1): 
        print(j+1,end='') 
    print()

#------------------------------------------------------------------------------


#task11------------------------------------------------------------------------
"""

Потерянная карточка
Для настольной игры используются карточки с номерами от 1 до N. Одна карточка 
потерялась. Найдите ее, зная номера оставшихся карточек.
Дано число N, далее N − 1 номер оставшихся карточек (различные числа от 1 до 
N). Программа должна вывести номер потерянной карточки.
Для самых умных: массивами и аналогичными структурами данных пользоваться 
нельзя.
"""
#програма для знахождення загубленої картки 
#n - кількість карток в коді
#sum-сума значень карток sumkar-кума значень карток що залишились
n = int(input())
sum = 0
sumkar = 0
#обчислення суми значень карток 
for i in range(1,n+1):
    sum += i
#обчислення суми значень карток що залишилось
for i in range(n-1):
    kar = int(input())
    sumkar += kar
#вивід загубленої картки 
print(sum-sumkar)

#------------------------------------------------------------------------------