# task1-------------------------------------------------------------------------
"""

Даны четыре действительных числа: x1, y1, x2, y2. Напишите функцию distance(x1,
y1, x2, y2), вычисляющая расстояние между точкой (x1,y1) и (x2,y2). 
Считайте четыре действительных числа и выведите результат работы этой функции.
Если вы не знаете, как решить эту задачу, то вы, возможно, не изучали в школе 
теорему Пифагора. Попробуйте прочитать о ней на Википедии.
"""


# Програма для обчислення відстані між двома точками
# Присвоєння функції
def distance(x1, y1, x2, y2):
    # Обчислення функції
    dist = ((x2 - x1) ** 2 + (y2 - y1) ** 2) ** 0.5
    # вивід значення функції на екран
    print(dist)


# ввід координат точок
x1 = float(input())
y1 = float(input())
x2 = float(input())
y2 = float(input())
# обчислення через функцію
distance(x1, y1, x2, y2)
# ------------------------------------------------------------------------------


# task2-------------------------------------------------------------------------
"""

Дано действительное положительное число a и целоe число n.

Вычислите an. Решение оформите в виде функции power(a, n).

Стандартной функцией возведения в степень пользоваться нельзя.
"""


# Програма для обчислення числа a в степені n
# Прсвоєння функції
def power(a, n):
    # піднесення до сткпеню
    power = a ** n
    # Вивід функції
    print(power)


# ввід даних в програму
a = float(input())
n = int(input())
# обчислення функції
power(a, n)
# ------------------------------------------------------------------------------


# task3-------------------------------------------------------------------------
"""

Дано действительное положительное число a и целое неотрицательное число n. 
Вычислите an не используя циклы, возведение в степень через ** и функцию 
math.pow(), а используя рекуррентное соотношение an=a*an-1.

Решение оформите в виде функции power(a, n).
"""


# Програма для піднесення числа в степінь
# Присвоєння назви функції
def power(a, n):
    # початкове значення, якщо n уже дорівнює 0
    if n == 0:
        return 1
    # підрахунок степення в іншому випадку
    else:
        return a * power(a, n - 1)


# вивід відповіді
print(power(float(input()), int(input())))
# ------------------------------------------------------------------------------


# task4-------------------------------------------------------------------------
"""

Напишите функцию fib(n), которая по данному целому неотрицательному n 
возвращает n-e число Фибоначчи. В этой задаче нельзя использовать циклы — 
используйте рекурсию.
Во всех задачах считывайте входные данные через input() и выводите ответ через 
print().
"""


# Програма для запису числа фібоначі за номером
# присвоєння функції
def fib(n):
    # якщо номер дорівнює 0 то число фібоначі 0
    if n == 0:
        return 0
    # якщо номер дорівнює 1 то число фібоначі 1
    elif n == 1:
        return 1
    # підрахунок за допомогою рекуренсії
    else:
        return fib(n - 1) + fib(n - 2)


# вивід числа фібоначі
print(fib(int(input())))
# ------------------------------------------------------------------------------
