#task1------------------------------------------------------------
"""
Умова: Дано два цілих числа. Вивести найменше з них.
Вхідні дані: користувач вводить ціле число
Вихідні дані: вивести ціле число
"""



#write your answer here...

print('Введите первое число')
number_one=int(input()) #присваивается значение первой переменной
print('Введите второе число')
number_two=int(input()) #присваивается значение второй переменной
if number_one>number_two: #проверка условия сравнение двух заданных чисел
    	print(number_two)
if number_one<number_two: #проверка условия сравнение двух заданных чисел
    	print(number_one)
if number_one==number_two: #проверка условия сравнение двух заданных чисел
    print('Числа равны друг другу')


#task2------------------------------------------------------------
"""
Умова: Вивести результат функції sign(x), що визначається наступним чином: 
sign(x)=1, if x>0
sign(x)=-1, if x<0
Sign(x)=0, if x=0
Вхідні дані: користувач вводить дійсне число.
Вихідні дані: вивести результат sign

"""



#write your answer here...

print('Введите число')
number=int(input()) #переменной присваивается значение
if number>0: # проверка условия, является ли число больше нуля
    print(1)
elif number<0: # проверка условия, является ли число меньше нуля
    print(-1)
elif number==0: # проверка условия, является ли число равным нуля
    print(0)

#task3------------------------------------------------------------
"""
Умова: Дано три цілих числа. Вивести найменше з них.
Вхідні дані: 3 цілих числа.  Кожне число користувач вводить в окремому рядку.
Вихідні дані: вивести ціле число
"""



#write your answer here...

print('Введите три числа')
number_one=input() #пользователь присваивает первой переменной значение
number_two=input()  #пользователь присваивает второй переменной значение
number_three=input() #пользователь присваивает третьей переменной значение
if number_one<number_two and number_one<number_three: #происходит сравнение чисел
    print(number_one) 
if number_two<number_one and number_two<number_three:#происходит сравнение чисел
    print(number_two)
if number_three<number_one and number_three<number_two:#происходит сравнение чисел
    print(number_three) #вывод на экран меньшего из заданных чисел

#task1------------------------------------------------------------
"""
task description in ua
Ctrl+C Ctrl+V from amis.fpm.kpi.ua
"""



#write your answer here...

#-----------------------------------------------------------------


#task4------------------------------------------------------------
"""
Умова: Дано ціле число, що визначає рік. Визначити, чи є вказаний рік високосним. Якщо так, то вивести користувачу "LEAP", в іншому випадку – "СOMMON".
Рік високосний, якщо виконується хоча б одна з умов:
* рік завжди високосним, якщо його номер ділиться на 4 без остачі і не ділиться без остачі на 100
* рік завжди високосним, якщо його номер ділиться на 400 без остачі
Вхідні дані: ціле число, що вводить користувач
Вихідні дані: вивести текстовий рядок.

"""



#write your answer here...

print('Write the year')
year=int(input()) #пользователь вводит год
a=year%100 
b=year%4
c=year%100
if c==0: #проверка условия для высокосного года
    print('LEAP')
elif b==0 and a!=0: #дополнительное условие для высокосного года
    print('LEAP')
else: # в случаях, неудовлетворяющих указанные выше, год является невысокосным
    print('COMMON')

#task5------------------------------------------------------------
"""
Умова: Дано три цілих числа. Визначте, скільки з них дорівнюють один одному. Програма повинна виводити одне з чисел: 3 (якщо всі числа однакові), 2 (якщо два з них дорівнюють один одному, а третє відрізняється) або 0 (якщо всі числа різні).
Вхідні дані: 3 цілих числа.  Кожне число користувач вводить в окремому рядку.
Вихідні дані: вивести ціле число
"""



#write your answer here...

print('Введите три числа')
number_one=int(input()) # пользователь вводит первое число,присваивает переменной значение
number_two=int(input())  # пользователь вводит второе число,присваивает переменной значение
number_three=int(input())  # пользователь вводит третье число,присваивает переменной значениe
if number_one==number_two==number_three: #проверка условия равности трех заданных чисел
    print('3')
elif number_one==number_two or number_one==number_three:  #проверка условия равности двух заданных чисел
        print('2')
elif number_two==number_one or number_two==number_three:  #проверка условия равности двух заданных чисел
            print('2')
else:
           print(0)

#task6------------------------------------------------------------
"""
Умова: Шахова тура переміщається по горизонталі або по вертикалі. Дано координати двох клітин шахової дошки. Визначити, чи може тура перейти з першої клітини у другу за один хід. Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини. Перші два числа - для першої клітини, останні два числа – для другої. Програма має вивести "YES", якщо тура може виконати переміщення, або "NO" в іншому випадку."""



#write your answer here...

print('Введите координаты первой шахматной клетки(от 1 до 8)')
chess_x1=int(input()) #пользователь вводит первую координату первой клетки
chess_y1=int(input()) #пользователь вводит вторую координату первой клетки
print('Введите координаты второй шахматной клетки(от 1 до 8)')
chess_x2=int(input()) #пользователь вводит первую координату второй клетки
chess_y2=int(input()) #пользователь вводит вторую координату второй клетки
if chess_y2==chess_y1+1 or chess_y2==chess_y1-1 or chess_x2==chess_x1+1 or chess_x2==chess_x2-1: #проверка необходимого условия для перемещения
    print('YES')
else:  #если условие не удовлетворяется, перемещение невозможно
    print('NO')


#task7------------------------------------------------------------
"""
Дано координати двох клітин шахової дошки. Визначити, чи однакового вони кольору. Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини. Перші два числа - для першої клітини, останні два числа – для другої. Програма має вивести "YES", якщо колір однаковий, або "NO" в іншому випадку.
Вхідні дані: 4 цілих числа.  Кожне число користувач вводить в окремому рядку.
Вихідні дані: вивести текстовий рядок.

"""



#write your answer here...
print('Введите координаты первой шахматной клетки')
chess_x1=int(input()) #пользователь вводит координату первой клетки
chess_y1=int(input()) #пользователь вводит координату первой клетки
print('Введите координаты второй шахматной клетки')
chess_x2=int(input()) #пользователь вводит координату второй клетки
chess_y2=int(input()) #пользователь вводит координату второй клетки
if (chess_x1+chess_y1)%2==(chess_x2+chess_y2)%2: #проверка условия одинакового цвета двух клеток заданных координат
    print("YES")
else: #если условие не удовлетворено, клетки не одинаковые
    print("NO")

#task8------------------------------------------------------------
"""
Шаховий король переміщується по горизонталі, по вертикалі або по діагоналі на будь-яку сусідню клітинку. Дано координати двох клітин шахової дошки. Визначити, чи може король перейти з першої клітини у другу за один хід. Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини. Перші два числа - для першої клітини, останні два числа – для другої. Програма має вивести "YES", якщо хід можливий, або "NO" в іншому випадку.
Вхідні дані: 4 цілих числа.  Кожне число користувач вводить в окремому рядку.
Вихідні дані: вивести текстовий рядок.
"""



#write your answer here...

#king_x1=int(input()) #пользователь вводит координаты клетки, на которой стоит король
king_y1=int(input()) #пользователь вводит координаты клетки, на которой стоит король
print('Введите координаты другой шахматной клетки')
king_x2=int(input())  #пользователь вводит координаты второй клетки
king_y2=int(input())  #пользователь вводит координаты второй клетки
if king_x2==king_x1-1 or king_x2==king_x1+1 or king_y2==king_y1-1 or king_y2==king_y1+1: #проверка условия, может ли король перейти из первоначальной клетки во вторую
    print('YES')
else: # если условие не удовлетворено, то не может
    print('NO')

#task9------------------------------------------------------------
"""
Умова: Шаховий слон рухається по діагоналі на будь-яку кількість клітин. Дано координати двох клітин шахової дошки. Визначити, чи може слон перейти з першої клітини у другу за один хід. Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини. Перші два числа - для першої клітини, останні два числа – для другої. Програма має вивести "YES", якщо хід можливий, або "NO" в іншому випадку.
Вхідні дані: 4 цілих числа.  Кожне число користувач вводить в окремому рядку.
Вихідні дані: вивести текстовий рядок.
"""



#write your answer here...

# print('Введите координаты шахматной клетки, на которой стоит слон')
chess_x1=int(input()) #пользователь вводит первую координату клетки, на которой стоит слон
chess_y1=int(input()) #пользователь вводит вторую координату клетки, на которой стоит слон
print('Введите координаты другой шахматной клетки')
chess_x2=int(input()) #пользователь вводит первую координату второй клетки
сhess_y2=int(input()) #пользователь вводит вторую координату второй клетки
if (chess_x1+chess_x2)^2==(chess_y1+chess_y2)^2: #проверка условия перехода слона из первоначальной клетки во вторую
    print('YES')
else: #если условие не удовлетворено, то не может
    print('NO')


#task10------------------------------------------------------------
"""
Умова: Шахова королева рухається по горизонталі, по вертикалі або по діагоналі на будь-яку кількість клітин. Дано координати двох клітин шахової дошки. Визначити, чи може королева перейти з першої клітини у другу за один хід. Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини. Перші два числа - для першої клітини, останні два числа – для другої. Програма має вивести "YES", якщо хід можливий, або "NO" в іншому випадку.
Вхідні дані: 4 цілих числа.  Кожне число користувач вводить в окремому рядку.
Вихідні дані: вивести текстовий рядок.
"""



#write your answer here...

print('Введите координаты шахматной клетки, на которой стоит королева')
quenn_x1=int(input()) #пользователь вводит первую координату клетки, на которой стоит королева
quenn_y1=int(input())  #пользователь вводит вторую координату клетки, на которой стоит королева
print('Введите координаты другой шахматной клетки')
chess_x2=int(input())  #пользователь вводит первую координату второй клетки
chess_y2=int(input())  #пользователь вводит вторую координату второй клетки
if (quenn_x1+chess_x2)^2==(quenn_y1+chess_y2)^2 and chess_x2==quenn_x1-1 or chess_x2==quenn_x1+1 or chess_y2==quenn_y1-1 or chess_y2==quenn_y1+1: #проверка условия, необходимой для переходы королевы из первой клетки во вторую
    print('YES')
else: #если условие не удовлетворено,  то не может
    print('NO')

#task11------------------------------------------------------------
"""
Умова: Шаховий кінь рухається як літера L. Він може переміщатись на дві клітинки по горизонталі і одну клітинку по вертикалі або на дві клітинки по вертикалі і одну по горизонталі. Дано координати двох клітин шахової дошки. Визначити, чи може кінь перейти з першої клітини у другу за один хід. Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини. Перші два числа - для першої клітини, останні два числа – для другої. Програма має вивести "YES", якщо хід можливий, або "NO" в іншому випадку.
Вхідні дані: 4 цілих числа.  Кожне число користувач вводить в окремому рядку.
Вихідні дані: вивести текстовий рядок.
"""



#write your answer here...

# print('Введите координаты шахматной клетки, на которой стоит конь')
chess_x1=int(input()) #пользователь вводит координату клетки, на которой стоит конь
chess_y1=int(input()) #пользователь вводит координату клетки, на которой стоит конь
print('Введите координаты другой шахматной клетки')
chess_x2=int(input()) #пользователь вводит координату второй клетки
chess_y2=int(input()) #пользователь вводит координату второй клетки
if (abs(chess_x2-chess_x1)==1 and abs(chess_y2-chess_y1)==2) or (abs(chess_y2-chess_y1)==1 and abs(chess_x2-chess_x1)==2): #условие необходимое для перехода коня из первой клетки во вторую
    print('YES')
else: # если условие не удовлетворено, то нет не может
    print('NO')

#task12------------------------------------------------------------
"""
Умова: Шоколад має форму прямокутника, розділеного на n?m клітин. Шоколад може бути розділений на дві частини тільки по горизонталі або по вертикалі, при цьому клітини мають бути цілими. Визначити, чи можна розділити шоколад за один крок таким чином, щоб одна з частин матиме точно k клітин. Програма має вивести "YES", якщо шоколад можна поділити, або "NO" в іншому випадку.
Вхідні дані: 3 цілих числа: n,m, k. Кожне число користувач вводить в окремому рядку.
Вихідні дані: вивести текстовий рядок.
"""



#write your answer here...

print('Введите размерность шоколада n*m')
n=int(input()) #пользователь вводит значение высоты шоколада
m=int(input()) #пользователь вводит значение ширины шоколада
print('Введите k клеток')
k=int(input()) #пользователь вводит произвольное число k
a=k%m
b=k%n
if a==0 or b==0: #условие необходимое для того, чтобы определить возможно ли сломать шоколадку n*m таким образом, чтобы одна из частей содержала k клеток
    print('YES')
else: #если условие не удовлетворено, то не может
    print('NO')




