#task1------------------------------------------------------------
"""
Напишіть програму, яка отримує три числа і друкує їх суму. Кожне число користувач вводить у окремому рядку.
"""



a=float(input())#Input a
b=float(input())#Input b
c=float(input())#Input c
print(a+b+c)#output of sum

#-----------------------------------------------------------------


#task2------------------------------------------------------------
"""
Напишіть програму, яка отримує довжини двох катетів прямокутного трикутника та виводить його площу. Користувач вводить довжини катетів у окремих рядках.
"""



a=float(input())#Введення користувачем довжини першого катета
b=float(input())#Введення користувачем довжини другого катета 
print((a*b)/2)#Виведення площі прямокутного трикутника

#-----------------------------------------------------------------


#task3------------------------------------------------------------
"""
N студентів отримали K яблук і розподілити їх між собою порівну. Неподілені яблука залишились у кошику. Скільки яблук отримає кожен студент? Скільки яблук залишиться в кошику?
"""



n=int(input())#Введення користувачем даних про кількість студентів
k=int(input())#Введення користувачем даних про кількість яблук
c=k//n #Визначення кількості яблук, що дістануться кожному студенту
print(c) #Виведення інформації про кількість яблук, що дістануться кожному студенту
if c==0: # Умова, яка передбачає неможливість ділення на нуль, за умови що кожному студенту не дістанеться жодного якбука
    print(k) #Виведення інформації про к-ть яблук, що зостануться в кошику при виконанні попередньої умови
else:#Умова що передбачає невиконання попередньої умови	
    print(k%(c*n))#Виведення к-ті яблук, що зостануться в кошику при виконанні попередньої умови


#-----------------------------------------------------------------


#task4------------------------------------------------------------
"""
Нехай число N - кількість хвилин, відрахованих після півночі. Скільки годин і хвилин буде показувати цифровий годинник, якщо за відлік взяти 00:00?
"""



x=int(input())#Введення користувачем данних про кількість хвилин, що минули після опівночі
if x>=1440:#Умова виконання якої означає, що з опівночі пройшло більше ніж доба(24 години)
    x=x%1440#Дія, яка при виконанні попередньої умови - зменшує кількість хвилин до кількості що менша кількості хвилин в добі 
h=x // 60#Визначення кількості годин
print(h,(x-(h*60)))#Обчислення кількості хвилин, та виведення показників усів показників годинника: години хвилини


#-----------------------------------------------------------------

    
#task5------------------------------------------------------------
"""
Напишіть програму, яка вітає користувача, друкуючи слово "Hello", ім'я користувача і знак оклику після нього. Наприклад “Hello, Mike!”
"""



name=input()#Введення користувачем даних про своє ім'я
name=name+'!'
print('Hello, ',name)#Виведення привітання


#-----------------------------------------------------------------


#task6------------------------------------------------------------
"""
Напишіть програму, яка зчитує ціле число і друкує його попереднє і наступне значення за форматом:

 	
The next number for the number 179 is 180.
The previous number for the number 179 is 178.
"""



z=int(input())#Введення користувачем цілого числа
print('The next number for the number ',z,' is ',z+1)#Виведення наступного за значенням цілого числа
print('The previous number for the number ',z,' is ',z-1)#Виведення попереднього за значенням цілого числа


#-----------------------------------------------------------------


#task7------------------------------------------------------------
"""
Школа вирішила сформувати три нові групи учнів та надати їм окремі класи. У кожному класі необхідно встановити столи для учнів, у розрахунку, що за одним столом може сидіти не більше двох учнів. Яку мінімальну кількість столів необхідно придбати?
"""



a=int(input())#Введення користувачем даних кількості учнів в першій групі
b=int(input())#Введення користувачем даних кількості учнів в другій групі
c=int(input())#Введення користувачем даних кількості учнів в третій групі
d=0
if a%2==0:
    d+=a//2
else: d+=(a//2)+1
if b%2==0:
    d+=b//2
else: d+=(b//2)+1
if c%2==0:
    d+=c//2
else: d+=(c//2)+1
print(d)#Виведення необхідної кількості парт


#-----------------------------------------------------------------
