#Завдання1-----------------------------------------------------------------------------------------------------------

"""

По данному целому числу N распечатайте все квадраты натуральных чисел, не превосходящие N, в порядке возрастания.

"""
#Програма для виведення списку 
number=int(input())#Введення числа
variable = 1#Присвоєння змінній значення 1
while (variable**2) <=number:#Цикл (якщо виконується умова, що квадрат числа не переважає введеного числа)
    print(variable ** 2)#Виведення квадратів
    variable += 1#Додавання до числа 1

#Завдання2-----------------------------------------------------------------------------------------------------------

"""

Дано целое число, не меньшее 2. Выведите его наименьший натуральный делитель, отличный от 1.

"""
# Програма для знаходження найменшого натурального дільника
number=int(input()) #виведення числа
variable=2  #присвоєння змінній значення 2
while number%variable!=0: #цикл, якщо виконується умова остача від ділення дорівнює 0
    if number<2:  #якщо число менше 2
        break  #цикл переривається 
    variable+=1 #число збільшується на 1
else:  #інакше
    print(variable)  #виведення числа


#Завдання3-----------------------------------------------------------------------------------------------------------

"""

По данному натуральному числу N найдите наибольшую целую степень двойки,
не превосходящую N. Выведите показатель степени и саму степень.

"""

number=int(input())#Введення числа користувачем
variable=2#Присвоєння змінній значення 2
i=0#Присвоєння типовій змінній 0
while variable<=number:#Цикл(якщо виконується умова,що степінь двійки не перевищує введеного числа)
    variable*=2#Множення змінної на 2 
    i+=1#Додавання до змінної 1
else:#інакше
    print(i,variable/2)#Виведення показника степеня і саму степінь

#Завдання4-----------------------------------------------------------------------------------------------------------

"""

В первый день спортсмен пробежал x километров, а затем он каждый день увеличивал пробег на 10% от предыдущего значения.
По данному числу y определите номер дня, на который пробег спортсмена составит не менее y километров.

"""
#програма для знаходження дня досягнення пробігу спортсмена в 1км 
start_distance=int(input())  #Виведення першого числа
finished_distance=int(input())  #Виведення другого числа
i=1  #присвоєння змінній і значення 1
while start_distance<finished_distance:  #цикл, якщо перше число більше за друге
    i+=1 #змінна збільшується на 1
    start_distance+=(0.1*start_distance) #до початкової відстані поступово додається по 10%
else: #інакше
    print(i) #виводиться значення змінної і

#Завдання5-----------------------------------------------------------------------------------------------------------

"""

Вклад в банке составляет x рублей.Ежегодно он увеличивается на p процентов,
после чего дробная часть копеек отбрасывается. Определите, через сколько лет вклад составит не менее y рублей.
Выражение «дробная часть копеек отбрасывается» означает, что если у вас оказалось 123.4567 рублей,
т. е. 123 рубля и 45.67 копеек, то после округления у вас получится 123 рубля и 45 копеек, т.е. 123.45 рублей.
Программа получает на вход три натуральных числа: x, p, y и должна вывести одно целое число.

"""
number=int(input()) #вводиться число
number_of_persents=int(input()) #вводиться кількість відсотків
number_of_years=int(input()) #вводиться кількість років
number_of_persents=number_of_persents/100 #кількість відсотків ділиться на 100
i=0 #змінна дорівнює 0
while number<number_of_years: #цикл, якщо число більше за кількість років
    i+=1 #кількість збільшується на 1
    number+=(number_of_persents*number) #до змінної додається кількість відсотків
    number=(number*100//1)/100 #знаходження відсотків
else: #інакше
    print(i) #виводить ціле число
#Завдання6-----------------------------------------------------------------------------------------------------------

"""

Последовательность состоит из натуральных чисел и завершается числом 0. 
Определите, сколько элементов этой последовательности равны ее наибольшему элементу.

"""
number=1#Присвоєння змінній значення 1 
i=0#Присвоєння змінній значення 0 
while number>0:#Цикл (якщо виконується умова що число не дорівнює 0)
    number=int(input())#Введення числа користувачем
    i+=1#Переприсвоєння змінній значення на 1 більше
print(i-1)#Виведення кількості членів послідовності

#Завдання7-----------------------------------------------------------------------------------------------------------

"""


должна закончить свою работу и вывести количество членов последовательности (не считая завершающего числа 0).
Числа, следующие за числом 0, считывать не нужно.

"""
b=0
x=1
while x>0 or x<0:
    x=int(input())
    b+=x
print(b)
#Завдання8-----------------------------------------------------------------------------------------------------------

"""

Определите сумму всех элементов последовательности, завершающейся числом 0. 
В этой и во всех следующих задачах числа, следующие за первым нулем, учитывать не нужно.

"""
#Програма для обчислення середнього значення послідовності
sum_of_elements=0#Присвоєння змінній значення 0
number=1#Присвоєння змінній значення 1
i=0#Присвоєння змінній значення 0
while number>0 or number<0:#Цикл(якщо виконується умова, що число не дорівнює 0)
    number=int(input())#Введення числа користувачем
    sum_of_elements+=number#Знаходження суми елементів
    i+=1#Переприсвоєння змінній значення на 1 більше
print(sum_of_elements/(i-1))#Знаходження середнього значення послідовності

#Завдання9-----------------------------------------------------------------------------------------------------------

"""

Определите среднее значение всех элементов последовательности, завершающейся числом 0.

"""
number=1 #присвоєння змінній значення х
max_element=0 #найбільшому елементу надане значення 0
while number>0: #цикл, якщо число більше 0
    number=int(input()) #виводиться число
    if number>max_element: #якщо число більше, ніж максимальний елемент
        max_element=number #максисальний елемент дорівнює числу
print(max_element) #виведення найбільшого значення

#Завдання10-----------------------------------------------------------------------------------------------------------

"""

Последовательность состоит из натуральных чисел и завершается числом 0. 
Определите значение наибольшего элемента последовательности.

"""
#Програма для індексу максимума послідовності
number=1#Присвоєння змінній значення 1
maxnumber=0#Присвоєння змінній значення 0
i=0#Присвоєння змінній значення 0
index=0#Присвоєння змінній значення 0
while number>0:#Цикл (якщо число не дорівнює 0)
    number=int(input())#Введення числа користувачем
    i+=1#Переприсвоєння змінній значення на 1 більше
    if number>maxnumber:#Умова якщо число більше за максимальне значення
        maxnumber=number#Задання змінній значення найб. числа 
        index=i#Знаходження індексу 
print(index-1)#Виведення індексів

#Завдання11-----------------------------------------------------------------------------------------------------------

"""

Последовательность состоит из натуральных чисел и завершается числом 0.
Определите индекс наибольшего элемента последовательности.
Если наибольших элементов несколько, выведите индекс первого из них. Нумерация элементов начинается с нуля.

"""
#Програма для знаходження кількості парних елементів
number=1 #Числу надається значення 1
number_of_pair_elements=0 #кількість парних елементів дорівнює 0
while number>0: #цикл, якщо число більше 0
    number=int(input()) #введення числа
    if number%2==0: #якщо число ділиться націло на 2
        number_of_pair_elements+=1 #кількість парних елементів збільшується на 1
print(number_of_pair_elements-1) #виведення кількості парних елементів

#Завдання12-----------------------------------------------------------------------------------------------------------

"""

Определите количество четных элементов в последовательности, завершающейся числом 0.

"""
#Програма для знаходження кількості елементів, які більші за попередні
number=1 #числу надається значення 1
next_number_bigger=0 #настопному числу надається значення 0
previous_number=0 #попереднє число дорівнює 0
while number>0: #цикл, якщо число більше 0
    number=int(input()) #вводиться значення
    z=number #змінна дорівнює числу
    if previous_number<number: #якщо попереднє число менше за наступне
        previous_number=number #попереднє число дорівнює числу
        next_number_bigger+=1 #число збільшується на 1
    else: #інакше
       previous_number=z #попереднє число дорівнює змінній
print(next_number_bigger-1) #виведення попереднього числа

#Завдання13-----------------------------------------------------------------------------------------------------------

"""

Последовательность состоит из натуральных чисел и завершается числом 0. 
Определите, сколько элементов этой последовательности больше предыдущего элемента.

"""
number=1#Присвоєння змінній значення 1
max_number=0#Присвоєння змінній значення 0
second_maximum=0#Присвоєння змінній значення 0
while number>0:#Цикл (За умови якщо число більше 0)
    number=int(input())#Введеннч числа
    if number>max_number:#Умова якщо число більше найб. значення
        second_maximum=max_number#Присвоїти змінній значення найб. значення
        max_number=number#Присвоїти змінній значення введеного числа
    elif number>second_maximum:#Умова якщо число більше другого максимуму
        second_maximum=number#Присвоїти зміній значення числа
print(second_maximum)#вивести другий максимум

#Завдання14-----------------------------------------------------------------------------------------------------------

"""

Последовательность состоит из различных натуральных чисел и завершается числом 0. 
Определите значение второго по величине элемента в этой последовательности. 
Гарантируется, что в последовательности есть хотя бы два элемента.

"""
#Пограма для знаходження кількості елементів послідовності, елементи якої дорівнюють її найбільшому числу
number=1 #числу надається значення 1
b=0
i=0
while number>0: #цикл, якщо число більше 0
    number=int(input()) #вводиться число
    if b<number: #якщо змінна більша за число 
        b=number #змінна дорівнює числу
        i=0 #надається значення 0
    elif number==b: #якщо число дорівнює змінній
        i+=1 #значення збільшується на 1
print(i+1) #виводить найбільший елемент
