#task1------------------------------------------------------------
"""
#програма яка порівнює два числа
number_1 = int(input())#введення першого числа
number_2 = int(input())#введення другого числа
if number_1 > number_2:#порівняння двох чисел 
   print(number_2)#якщо умова правильна виведення другого числа
else:
    print(number_1)#якщо умова не правильна виведення першого числа

"""



#write your answer here...

#-----------------------------------------------------------------


#task2------------------------------------------------------------
"""
#програма яка визначає знак числа
number  = int(input())#введення числа
if number > 0:#порівняння числа
    print ("1")#виведення результату якщо вищезадана умова правильна
elif number < 0:#порівняння числа
    print("-1")#виведення результату якщо вищезадана умова правильна
else:
    print("0")#виведення результату якщо не одна з вищезаданих умов не є правильними


"""



#write your answer here...

#-----------------------------------------------------------------


#task3------------------------------------------------------------
"""
#програма яка визначає чи однакового колльору дві клітинки
coordinate_x1=int(input())#введення першої координати початкової клітинки
coordinate_y1=int(input())#введення другої координати початкової клітинки
coordinate_x2=int(input())#введення першої координати кінцевої клітинки
coordinate_y2=int(input())#введення другої координати кінцевої клітинки
if (coordinate_x1+coordinate_y1)%2==(coordinate_x2+coordinate_y2)%2 :#порівняння суь двох не відповідних координат
    print("YES")#виведення результату якщо вище задана умова правильна
else:
    print("NO")#виведення результату якщо вище задана умова не правильна
"""

#write your answer here...

#-----------------------------------------------------------------

#task4------------------------------------------------------------
"""
#програма яка визначає чи високосний рік
year = int(input())#введення року 
if year % 4 ==0 and year % 100 != 0:#визначення чи належить рік до високосного
    print ("YES")#виведення результату якщо вщевказана умова є правильною
elif year % 400 == 0:#
    print ("YES")#виведення результату якщо вщевказана умова є правильною
else:
    print("NO")#виведення результату якщо вщевказані умови є неправильною

"""



#write your answer here...

#-----------------------------------------------------------------

#task5------------------------------------------------------------
"""
#програма яка виводить найменше число з 3 заданих
number_1 = int(input())#введення першого числа
number_2 = int(input())#введення другого числа
number_3 = int(input())#введення третоьго числа
if number_1 > number_2 and number_3 > number_2:#порівняння другог числа з першим і третім
   print(number_2)#вивелення результату якщо вищесказана умова є правильною
elif number_2 > number_1 and number_3 > number_1:#порівняння першого числа з другим і третім
    print(number_1)#вивелення результату якщо вищесказана умова є правильною
elif number_2 > number_3 and number_1 > number_3:#порівняння третоьго числа з першим і другим
    print(number_3)#вивелення результату якщо вищесказана умова є правильною
else:
    print(number_1)#вивелення результату якщо жодна з вищесказаних умова не є правильною
"""

#write your answer here...

#-----------------------------------------------------------------

#task6------------------------------------------------------------
"""
#програма яка виводить кількість однакових чисел
number_1 = int(input())#введення першого числа
number_2 = int(input())#введення другого числа
number_3 = int(input())#введення трутього числа
if number_1 == number_2 == number_3 :#порівняння 3-ох чисел
    print(3)#вивелення результату якщо вищесказана умова є правильною
elif number_1 == number_2 or number_3 == number_2 or number_3 == number_1 :#дізнаємося чи є хочаб два однакових числа
        print(2)#вивелення результату якщо вищесказана умова є правильною
else:
    print(0)#вивелення результату якщо жодна з вищесказаних умова не є правильною

"""

#write your answer here...

#-----------------------------------------------------------------

#task7------------------------------------------------------------
"""
#програма яка виводить чи може тура переміститися в задану клітинку
coordinate_x1 = int(input())#введення першої координати початкової клітинки
coordinate_y1 = int(input())#введення другої координати початкової клітинки
coordinate_x2 = int(input())#введення першої координати кінцевої клітинки
coordinate_y2 = int(input())#введення другої координати кінцевої клітинки
if coordinate_x1==coordinate_x2 or coordinate_y1==coordinate_y2:#порівняння двох не відповідних координат
    print("YES")#виведення результату якщо вище задана умова правильна
else:
    print("NO")#виведення результату якщо вище задана умова є не правильна

"""

#write your answer here...

#-----------------------------------------------------------------
#task8------------------------------------------------------------
"""
#програма яка виводить чи може король переміститися в задану клітинку
coordinate_x1=int(input())#введення першої координати початкової клітинки
coordinate_y1=int(input())#введення другої координати початкової клітинки
coordinate_x2=int(input())#введення першої координати кінцевої клітинки
coordinate_y2=int(input())#введення другої координати кінцевої клітинки
if abs(coordinate_x1-coordinate_x2)<2 and abs(coordinate_y1-coordinate_y2)<2:#порівняння різниці відповідних координат з двійкою
    print("YES")#виведення результату якщо вище задана умова правильна
else:
    print("NO")#виведення результату якщо вище задана умова не є правильна

"""

#write your answer here...

#-----------------------------------------------------------------
#task9------------------------------------------------------------
"""
#програма яка виводить чи може офіцер переміститися в задану клітинку
coordinate_x1=int(input())#введення першої координати початкової клітинки
coordinate_y1=int(input())#введення другої координати початкової клітинки
coordinate_x2=int(input())#введення першої координати кінцевої клітинки
coordinate_y2=int(input())#введення другої координати кінцевої клітинки
if abs(coordinate_x1-coordinate_x2)==abs(coordinate_y1-coordinate_y2):#перевірка умов
    print("YES")#виведення результату якщо вище задана умова правильна
else:
    print("NO")#виведення результату якщо вище задана умова є не правильна

"""

#write your answer here...

#------------------------------------------------------------------
#task10------------------------------------------------------------
"""
#програма яка виводить чи може ферзь переміститися в задану клітинку
coordinate_x1=int(input())#введення першої координати початкової клітинки
coordinate_y1=int(input())#введення другої координати початкової клітинки
coordinate_x2=int(input())#введення першої координати кінцевої клітинки
coordinate_y2=int(input())#введення другої координати кінцевої клітинки
if (abs(coordinate_x1-coordinate_x2)==abs(coordinate_y1-coordinate_y2)) or ((coordinate_x1==coordinate_x2) or (coordinate_y1==coordinate_y2)):#перевірка умов
    print("YES")#виведення результату якщо вище задана умова правильна
else:
    print("NO")#виведення результату якщо вище задана умова є не правильна

"""

#write your answer here...

#-----------------------------------------------------------------
#task11------------------------------------------------------------
"""
#програма яка виводить чи може ферзь переміститися в задану клітинку
coordinate_x1=int(input())#введення першої координати початкової клітинки
coordinate_y1=int(input())#введення другої координати початкової клітинки
coordinate_x2=int(input())#введення першої координати кінцевої клітинки
coordinate_y2=int(input())#введення другої координати кінцевої клітинки
if (abs(coordinate_x1-coordinate_x2)==2 and abs(coordinate_y1-coordinate_y2)==1) or (abs(coordinate_x1-coordinate_x2)==1 and abs(coordinate_y1-coordinate_y2)==2):#перевірка умов
    print("YES")#виведення результату якщо вище задана умова правильна
else:
    print("NO")#виведення результату якщо вище задана умова є не правильна

"""

#write your answer here...

#-----------------------------------------------------------------
#task12------------------------------------------------------------
"""
#програма яка визначає чи можна розламати шоколадку на певну кількість частин

width = int(input())#введення ширини

length = int(input())#введення довготи

number_lobules = int(input())#введення на скільки частин ділять шоколадку

if (number_lobules%length==0 or number_lobules%width==0) and (number_lobules<=width*length):#обчислення умови

    print ("YES")#виведення результату якщо вище задана умова правильна

else:

    print ("NO")##виведення результату якщо вище задана умова є не правильна


"""

#write your answer here...

#-----------------------------------------------------------------