#Завдання 1------------------------------------------------------------------------------
#Програма яка обчислює відстань між точками
import math
def distance(x1,y1,x2,y2) :#задання функції
    res= (math.sqrt((x2 - x1)**2 + (y2-y1)**2))#обчислення виразу
    return res

x1 = float(input())#введення координати
y1 = float(input())#введення координати
x2 = float(input())#введення координати
y2 = float(input())#введення координати

print(distance(x1,y1,x2,y2))#виведення результату
#----------------------------------------------------------------------------------------

#Завдання 2------------------------------------------------------------------------------
#програма яка обчислює степінь числа
def power(a, n) :#задання функції
    r = a
    if n < 0:#умова порівняння
        n = -n
        for i in range(1,n + 2) :#задання циклу
            a = a * (1 / r)#обчислення виразу
    elif n == 0 :#порівняння числа
        a = 1
    else:
        for i in range(1, n) :#задання циклу
            a = a * r
    return a#результат
a = float(input( ))#введення числа
n = int(input( ))#введення числа
print(power(a, n))#виведення результату
#----------------------------------------------------------------------------------------

#Завдання 3------------------------------------------------------------------------------
#програма яка обчислює певний вираз
def power(a, n) :#задання функції
    if n == 0 :#порівняння числа
        return 1#результат
    return a * power(a, n - 1)#обчислення вирвзу, результат
a = float(input())#введення числа
n = int(input())#введення числа
print(power(a, n))#виведення числа
#----------------------------------------------------------------------------------------

#Завдання 4------------------------------------------------------------------------------
#програма яка визначає число Фібуччі за номером
import math#імпорт бібліотеки
def fib(n):#задання функції
    sqrt5 = math.sqrt(5)#обчислення кореня числа
    phi = (sqrt5 + 1) / 2#обчислення виразу
    return int(phi ** n / sqrt5 + 0.5)#результат
n = int(input())#введення № числа
print(fib(n))#виведення числа
#----------------------------------------------------------------------------------------


