#task1------------------------------------------------------------
"""
#програмa, яка зчитує три числа і виводить їх суму
number_1 = int(input())#введення першого числа
number_2 = int(input())#введення другого числа
number_3 = int(input())#введення третього числа

print(number_1+number_2+number_3)#виведення результату
"""



#write your answer here...

#-----------------------------------------------------------------


#task2------------------------------------------------------------
"""
#програма яка обчислює площу трикутника
legs_1 = int(input())#введення першого катета
legs_2 = int(input())#введення другог катета
print(0.5*legs_1*legs_2)#обчислення площі і виведення результату


"""



#write your answer here...

#-----------------------------------------------------------------


#task3------------------------------------------------------------
"""
#програма яка виводить Hello, name!
name = input()#введення імені
print('Hello'+ ', '  + name + '!')#виведення Hello, name!
"""



#write your answer here...

#-----------------------------------------------------------------

#task4------------------------------------------------------------
"""
#Програма, що зчитує ціле число і виводить наступне та попереднє число
number = input()#Введене число
print('The next number for the number '+ number + ' is '+ str(int(number)+1) + '.')#Виведення наступного числа
print('The previous number for the number ' + number + ' is '+str(int(number)-1) + '.')#Виведення попереднього числа
"""



#write your answer here...

#-----------------------------------------------------------------

#task5------------------------------------------------------------
"""
#програма яка виводить  кількості яблук які дістануться кожному учню,
#виведення кількості яблук які залишились
number_of_students =int(input())#введення кількості учнів
number_of_apple =int(input())#введення кількості яблук
print(number_of_apple//number_of_students)#вивудення кількості яблук які дістануться кожному учню
print(number_of_apple%number_of_students)#виведення кількості яблук які залишились

"""



#write your answer here...

#-----------------------------------------------------------------

#task6------------------------------------------------------------
"""
#програма яка виводить кількість парт для 3 класів
student1=int(input())#введення кількості учнів 1-го класу
desk=student1//2+student1%2#обчислення кількість парт для 1-го класу
student2=int(input())#введення кількості учнів 2-го класу
desk=desk+student2//2+student2%2#обчисленнякількість парт для 2-го класу
student3=int(input())#введення кількості учнів 3-го класу
desk=desk+student3//2+student3%2#обчислення кількість парт для 3-го класу
print(desk)#ввиведення загальної кількості парт
"""



#write your answer here...

#-----------------------------------------------------------------

#task7------------------------------------------------------------
"""
#праграма яка переводить хвилини в год. хв.
minute=int(input())#введення кількості хвилин
minute=minute%1440
print(minute//60,minute%60)#виведення результату
"""



#write your answer here...

#-----------------------------------------------------------------