#task1--------------------------------------------------------------------------------------------------------------------------------
“”” Напишіть програму, яка отримує три числа і друкує їх суму. Кожне число користувач вводить у окремому рядку.“””

print("Please, input 3 values")

first_value=float(input("Value 1: ")) #Перше число
second_value=float(input("Value 2: ")) #Друге число
third_value=float(input("Value 3: ")) #Третє число

sum=first_value+second_value+third_value; #Сумує числа

print("Sum is: ",sum)
#----------------------------------------------------------------------------------------------------------------------------------------

#task2--------------------------------------------------------------------------------------------------------------------------------
“””Напишіть програму, яка отримує довжини двох катетів прямокутного трикутника та виводить його площу. Користувач вводить довжини катетів у окремих рядках. “””

print("Please, input 2 lengths of rectangular triangle") #Прохання ввести довжини катетів

first_length=float(input("First cathetus: ")) #Перший катет
second_length=float(input("Second cathetus: "))#Другий катет

area=(first_length*second_length)/2 #Підстановка в формулу площі

print("Area is: ",area)
#-----------------------------------------------------------------------------------------------------------------------------------------

#task3--------------------------------------------------------------------------------------------------------------------------------
“””N студентів отримали K яблук і розподілити їх між собою порівну. Неподілені яблука залишились у кошику. Скільки яблук отримає кожен студент? Скільки яблук залишиться в кошику? “””

students=int(input("How many people have a company?")) #Скільки всього студентів
apples=int(input("How many apples are in the basket?")) #Скільки всього яблук

print("Every student will have "+str(apples//students)+" "+"apples") #Скільки матиме кожен студент
print("In basket they have "+str(apples%students)+" "+"apples") #Скільки лишиться в кошику
#-----------------------------------------------------------------------------------------------------------------------------------------

#task4-------------------------------------------------------------------------------------------------------------------------------- 
“””Нехай число N - кількість хвилин, відрахованих після півночі. Скільки годин і хвилин буде показувати цифровий годинник, якщо за відлік взяти 00:00? “”” 

N=int(input("Enter the number of minutes: "))

mins=N%60 #Хвилинна стрілка показує остачу від ділення к-сті хвилин на 60
hours=(N%1440)//60      #(N%1440) к-сть хвилин,коли відкидаються завершені дні
                   		 #(N%1440)//60 к-сть завершених годин

print(str(hours)+" : "+str(mins))
#-----------------------------------------------------------------------------------------------------------------------------------------

#task5-------------------------------------------------------------------------------------------------------------------------------- 
“””Напишіть програму, яка вітає користувача, друкуючи слово "Hello", ім'я користувача і знак оклику після нього. Наприклад “Hello, Mike!” “””
name=input("What is your name?")
 print("Hello, "+name+"!")
#-----------------------------------------------------------------------------------------------------------------------------------------

#task6-------------------------------------------------------------------------------------------------------------------------------- 
“””Напишіть програму, яка зчитує ціле число і друкує його попереднє і наступне значення за форматом: “””

print("Let's play! Please, give me a number")

number=int(input("Number: ")) #Користувач вводить будь-яке число

print("The next number for the number "+str(number)+" "+"is "+str(number+1)) #Попередник
print("The previous number for the number "+str(number)+" "+"is "+str(number-1)) #Наступник
#-----------------------------------------------------------------------------------------------------------------------------------------


#task7-------------------------------------------------------------------------------------------------------------------------------- 
“””Школа вирішила сформувати три нові групи учнів та надати їм окремі класи. У кожному класі необхідно встановити столи для учнів, у розрахунку, що за одним столом може сидіти не більше двох учнів. Яку мінімальну кількість столів необхідно придбати? “””
import math

first_class=float(input("How many students are in the first class?")) #К-сть учнів у першому класі
second_class=float(input("How many students are in the second class?")) #К-сть учнів у дргуому класі
third_class=float(input("How many students are in the third class?")) #К-сть учнів у третьому класі

first_tables=math.ceil(first_class/2) #Столів на перший клас
second_tables=math.ceil(second_class/2) #Столів на другий клас
third_tables=math.ceil(third_class/2) #Столів на третій клас

print("In classes you need totally "+str(first_tables+second_tables+third_tables)+" tables") #Сума
