#task1
"""
Умова: Дано два цілих числа. Вивести найменше з них.

Вхідні дані: користувач вводить ціле число

Вихідні дані: вивести ціле число
"""

#Minimum of two numbers#
a = int(input()) #the number
b = int(input()) #the number
if a<b:
    print(a) #the least number
else:
    print(b) #the least number

#task2
"""
Умова: Вивести результат функціїsign(x), що визначається наступним чином: 
sign(x) = 1, if x > 0, 
sign(x) = -1, if x < 0, 
sign(x) = 0, if x = 0..

Вхідні дані: користувач вводить дійсне число.

Вихідні дані: вивести результат sign.
"""

#Sign function#
x = int(input()) #function
if x>0:
    print(1)
elif x<0:
    print(-1)
else:
    print(0)

#task3
"""
Умова: Дано три цілих числа. Вивести найменше з них.

Вхідні дані: 3 цілих числа.  Кожне число користувач вводить в окремому рядку.

Вихідні дані: вивести ціле число
"""

#Minimum of three numbers#
a=int(input()) #the number
b=int(input()) #the number
c=int(input()) #the number
if a<b and a<c :
    print(a)
elif b<a and b<c :
    print(b)
elif c<a and c<b :
    print(c)

#task4
"""
Умова: Дано ціле число, що визначає рік. Визначити, чи є вказаний рік високосним. Якщо так, то вивести користувачу "LEAP", в іншому випадку – "СOMMON".

Рік високосний, якщо виконується хоча б одна з умов:

рік завжди високосним, якщо його номер ділиться на 4 без остачі і не ділиться без остачі на 100
рік завжди високосним, якщо його номер ділиться на 400 без остачі
Вхідні дані: ціле число, що вводить користувач

Вихідні дані: вивести текстовий рядок.
"""

#Leap year#
x = int(input()) #the year
if x % 4 ==0 and x % 100 != 0:
    print ("LEAP")
elif x % 400 == 0:
    print ("LEAP")
else:
    print("COMMON")

#task5
"""
Умова: Дано три цілих числа. Визначте, скільки з них дорівнюють один одному. Програма повинна виводити одне з
чисел: 3 (якщо всі числа однакові), 2 (якщо два з них дорівнюють один одному, а третє відрізняється) або 0 (якщо всі числа різні).

Вхідні дані: 3 цілих числа.  Кожне число користувач вводить в окремому рядку.

Вихідні дані: вивести ціле число
"""

#Equal numbers#
#3 - all are same#
#2 - two of them are equal to each other and the third is different#
#0 - all numbers are different#
a=int(input()) #the number
b=int(input()) #the number
c=int(input()) #the number
if a==b and a==c and b==c:
    print("3")
elif a==b or a==c or b==c:
    print("2")
elif a!=b and b!=c and a!=c:
    print("0")

#task6
"""
Умова: Шахова тура переміщається по горизонталі або по вертикалі. Дано координати двох клітин шахової дошки. Визначити, чи може тура перейти з першої клітини у другу за один хід. Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає 
номер рядку та стовпчика клітини. Перші два числа - для першої клітини, останні два числа – для другої. Програма має вивести "YES", якщо тура може виконати переміщення, або "NO" в іншому випадку.

Вхідні дані: 4 цілих числа.  Кожне число користувач вводить в окремому рядку.

Вихідні дані: вивести текстовий рядок.
"""

#Rook move#
a = int(input()) #for the first square 
b = int(input()) #for the first square 
c = int(input()) #for the second square 
d = int(input()) #for the second square 
if a==c or b==d:
    print("YES")
else:
    print("NO")

#task7
"""
Умова: Дано координати двох клітин шахової дошки. Визначити, чи однакового вони кольору. Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини. 
Перші два числа - для першої клітини, останні два числа – для другої. Програма має вивести "YES", якщо колір однаковий, або "NO" в іншому випадку.

Вхідні дані: 4 цілих числа.  Кожне число користувач вводить в окремому рядку.

Вихідні дані: вивести текстовий рядок.
"""

#Chess board#
x1 = int(input())#for the first square 
y1 = int(input())#for the first square 
x2 = int(input())#for the second square 
y2 = int(input())#for the second square 
if (x1+y1)%2==(x2+y2)%2:
    print("YES")
else:
    print("NO")

#task8
"""
Умова: Шаховий король переміщується по горизонталі, по вертикалі або по діагоналі на будь-яку сусідню клітинку. Дано координати двох клітин шахової дошки. Визначити, чи може король перейти з першої клітини у другу за один хід. 
Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини. Перші два числа - для першої клітини, останні два числа – для другої. Програма має вивести "YES", якщо хід можливий, або "NO" в іншому випадку.

Вхідні дані: 4 цілих числа.  Кожне число користувач вводить в окремому рядку.

Вихідні дані: вивести текстовий рядок.
"""

#King move#
x1 = int(input())#for the first square 
y1 = int(input())#for the first square 
x2 = int(input())#for the second square 
y2 = int(input())#for the second square 
if abs(x1-x2)<2 and abs(y1-y2)<2:
    print("YES")
else:
    print("NO")

#task9
"""
Умова: Шаховий слон рухається по діагоналі на будь-яку кількість клітин. Дано координати двох клітин шахової дошки. Визначити, чи може слон перейти з першої клітини у другу за один хід. 
Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини. Перші два числа - для першої клітини, останні два числа – для другої. Програма має вивести "YES", якщо хід можливий, або "NO" в іншому випадку.

Вхідні дані: 4 цілих числа.  Кожне число користувач вводить в окремому рядку.

Вихідні дані: вивести текстовий рядок.
"""

#Bishop move#
x1 = int(input())#for the first square 
y1 = int(input())#for the first square 
x2 = int(input())#for the second square 
y2 = int(input())#for the second square 
if abs(x1-x2)==abs(y1-y2):
    print("YES")
else:
    print("NO")

#task10
"""
Умова: Шахова королева рухається по горизонталі, по вертикалі або по діагоналі на будь-яку кількість клітин. 
Дано координати двох клітин шахової дошки. Визначити, чи може королева перейти з першої клітини у другу за один хід. 
Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини. Перші два числа - для першої клітини, 
останні два числа – для другої. Програма має вивести "YES", якщо хід можливий, або "NO" в іншому випадку.

Вхідні дані: 4 цілих числа.  Кожне число користувач вводить в окремому рядку.

Вихідні дані: вивести текстовий рядок.
"""

#Queen move#
x1 = int(input())#for the first square 
y1 = int(input())#for the first square 
x2 = int(input())#for the second square 
y2 = int(input())#for the second square 
if (abs(x1-x2)==abs(y1-y2)) or ((x1==x2) or (y1==y2)):
    print("YES")
else:
    print("NO")

#task11
"""
Умова: Шаховий кінь рухається як літера L. Він може переміщатись на дві клітинки по горизонталі і одну клітинку по вертикалі або на дві клітинки по вертикалі і одну по горизонталі. Дано координати двох клітин шахової дошки.
Визначити, чи може кінь перейти з першої клітини у другу за один хід. Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини. Перші два числа - для першої клітини, останні два числа – для другої. 
Програма має вивести "YES", якщо хід можливий, або "NO" в іншому випадку.

Вхідні дані: 4 цілих числа.  Кожне число користувач вводить в окремому рядку.

Вихідні дані: вивести текстовий рядок.
"""

#Knight move#
x1 = int(input())#for the first square 
y1 = int(input())#for the first square 
x2 = int(input())#for the second square 
y2 = int(input())#for the second square 
if (abs(x1-x2)==2 and abs(y1-y2)==1) or (abs(x1-x2)==1 and abs(y1-y2)==2):
    print("YES")
else:
    print("NO")

#task12
"""
Умова: Шоколад має форму прямокутника, розділеного на n×m клітин. Шоколад може бути розділений на дві частини тільки по горизонталі або по вертикалі, при цьому клітини мають бути цілими. Визначити, чи можна розділити шоколад за один крок таким чином,
щоб одна з частин матиме точно k клітин. Програма має вивести "YES", якщо шоколад можна поділити, або "NO" в іншому випадку.

Вхідні дані: 3 цілих числа: n,m, k. Кожне число користувач вводить в окремому рядку.

Вихідні дані: вивести текстовий рядок.
"""

#Chocolate bar#
m = int(input())
n = int(input())
k = int(input())
if (k%n==0 or k%m==0) and (k<=m*n):
    print ("YES")
else:
    print ("NO")
