#task1------------------------------------------------------------
"""
Напишіть програму, яка отримує три числа і друкує їх суму. Кожне 
число користувач вводить у окремому рядку.
"""
print('Program that takes three numbers and prints their sum')
a = int(input())
b = int(input())
c = int(input())
print((a + b + c))
#---------------------------------------------------------------

#task2------------------------------------------------------------
"""
Напишіть програму, яка отримує довжини двох катетів прямокутного 
трикутника та виводить його площу. Користувач вводить довжини 
катетів у окремих рядках.
"""
b = int(input())
h = int(input())
print(float(0.5*b*h))
#---------------------------------------------------------------

#task3------------------------------------------------------------
"""
N студентів отримали K яблук і розподілити їх між собою порівну. 
Неподілені яблука залишились у кошику. Скільки яблук отримає кожен
студент? Скільки яблук залишиться в кошику?
"""
n = int(input()) 
k = int(input())
print(k //n)
print(k % n)
#---------------------------------------------------------------

#task4------------------------------------------------------------
"""
Нехай число N - кількість хвилин, відрахованих після півночі. 
Скільки годин і хвилин буде показувати цифровий годинник, 
якщо за відлік взяти 00:00?
"""
n = int(input())
h = n//60
m = n%60
d = h%24
print(d, m)
#---------------------------------------------------------------

#task5------------------------------------------------------------
"""
Напишіть програму, яка вітає користувача, друкуючи слово "Hello", 
ім'я користувача і знак оклику після нього. Наприклад “Hello, Mike!”
"""
name = input()
print(("Hello, " + name +"!") )
#---------------------------------------------------------------

#task6------------------------------------------------------------
"""
Напишіть програму, яка зчитує ціле число і друкує його попереднє і наступне значення за форматом:
	The next number for the number 179 is 180.
	The previous number for the number 179 is 178.
"""
x = int(input())
a = x+1
b = x-1
x = str(x)
a = str(a)
b = str(b)
print('The next number for the number ' + x + ' is '+a)
print('The previous number for the number ' +x+ ' is '+b)
#---------------------------------------------------------------

#task7------------------------------------------------------------
"""
Школа вирішила сформувати три нові групи учнів та надати їм окремі 
класи. У кожному класі необхідно встановити столи для учнів, у 
розрахунку, що за одним столом може сидіти не більше двох учнів. 
Яку мінімальну кількість столів необхідно придбати?
"""
a = int(input())
b = int(input())
c = int(input())
x = a%2+a//2
y = b%2+b//2
z = c%2+c//2
print(x+y+z)
#---------------------------------------------------------------
