#task1------------------------------------------------------------
"""
Напишіть програму, яка отримує три числа і друкує їх суму. Кожне число користувач вводить у окремому рядку. 
Вхідні дані: 3 дійсних числа. Кожне число користувач вводить у окремому рядку. 
Вихідні дані: вивести суму трьох чисел на екран. 
"""
first_number=input('vvedite pervoe chislo: ')
Second_number=input('vvedite vtoroe chislo: ')
third_number=input('vvedite trete chislo: ')
print('vash resultat: ', float(first_number)+float(second_number)+float(third_number))

#----------------------------------------------------------------


#task2------------------------------------------------------------
"""
Напишіть програму, яка отримує довжини двох катетів прямокутного трикутника та виводить його площу. Користувач вводить довжини катетів у окремих рядках. 
Вхідні дані: 2 дійсних числа. Кожне число користувач вводить у окремому рядку. 
Вихідні дані: вивести площу трикутника на екран. 
"""
first_number=input('vvedite dlinu pervogo kateta: ')
second_number=input('vvedite dlinu vtorogo kateta: ')
print('ploshad vashego treugolnika ravna: ', (float(first_number)*float(second_number))/2)

#-----------------------------------------------------------------


#task3------------------------------------------------------------
"""
N студентів отримали K яблук і розподілили їх між собою порівну. Неподілені яблука залишились у кошику. Скільки яблук отримає кожен студент?  Скільки яблук лишилось у кошику? 
Програма отримує числа N і K. Вона повинна вивести два числа: відповіді на поставлені вище питання. 
Вхідні дані: 2 цілих числа. Кожне користувач вводить в окремому рядку. 
Вихідні дані: вивести два числа. Перше – кількість яблук у студента, друге – кількість яблук, що лишилось у кошику. 
"""
N=input('vvedite kol-vo studentov: ')
K=input('vvedite kol-vo yablok: ')
print('kol-vo yablok u studenta: ', int(K)//int(N))
print('kol-vo yablok ostavshihsya v koshiku: ',int(K)%int(N))

#-----------------------------------------------------------------


#task4------------------------------------------------------------
"""
Умова: Нехай число N - кількість хвилин, відрахованих після півночі. Скільки годин і хвилин буде показувати цифровий годинник, якщо за відлік взяти 00:00?
Програма повинна виводити два числа: кількість годин (від 0 до 23) і кількість хвилин (від 0 до 59). Візьміть до уваги, що починаючи з півночі може пройти декілька днів, тому число N може бути достатньо великим.
Вхідні дані: 1 ціле число, що вводить користувач
Вихідні дані: вивести два числа. Перше - години, друге - хвилини.
"""
n=int(input( ‘vvedite kol-vo proshedshih minut’))
print(‘kol-vo chasov: ’,(n//60)%24)
print(‘kol-vo secund: ’,(n*60))


#-----------------------------------------------------------------


#task5------------------------------------------------------------
"""
Напишіть програму, яка вітає користувача, друкуючи слово "Hello", ім'я користувача і знак оклику після нього. Наприклад “Hello, Mike!”
Вхідні дані: ім'я користувача
Вихідні дані: вивести рядок привітання
"""
x=input( ‘vvedite imya:  ’)
print("Hello,"+x+"!")
#-----------------------------------------------------------------


#task6------------------------------------------------------------
"""
Напишіть програму, яка зчитує ціле число і друкує його попереднє і наступне значення за форматом:
The next number for the number 179 is 180.
The previous number for the number 179 is 178.
Вхідні дані: ціле число
Вихідні дані: два рядки за наведеним у завдання форматом.
"""
x=input("vvedite chislo ")
print("The next number for the number "+x+" is "+str(int(x)+1)+".")
print("The previous number for the number "+x+" is "+str(int(x)-1)+".")

#-----------------------------------------------------------------


#task7------------------------------------------------------------
"""
Школа вирішила сформувати три нові групи учнів та надати їм окремі класи. У кожному класі необхідно встановити столи для учнів, у розрахунку, що за одним столом може сидіти не більше двох учнів. Яку мінімальну кількість столів необхідно придбати?
Вхідні дані: 3 цілих числа - кількість учнів у кожній групі.  Кожне число користувач вводить в окремому рядку.
Вихідні дані: число - кількість столів.
"""
first_pupils_amount=int(input('vvedite kol-vo chelovek v pervoi gruppe: '))
second_pupils_amount=int(input('vvedite kol-vo chelovek vo vtoroy gruppe: '))
third_pupils_amount=int(input('vvedite kol-vo chelovek v tretey gruppe: '))
y=(first_pupils_amount+second_pupils_amount+third_pupils_amount)
z=y/2
if (y%2=1) :
            z=z+1
print('obshee kol-vo stolov: ',z)
#-----------------------------------------------------------------

