#task1------------------------------------------------------------
"""
‘акториалом числа n называетс€ произведение 1 ? 2 ? ... ? n. ќбозначение: n!.
ѕо данному натуральному n вычислите значение n!. ѕользоватьс€ математической библиотекой math в этой задаче запрещено.
"""



i=1
result=1
number=int(input())
for i in range(number):
    result=result*(i+1)
print(result)


#-----------------------------------------------------------------


#task2------------------------------------------------------------
"""
ѕо данному натуральном nn вычислите сумму 1!+2!+3!+...+n!1!+2!+3!+...+n!. ¬ решении этой задачи можно использовать только один цикл. ѕользоватьс€ математической библиотекой math в этой задаче запрещено.

"""



i = 0 
result = 0 
fact=1 
number=int(input()) 
for i in range(1, number+1): 
    fact*=i 
    result+= fact 
print(result)


#-----------------------------------------------------------------


#task3------------------------------------------------------------
"""
ƒано N чисел: сначала вводитс€ число N, затем вводитс€ ровно N целых чисел. ѕодсчитайте количество нулей среди введенных чисел и выведите это количество. ¬ам нужно подсчитать количество чисел, равных нулю, а не количество цифр.
"""



zero_counter = 0 
number_place = 1 
number_amount=int(input()) 
for i in range(number_amount):
    number_place=float(input()) 
    if number_place==0:
        zero_counter+=1 
print(zero_counter)


#-----------------------------------------------------------------


#task4------------------------------------------------------------
"""
ѕо данному натуральному n <= 9 выведите лесенку из n ступенек, i-€ ступенька состоит из чисел от 1 до i без пробелов.
"""



numbers=0 
number=0 
string="" 
numbers=int(input())
for i in range(numbers):
    number+=1
    string+=str(number) 
    print(string)


#-----------------------------------------------------------------
