#task1------------------------------------------------------------
"""
Напишіть програму, яка отримує три числа і друкує їх суму.
Кожне число користувач вводить у окремому рядку.
"""
print('Sum of three numbers')
a = int(input('Number 1:'))
b = int(input('Number 2:'))
c = int(input('Number 3:'))
print(a + b + c)
#---------------------------------------------------------------

#task2------------------------------------------------------------
"""
Напишіть програму, яка отримує довжини двох катетів прямокутного 
трикутника та виводить його площу. Користувач вводить довжини 
катетів у окремих рядках.
"""
print('Area of a right triangle')
base = int(input('Cathetus 1:'))
height = int(input('Cathetus 2:'))
print((base * height)/2)
#---------------------------------------------------------------

#task3------------------------------------------------------------
"""
N студентів отримали K яблук і розподілити їх між собою порівну. 
Неподілені яблука залишились у кошику. Скільки яблук отримає кожен
студент? Скільки яблук залишиться в кошику?
"""
print('Apple sharing')
students = int(input('Students:'))
apples = int(input('Apples:'))
print(apples // students)
print(apples % students)
#---------------------------------------------------------------

#task4------------------------------------------------------------
"""
Нехай число N - кількість хвилин, відрахованих після півночі. 
Скільки годин і хвилин буде показувати цифровий годинник, 
якщо за відлік взяти 00:00?
"""
print('Digital Clock')
minutes = int(input('Enter a number of minutes:'))
hours = minutes // 60
hours = hours % 24
minutes = minutes - hours * 60
#---------------------------------------------------------------

#task5------------------------------------------------------------
"""
Напишіть програму, яка вітає користувача, друкуючи слово "Hello", 
ім'я користувача і знак оклику після нього. Наприклад “Hello, Mike!”
"""
name = input('What is your name?')
print('Hello,', a+'!')
#---------------------------------------------------------------

#task6------------------------------------------------------------
"""
Напишіть програму, яка зчитує ціле число і друкує його попереднє і наступне значення за форматом:
	The next number for the number 179 is 180.
	The previous number for the number 179 is 178.
"""
print('Previous and next')
num = int(input('Enter a number'))
print('The next number for the number ' + str(n) + ' is ' + str(n + 1) + '.')
print('The previous number for the number ' + str(n) + ' is ' + str(n - 1) + '.')
#---------------------------------------------------------------

#task7------------------------------------------------------------
"""
Школа вирішила сформувати три нові групи учнів та надати їм окремі 
класи. У кожному класі необхідно встановити столи для учнів, у 
розрахунку, що за одним столом може сидіти не більше двох учнів. 
Яку мінімальну кількість столів необхідно придбати?
"""
print('School desks')
a = int(input('Group 1:'))   #number of students in 1 group
b = int(input('Group 2:'))   #number of students in 2 group
c = int(input('Group 3:'))   #number of students in 3 group
print((a//2+a%2)+(b//2+b%2)+(c//2+c%2))
#---------------------------------------------------------------

