#task1--------------------------------------------------------
"""
Напишіть програму, яка отримує три числа і друкує їх суму. 
Кожне число користувач вводить у окремому рядку.
"""
num_1 = int(input('Enter first number'))
num_2 = int(input('Enter second number'))
num_3 = int(input('Enter third number'))
print(num_1 + num_2 + num_3)
#-------------------------------------------------------------

#task2--------------------------------------------------------
"""
Напишіть програму, яка отримує довжини двох катетів прямокутного 
трикутника та виводить його площу. Користувач вводить довжини 
катетів у окремих рядках.
"""
cath_1 = int(input('Enter first cathetus'))
cath_2 = int(input('Enter second cathetus'))
print(0.5 * cath_1 * cath_2)
#--------------------------------------------------------------

#task3---------------------------------------------------------
"""
N студентів отримали K яблук і розподілити їх між собою порівну.
Неподілені яблука залишились у кошику.
Скільки яблук отримає кожен студент?
Скільки яблук залишиться в кошику?
"""
N = int(input("Enter count of students"))
K = int(input("Enter count of apples"))
print(K // N, K % N)
#---------------------------------------------------------------

#task4----------------------------------------------------------
"""
Програма повинна виводити два числа: кількість годин (від 0 до 23) і кількість хвилин (від 0 до 59).
Візьміть до уваги, що починаючи з півночі може пройти декілька днів,
тому число N може бути достатньо великим.
"""
n = int(input("Enter count of hours"))
hours = n % (60 * 24) // 60
minutes = n % 60
print(hours, minutes)
#--------------------------------------------------------------------

#task5---------------------------------------------------------------
"""
Напишіть програму, яка вітає користувача, друкуючи слово "Hello", 
ім'я користувача і знак оклику після нього.
Наприклад “Hello, Mike!”
"""
name = input("Enter name")
print(("Hello, " + name +"!") )
#---------------------------------------------------------------------

#task6----------------------------------------------------------------
"""
Напишіть програму, яка зчитує ціле число
і друкує його попереднє і наступне значення за форматом:
	The next number for the number 179 is 180.
	The previous number for the number 179 is 178.
"""
number = int(input())
print("The next number for the number " + str(number) + " is " + str(number+1))
print("The previous number for the number " + str(number) + " is "+ str(number-1))
#------------------------------------------------------------------------

#task7--------------------------------------------------------------------
"""
Школа вирішила сформувати три нові групи учнів та надати їм окремі 
класи. У кожному класі необхідно встановити столи для учнів, у 
розрахунку, що за одним столом може сидіти не більше двох учнів. 
Яку мінімальну кількість столів необхідно придбати?
"""
tables = 0
students = int(input("First class"))
tables += students // 2 + students % 2
students = int(input("Second class"))
tables += students // 2 + students % 2
students = int(input("Third class"))
tables += students // 2 + students % 2
print(tables)
#----------------------------------------------------------------------------
