#task1------------------------------------------------------
"""
По данному натуральному n вычислите значение n!. 
"""
n = int(input())
fact = 1
for i in range(1, n + 1):
	fact= fact * i
print (fact)
#-----------------------------------------------------------

#task2------------------------------------------------------
"""
По данному натуральном nn вычислите сумму 1!+2!+3!+...+n!.
"""
n = int(input())
res = 1
sum = 0
for i in range(1,n+1):
    res *= i
    sum += res
print(sum)

#-----------------------------------------------------------

#task3------------------------------------------------------
"""
Дано N чисел: сначала вводится число N, затем вводится ровно N целых чисел.
Подсчитайте количество нулей среди введенных чисел и выведите это количество.
Вам нужно подсчитать количество чисел, равных нулю, а не количество цифр.
"""
n = int(input())
count = 0
for i in range(n):
	num = int(input())
if num == 0:
	count += 1
print (count)
#-----------------------------------------------------------

#task4------------------------------------------------------
"""
По данному натуральному n ≤ 9 выведите лесенку из n ступенек,
i-я ступенька состоит из чисел от 1 до i без пробелов.
"""
n = int(input()) 
for i in range(n): 
    for j in range(1, i+2): 
        print(j, end='') 
    print()
#-----------------------------------------------------------

