#task1------------------------------------------------------------
"""
Дано два цілих числа. Вивести найменше з них.
"""
a=int(input())             #Введення числа a                                                                                         
b=int(input())             #Введення числа b
if a>b:                    #Умова при якій a більша за b
    print(b)               #Виведення числа b, при виконанні попередньої  умови
else:                      #Умова при якій не виконується попередня
    print(a)               #Виведення числа a, при виконанні попередньої  умови
#-----------------------------------------------------------------
#task2------------------------------------------------------------
"""
Вивести результат функції sign(x), що визначається наступним чином: 
sign(x) = 1, if x > 0, 
sign(x) = -1, if x < 0, 
sign(x) = 0, if x = 0..
"""
x=int(input())             #Введення числа x
if x>0:                    #Умова при якій x більший за 0
    print(1)               #Виведення  1, при виконанні попередньої умови
if x==0:                   #Умова, при якій x дорівнює нулю
    print(0)               #Виведення 0, при виконанні попередньої умови
if x<0:                    #Умова при якій виконується  x менший за 0
    print(-1)              #Виведення  -1, при виконанні попередньої умови
#-----------------------------------------------------------------
#task3------------------------------------------------------------
"""
Дано три цілих числа. Вивести найменше з них.
"""
a=int(input())             #Введення числа а                                                                                         
b=int(input())             #Введення числа b                                                                                        
c=int(input())             #Введення числа c                                                                                         
ab=bool(a>b)               #Присвоєння змінній ab значення типу Boolean: True, якщо а більша за b, False, якщо ні
ac=bool(a>c)               #Присвоєння змінній ac значення типу Boolean: True, якщо a більша за c, False,  якщо ні
bc=bool(b>c)               #Присвоєння змінній bc значення типу Boolean: True, якщо b більша за c, False, якщо ні
if (ab):                   #Умова при якій змінна ab має значення True
    if bc:                 #Умова яка виконується при виконанні попередньої, при якій змінна bc має значення True
        print(c)           #Виведення числа c, при виконанні попередньої умови
    else:                  #Умова, при якій не виконується попередня
        print(b)           #Виведення числа b, при невиконанні попередньої умови
elif ac:                   #Умова, при якій не виконується попередня, але при якій змінна ac має значення True
    print(c)               #Виведення числа c, при виконанні попередньої  умови
else:                      #Умова при якій не виконується попередня умова
    print(a)               #Виведення числа а, при виконанні попередньої умови
#-----------------------------------------------------------------
#task4------------------------------------------------------------
"""
Дано ціле число, що визначає рік. Визначити, чи є вказаний рік високосним. Якщо так, то вивести користувачу "LEAP", в іншому випадку – "СOMMON".

Рік високосний, якщо виконується хоча б одна з умов:

рік завжди високосним, якщо його номер ділиться на 4 без остачі і не ділиться без остачі на 100
рік завжди високосним, якщо його номер ділиться на 400 без остачі
"""
y=int(input())             #Введення року
if (y%4==0):               #Умова , що виконується, якшо y ділиться націло на 4
    if y%100==0:           #Умова що передбачає виконання попередньої умови  та ділення y націло на 100
        if y%400==0:       #Умова, що передбачає виконання попередньої та ділення націло на 400
            print('LEAP')  #Виведення 'LEAP', при виконанні попередньої умови
        else:              #Умова, що передбачає невиконання попередньої
            print('COMMON')#Виведення 'COMMON', при виконанні попередньої умови
    else:                  #Умова, що передбачає невиконання попередньої
        print('LEAP')      #Виведення 'LEAP', при виконанні попередньої умови
else:                      #Умова, що передбачає невиконання попередньої
    print('COMMON')        #Виведення 'COMMON', при виконанні попередньої умови
#-----------------------------------------------------------------
#task5------------------------------------------------------------
"""
Дано три цілих числа. Визначте, скільки з них дорівнюють один одному. Програма повинна виводити одне з чисел: 3 (якщо всі числа однакові), 2 (якщо два з них дорівнюють один одному, а третє відрізняється) або 0 (якщо всі числа різні).
"""
a=int(input())             #Введення числа а
b=int(input())             #Введення числа в
c=int(input())             #Введення числа с
ab=bool(a==b)              #Присвоєння змінній ав значення  True, якшо а=b
ac=bool(a==c )             #Присвоєння змінній ас значення  True, якшо а=с
bc=bool(b==c)              #Присвоєння змінній ас значення  True, якшо b=с
if (ab) and (bc):          #Умова що передбачає значення True змінних аb та bc
    print(3)               #Виведення числа 3, якщо виконується попередня умова
elif (ab) or (ac) or (bc): #Умова що передбачає False попередньої, та значення True однієї з змінних
    print(2)               #Виведення числа 2, якщо виконується попередня умова
else:                      #Умова, що передбачає невиконання попередньої
    print(0)               #Виведення числа 0, якщо виконується попередня умова
#-----------------------------------------------------------------
#task6------------------------------------------------------------
"""
Шахова тура переміщається по горизонталі або по вертикалі. Дано координати двох клітин шахової дошки.
Визначити, чи може тура перейти з першої клітини у другу за один хід.
Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини.
Перші два числа - для першої клітини, останні два числа – для другої.
Програма має вивести "YES", якщо тура може виконати переміщення, або "NO" в іншому випадку.
"""
x=int(input())             #Введення координати х
y=int(input())             #Введення координати у
x1=int(input())            #Введення координати х1
y1=int(input())            #Введення координати у1
if (x==x1) or (y==y1):     #Умова, що передбачає рівність координат бодай в одному напрямку
    print('YES')           #Виведення 'YES', при виконанні попередньої умови
else:                      #Умова, що передбачає невиконання попередньої умови
    print('NO')            #Виведення 'NO', при виконанні попередньої умови
#-----------------------------------------------------------------
#task7------------------------------------------------------------
"""
Дано координати двох клітин шахової дошки. Визначити, чи однакового вони кольору.
Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини.
Перші два числа - для першої клітини, останні два числа – для другої.
Програма має вивести "YES", якщо колір однаковий, або "NO" в іншому випадку.
"""
x=int(input())             #Введення координати х 
y=int(input())             #Введення координати у
x1=int(input())            #Введення координати х1
y1=int(input())            #Введення координати у1
c=bool((x+y)%2)            #Присвоєння змінній с – остачі від ділення суми координат х та у на 2.
c1=bool((x1+y1)%2)         #Присвоєння змінній с – остачі від ділення суми координат х1 та у1 на 2.
if c==c1:                  #Умова при якій с та с1 одночасно %2==0, або навпаки. Що свідчить про їх однакові кольори.
    print('YES')           #Виведення 'YES', при виконанні попередньої умови
else:                      #Умова при якій не виконується попередня
    print('NO')            #Виведення ''NO', при виконанні попередньої умови
'''Після дослідження шахової дошки я встановив що якщо (x+y)%2==0, то це завжди чорна клітинка. Якщо ж навпаки, то це біла. Саме цю властивість дошки я використав для розв’язання цієї задачі'''
#-----------------------------------------------------------------
#task8------------------------------------------------------------
"""
Шаховий король переміщується по горизонталі, по вертикалі або по діагоналі на будь-яку сусідню клітинку.
Дано координати двох клітин шахової дошки. Визначити, чи може король перейти з першої клітини у другу за один хід.
Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини.
Перші два числа - для першої клітини, останні два числа – для другої.
Програма має вивести "YES", якщо хід можливий, або "NO" в іншому випадку.
"""
x=int(input())             #Введення координати х
y=int(input())             #Введення координати у
x1=int(input())            #Введення координати х1
y1=int(input())            #Введення координати у1
absx=abs(x1-x)             #Присвоєння змінній absx значення переміщення фігури по осі х
absy=abs(y1-y)             #Присвоєння змінній absу значення переміщення фігури по осі у
if (absx<=1) and (absy<=1):#Умова при якій переміщення фігури по дошці менше 1 по обох з осей.
    print('YES')           #Виведення 'YES', при виконанні попередньої умови
else:                      #Умова при якій не виконується попередня
    print('NO')            #Виведення 'NO', при виконанні попередньої умови
#-----------------------------------------------------------------
#task9------------------------------------------------------------
"""
Шаховий слон рухається по діагоналі на будь-яку кількість клітин. Дано координати двох клітин шахової дошки.
Визначити, чи може слон перейти з першої клітини у другу за один хід.
Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини.
Перші два числа - для першої клітини, останні два числа – для другої.
Програма має вивести "YES", якщо хід можливий, або "NO" в іншому випадку.
"""
x=int(input())             #Введення координати х
y=int(input())             #Введення коорднати у
x1=int(input())            #Введення координати х1
y1=int(input())            #Введення координати у1
if abs(x1-x)==abs(y1-y):   #Умова, яка свідчить що клітинка (х1,у1) - знаходиться на одній діагоналі з (х,у) 
    print('YES')           #Виведення 'YES', при виконанні попердньої умови
else:                      #Умова що свідчить невиконання попередньої умови
    print('NO')            #Виведення 'NO', при виконанні попередньої умови
#-----------------------------------------------------------------
#task10------------------------------------------------------------
"""
Шахова королева рухається по горизонталі, по вертикалі або по діагоналі на будь-яку кількість клітин.
Дано координати двох клітин шахової дошки. Визначити, чи може королева перейти з першої клітини у другу за один хід.
Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини.
Перші два числа - для першої клітини, останні два числа – для другої.
Програма має вивести "YES", якщо хід можливий, або "NO" в іншому випадку.
"""
#without any words, because i'm tired 
x=int(input())
y=int(input())
x1=int(input())
y1=int(input())
if ((x==x1) or  (y==y1)) or ( abs(x1-x)==abs(y1-y)):
    print('YES')
else:
    print('NO')
#-----------------------------------------------------------------
#task11------------------------------------------------------------
"""
Шаховий кінь рухається як літера L.
Він може переміщатись на дві клітинки по горизонталі і одну клітинку по вертикалі або на дві клітинки по вертикалі і одну по горизонталі.
Дано координати двох клітин шахової дошки. Визначити, чи може кінь перейти з першої клітини у другу за один хід.
Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини.
Перші два числа - для першої клітини, останні два числа – для другої. Програма має вивести "YES", якщо хід можливий, або "NO" в іншому випадку.
"""
x=int(input())
y=int(input())
x1=int(input())
y1=int(input())
if (x+1==x1) and (y+2==y1):
    print('YES')
elif (x+2==x1) and (y+1==y1):
    print('YES')
elif (x+2==x1) and (y-1==y1):
    print('YES')
elif (x+1==x1) and (y-2==y1):
    print('YES')
elif (x-1==x1) and (y-2==y1):
    print('YES')
elif (x-2==x1) and (y-1==y1):
    print('YES')
elif (x-2==x1) and (y+1==y1):
    print('YES')
elif (x-1==x1) and (y+2==y1):
    print('YES')
else:
    print('NO')
#-----------------------------------------------------------------
#task12------------------------------------------------------------
"""
Шоколад має форму прямокутника, розділеного на n×m клітин.
Шоколад може бути розділений на дві частини тільки по горизонталі або по вертикалі, при цьому клітини мають бути цілими.
Визначити, чи можна розділити шоколад за один крок таким чином, щоб одна з частин матиме точно k клітин.
Програма має вивести "YES", якщо шоколад можна поділити, або "NO" в іншому випадку.
"""
n=int(input())
m=int(input())
k=int(input())
y=0
if (k%n==0) and ((k//n)<m):
    y=1
if (k%m==0) and ((k//m)<n):
    y=1
if y==1:
    print('YES')
else:
    print('NO')
#-----------------------------------------------------------------



