#task1-----------------------------------------------------------------------------------
"""
Выведите все элементы списка с четными индексами (то есть A[0], A[2], A[4], ...). 
"""
s=input()

elements=s.split()

for i in range(len(elements)):
    
	if i%2==0:
       
		print(elements[i])

#-----------------------------------------------------------------------------------------

#task2------------------------------------------------------------------------------------
"""
Выведите все четные элементы списка. При этом используйте цикл for, перебирающий элементы списка, а не их индексы! 
"""
s=input()

elements=s.split()

for i in range(0,len(elements)):
   
	elements[i] = int(a[i])
    
	if elements[i]%2==0:
        
		print(elements[i])

#-----------------------------------------------------------------------------------------

#task3------------------------------------------------------------------------------------
"""
Дан список чисел. Выведите все элементы списка, которые больше предыдущего элемента. 
"""
s=input()

elements=s.split()

for i in range(len(elements)):
   
	elements[i]=int(elements[i])
    
	if elements[i]>int(elements[i-1]) and i!=0:
        
		print(elements[i])
#-----------------------------------------------------------------------------------------

#task4------------------------------------------------------------------------------------
"""
Дан список чисел. Если в нем есть два соседних элемента одного знака, выведите эти числа. 
Если соседних элементов одного знака нет — не выводите ничего. Если таких пар соседей несколько — выведите первую пару. 
"""
s=input()

neighbours=s.split()

for i in range(1,len(neighbours)):
    
	neighbours[i]=int(neighbours[i])
    
	if int(neighbours[i - 1]) * neighbours[i] > 0:
        
			print(neighbours[i - 1],neighbours[i])
        
			break
#-----------------------------------------------------------------------------------------

#task5------------------------------------------------------------------------------------
"""
Дан список чисел. Определите, сколько в этом списке элементов, которые больше двух своих соседей,
и выведите количество таких элементов. Крайние элементы списка никогда не учитываются, поскольку у них недостаточно соседей.
"""
s=input()

list=s.split()

b=0

for i in range(1,len(list)-1):
    
	list[i]=int(list[i])
    
	if list[i]>int(list[i-1]) and list[i]>int(list[i+1]):
        
			b=b+1

print(b)
#-----------------------------------------------------------------------------------------
#task6------------------------------------------------------------------------------------
"""
Дан список чисел. Выведите значение наибольшего элемента в списке, а затем индекс этого элемента в списке.
Если наибольших элементов несколько, выведите индекс первого из них. 
"""
biggest = [int(i) for i in input().split()]

index=0

for i in range(1, biggest(index)):
    
	if biggest[i] > biggest[index]:
        
		index = i

print(biggest[index], index)

#-----------------------------------------------------------------------------------------
#task7------------------------------------------------------------------------------------
"""
Петя перешёл в другую школу. На уроке физкультуры ему понадобилось определить своё место в строю. Помогите ему это сделать.

Программа получает на вход невозрастающую последовательность натуральных чисел, означающих рост каждого человека в строю. 
После этого вводится число X – рост Пети. Все числа во входных данных натуральные и не превышают 200.

Выведите номер, под которым Петя должен встать в строй.
Если в строю есть люди с одинаковым ростом, таким же, как у Пети, то он должен встать после них. 
"""
place=[int(i) for i in input().split()]

height,n=int(input()),1

for i in place:
    
	if i>=height:
        
		n+=1

print(n)
#-----------------------------------------------------------------------------------------


#-----------------------------------------------------------------------------------------

#task8------------------------------------------------------------------------------------
"""
Дан список, упорядоченный по неубыванию элементов в нем. Определите, сколько в нем различных элементов. 
"""
s=input()

differents=s.split()

n=0

elem = differents[0]

for i in range(len(differents)):
    
	differents[i]=int(differents[i])
    
	if differents[i] != elem:
        
		n+=1
        
		elem = differents[i]

print(n)

#-----------------------------------------------------------------------------------------

#task9------------------------------------------------------------------------------------
"""
Переставьте соседние элементы списка (A[0] c A[1], A[2] c A[3] и т. д.). 
Если элементов нечетное число, то последний элемент остается на своем месте. 
"""
exchg = input().split()

for i in range(1, len(exchg), 2):
    
	exchg[i-1], exchg[i] = exchg[i], exchg[i-1]

for i in exchg:
    
	print(i, end = " ")
	
#-----------------------------------------------------------------------------------------

#task10------------------------------------------------------------------------------------
"""
В списке все элементы различны. Поменяйте местами минимальный и максимальный элемент этого списка. 
"""
mix=input().split()

for i in range (len(mix)):
    
	mix[i]=int(mix[i])

	max=mix[0]

	min=mix[0]

	mi=0

	ma=0

	for i in range (1,len(mix)):
    
		if mix[i]>max:
        
			ma=i
        
			max=mix[i]
    
		elif mix[i]<min:
        
			mi=i
        
			min=mix[i]

mix[mi],mix[ma]=mix[ma],mix[mi]

for i in range (len(mix)):
    
	print(mix[i],end=' ')

#-----------------------------------------------------------------------------------------

#task11------------------------------------------------------------------------------------
"""
Дан список из чисел и индекс элемента в списке k. Удалите из списка элемент с индексом k, 
сдвинув влево все элементы, стоящие правее элемента с индексом k.

Программа получает на вход список, затем число k. Программа сдвигает все элементы, 
а после этого удаляет последний элемент списка при помощи метода pop() без параметров.

Программа должна осуществлять сдвиг непосредственно в списке, а не делать это при выводе элементов. 
Также нельзя использовать дополнительный список. Также не следует использовать метод pop(k) с параметром. 
"""
a = [int(i) for i in input().split()]

dlt = int(input())

for i in range(0,dlt):
    
	print(a[i], end=' ')

for i in range(dlt+1,len(a)):
    
	print(a[i], end=' ')

#-----------------------------------------------------------------------------------------

#task12------------------------------------------------------------------------------------
"""
Дан список целых чисел, число k и значение C. Необходимо вставить в список на позицию с индексом k элемент,
 равный C, сдвинув все элементы, имевшие индекс не менее k, вправо.

Посколько при этом количество элементов в списке увеличивается, 
после считывания списка в его конец нужно будет добавить новый элемент, используя метод append.

Вставку необходимо осуществлять уже в считанном списке, не делая этого при выводе и не создавая дополнительного списка. 
"""
sp = input().split()

inpt = input().split()

sp.insert(int(inpt[0]),int(inpt[1]))

for i in range(len(sp)):
    
	sp[i]=int(sp[i])
    
	print (sp[i],end=' ')


#-----------------------------------------------------------------------------------------
#task12------------------------------------------------------------------------------------
"""
Дан список чисел. Посчитайте, сколько в нем пар элементов, равных друг другу. 
Считается, что любые два элемента, равные друг другу образуют одну пару, которую необходимо посчитать.
"""
cpl = [int(i) for i in input().split()]

n = 0

for i in range(len(cpl)-1):
    
	for j in range(i+1,len(cpl)):
        
		if cpl[i]==cpl[j]:
            
			n += 1

print (n)

#-----------------------------------------------------------------------------------------
#task13------------------------------------------------------------------------------------
"""
Дан список. Выведите те его элементы, которые встречаются в списке только один раз. 
Элементы нужно выводить в том порядке, в котором они встречаются в списке. 
"""
unq=input().split()

for elements in unq:
    
	count=0
    
	for i in unq:
        
		if elements==i:
            
			count=count+1
    
	if count==1:
        
		print(elements)


#-----------------------------------------------------------------------------------------

#task14------------------------------------------------------------------------------------
"""
N кеглей выставили в один ряд, занумеровав их слева направо числами от 1 до N. 
Затем по этому ряду бросили K шаров, при этом i-й шар сбил все кегли с номерами от li до ri включительно. 
Определите, какие кегли остались стоять на месте.

Программа получает на вход количество кеглей N и количество бросков K. 
Далее идет K пар чисел li, ri, при этом 1? li? ri? N.

Программа должна вывести последовательность из N символов, где j-й символ есть “I”,
если j-я кегля осталась стоять, или “.”, если j-я кегля была сбита. 
"""
a, q = [int(i) for i in input().split()]

keg=[]

for i in range(a):
    
	keg.append('I')

for i in range(q):
    
	x, y = [int(q) for q in input().split()]
    
	for j in range(x-1,y):
        
	keg[j]='.'

for i in keg:
    
	print(i,end='')

#-----------------------------------------------------------------------------------------

















































































































































































