#task1------------------------------------------------------------
"""
Факториалом числа n называется произведение 1 × 2 × ... × n. Обозначение: n!.
По данному натуральному n вычислите значение n!.
Пользоваться математической библиотекой math в этой задаче запрещено. 
"""
#Програма вираховує факторіал введеного числа 
number_n = int(input('Enter number of factorial'))
factorial = 1
for i in range(1,number_n+1):
    factorial = factorial * i
print('Factorial = ',factorial)



#-----------------------------------------------------------------


#task2------------------------------------------------------------
"""
По данному натуральном n вычислите сумму 1!+2!+3!+...+n!.
В решении этой задачи можно использовать только один цикл.
Пользоваться математической библиотекой math в этой задаче запрещено.
"""
#Програма вираховує суму факторіалів
number_n = int(input('Enter number of factorial'))
sum_factorial = 0
for i in range(number_n):
    factorial = 1
    for j in range(i+1):
        factorial *= j+1
    sum_factorial += factorial
print('Suma factorials = ',sum_factorial)



#-----------------------------------------------------------------


#task3------------------------------------------------------------
"""
Дано N чисел: сначала вводится число N, затем вводится ровно N целых чисел.
Подсчитайте количество нулей среди введенных чисел и выведите это количество.
Вам нужно подсчитать количество чисел, равных нулю, а не количество цифр. 
"""
#Програма вираховує кількість введених числ, які рівні нулю
n_numbers = int(input('Enter numbers: '))
sum_null_number = 0
for i in range(n_numbers):
    n_numbers  = int(input())
    if n_numbers == 0:
        sum_null_number += 1
print('Sum number 0 is ',sum_null_number)



#-----------------------------------------------------------------


#task4------------------------------------------------------------
"""
По данному натуральному n ≤ 9 выведите лесенку із n ступенек, i-я ступенька состоит із чисел от 1 до i без пробелов.
"""
#Програма будує лесенку із натуральних числ 
n = int(input('Enter number integer n ≤ 9 '))
i = 1
for i in range(1,n+1):
    for j in range(1,i+1):
        print(j,end='')
        if n > 9:
            break
    print()



#-----------------------------------------------------------------


