#Задача №1 —----------------------------------------------------------------------
"""

Умова: Напишіть програму, яка отримує три числа і друкує їх суму. Кожне число користувач вводить у окремому рядку.

Вхідні дані: 3 дійсних числа. Кожне число користувач вводить в окремому рядку.

Вихідні дані: вивести суму трьох чисел на екран.
"""

#input------------------------------------------------------------------
a = int(input("Пожалуйста, введите первое число: "))
b = int(input("Пожалуйста, введите второе число: "))
c = int(input("Пожалуйста, введите третье число: "))
#output-----------------------------------------------------------------
print("Сумма Ваших чисел: ",a + b + c)

#-----------------------------------------------------------------------------------

#Задача №2--------------------------------------------------------------------------
"""
Умова: Напишіть програму, яка отримує довжини двох катетів прямокутного трикутника та виводить його площу. Користувач вводить довжини катетів у окремих рядках.

Вхідні дані: 2 дійсних числа. Кожне число користувач вводить в окремому рядку.

Вихідні дані: вивести площу трикутника на екран.
"""

#input------------------------------------------------------------------
b = int(input("Введите сторону: "))
h = int(input("Введите высоту: "))
#output-----------------------------------------------------------------
print(b*h/2)

#----------------------------------------------------------------------------------

#Задача №3-------------------------------------------------------------------------
"""
Умова: N студентів отримали K яблук і розподілити їх між собою порівну. Неподілені яблука залишились у кошику. Скільки яблук отримає кожен студент? Скільки яблук залишиться в кошику?

Програма отримує числа N і K. Вона повинна вивести два числа: відповіді на поставлені вище питання.

Вхідні дані: 2 цілих числа. Кожне число користувач вводить в окремому рядку.

Вихідні дані: вивести два числа. Перше - кількість яблук у студента, друге - кількість яблук, що лишилось у кошику.
"""

#input------------------------------------------------------------------
students = int(input("Введите количество студентов"))
apples = int(input("Введите количество яблок"))
#main-------------------------------------------------------------------
every = apples // students
rem = apples % students
#output-----------------------------------------------------------------
print(every)
print(rem)

#-----------------------------------------------------------------------

#Задача №4--------------------------------------------------------------
"""
Умова: Нехай число N - кількість хвилин, відрахованих після півночі. Скільки годин і хвилин буде показувати цифровий годинник, якщо за відлік взяти 00:00?

Програма повинна виводити два числа: кількість годин (від 0 до 23) і кількість хвилин (від 0 до 59). Візьміть до уваги, що починаючи з півночі може пройти декілька днів, тому число N може бути достатньо великим.

Вхідні дані: 1 ціле число, що вводить користувач

Вихідні дані: вивести два числа. Перше - години, друге - хвилини.
"""

#input------------------------------------------------------------------
minutes = int(input("Введите минуты: "))
#main-------------------------------------------------------------------
period = minutes//1440
minutes = minutes - period*1440
hours = minutes//60
newMinutes = minutes - hours*60
#output-----------------------------------------------------------------
print(hours)
print(newMinutes)

#-----------------------------------------------------------------------------------

#Задача №5--------------------------------------------------------------------------
"""
Умова: Напишіть програму, яка вітає користувача, друкуючи слово "Hello", ім'я користувача і знак оклику після нього. Наприклад “Hello, Mike!”

Вхідні дані: ім'я користувача

Вихідні дані: вивести рядок привітання
"""

#input------------------------------------------------------------------
name = input()
#output-----------------------------------------------------------------
print("Hello, "+name+"!")

#--------------------------
