# -*- coding: utf-8 -*- 

"""
	Домашня робота №2
	Тема: "Умовні конструкції"
	Студент: Кондратюк Андрій Ігорович
	Група: КМ - 62
"""
#task1------------------------------------------------------------
"""
	Умова: Дано два цілих числа. Вивести найменше з них.
"""
a = int(input())
b = int(input())
if a < b:
    print(a)
else:
    print(b)


#-----------------------------------------------------------------


#task2------------------------------------------------------------
"""
	Умова: Вивести результат функції sign(x), що визначається наступним чином: 
sign(x) = 1, if x > 0, 
sign(x) = -1, if x < 0, 
sign(x) = 0, if x = 0..
"""
x = float(input())
if x > 0:
    print("1")
elif x < 0:
    print("-1")
else:
    print("0")


#-----------------------------------------------------------------


#task3------------------------------------------------------------
"""
	Умова: Дано три цілих числа. Вивести найменше з них.
"""
x = int(input())
y = int(input())
z = int(input())
if x <= y and x <= z:
    print(x)
elif y <= x and y <= z:
    print(y)
else:
    print(z)



#-----------------------------------------------------------------


#task4------------------------------------------------------------
"""
	Умова: Дано ціле число, що визначає рік. Визначити, чи є вказаний рік високосним. Якщо так, то вивести користувачу "LEAP", в іншому випадку – "СOMMON".
Рік високосний, якщо виконується хоча б одна з умов:
рік завжди високосним, якщо його номер ділиться на 4 без остачі і не ділиться без остачі на 100
рік завжди високосним, якщо його номер ділиться на 400 без остачі
"""
year = int(input())
if (year % 4 == 0) and (year % 100 != 0) or (year % 400 == 0):
    print("LEAP")
else:
    print("COMMON")


#-----------------------------------------------------------------


#task5------------------------------------------------------------
"""
	Умова: Дано три цілих числа. Визначте, скільки з них дорівнюють один одному. 
Програма повинна виводити одне з чисел: 3 (якщо всі числа однакові), 2 (якщо два з них дорівнюють один одному, а третє відрізняється) або 0 (якщо всі числа різні).
"""
a = int(input())
b = int(input())
c = int(input())
if a == b and b == c:
    print("3")
elif (a == b) or (a == c) or (b == c):
    print("2")
else:
    print("0")


#-----------------------------------------------------------------


#task6------------------------------------------------------------
"""
	Умова:  Шахова тура переміщається по горизонталі або по вертикалі. Дано координати двох клітин шахової дошки. 
Визначити, чи може тура перейти з першої клітини у другу за один хід. 
Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини. 
Перші два числа - для першої клітини, останні два числа – для другої. 
Програма має вивести "YES", якщо тура може виконати переміщення, або "NO" в іншому випадку.
"""
x1 = int(input())
y1 = int(input())
x2 = int(input())
y2 = int(input())
if x1 == x2 or y1 == y2:
    print("YES")
else:
    print("NO")



#-----------------------------------------------------------------


#task7------------------------------------------------------------
"""
	Умова: Дано координати двох клітин шахової дошки. Визначити, чи однакового вони кольору. Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини. 
Перші два числа - для першої клітини, останні два числа – для другої. Програма має вивести "YES", якщо колір однаковий, або "NO" в іншому випадку.
"""
x1 = int(input())
y1 = int(input())
x2 = int(input())
y2 = int(input())
if x1 % 2 != 0 and x2 % 2 != 0:
    if (y1 % 2 != 0 and y2 % 2 != 0) or (y1 % 2 == 0 and y2 % 2 == 0):
        print("YES")
    else:
        print("NO")
if x1 % 2 == 0 and x2 % 2 == 0:
    if (y1 % 2 == 0 and y2 % 2 == 0) or (y1 % 2 != 0 and y2 % 2 != 0):
        print("YES")
    else:
        print("NO")
if x1 % 2 != 0 and x2 % 2 == 0:
    if (y1 % 2 != 0 and y2 % 2 == 0) or (y1 % 2 == 0 and y2 % 2 != 0):
        print("YES")
    else:
        print("NO")
if x1 % 2 == 0 and x2 % 2 != 0:
    if (y1 % 2 == 0 and y2 % 2 != 0) or (y1 % 2 != 0 and y2 % 2 == 0):
        print("YES")
    else:
        print("NO")




#-----------------------------------------------------------------



#task8------------------------------------------------------------
"""
	Умова: Шаховий король переміщується по горизонталі, по вертикалі або по діагоналі на будь-яку сусідню клітинку. Дано координати двох клітин шахової дошки. Визначити, чи може король перейти з першої клітини у другу за один хід. Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини. 
Перші два числа - для першої клітини, останні два числа – для другої. 
Програма має вивести "YES", якщо хід можливий, або "NO" в іншому випадку.
"""
import math
x1 = int(input())
y1 = int(input())
x2 = int(input())
y2 = int(input())
a = math.sqrt((x2 - x1)**2 + (y2 - y1)**2)
if ((a == math.sqrt(2)) or (a == 1)) :
    print("YES")
else:
    print("NO")



#-----------------------------------------------------------------


#task9------------------------------------------------------------
"""
	Умова: Шаховий слон рухається по діагоналі на будь-яку кількість клітин. Дано координати двох клітин шахової дошки. Визначити, чи може слон перейти з першої клітини у другу за один хід. Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини. Перші два числа - для першої клітини, останні два числа – для другої. Програма має вивести "YES", якщо хід можливий, або "NO" в іншому випадку.Шаховий слон рухається по діагоналі на будь-яку кількість клітин. Дано координати двох клітин шахової дошки. Визначити, чи може слон перейти з першої клітини у другу за один хід. Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини. 
Перші два числа - для першої клітини, останні два числа – для другої. 
Програма має вивести "YES", якщо хід можливий, або "NO" в іншому випадку.
"""
x1 = int(input())
y1 = int(input())
x2 = int(input())
y2 = int(input())
if (x2 - x1 == 0) or (y2 - y1 == 0):
    print("NO")
elif x1 / y1 == abs((x2 - x1)/(y2 - y1)):
    print("YES")
elif (x1 == y2) and (x2 == y1):
    print("YES")
else:
    print("NO") 



#-----------------------------------------------------------------


#task10------------------------------------------------------------
"""
	Умова:  Шахова королева рухається по горизонталі, по вертикалі або по діагоналі на будь-яку кількість клітин. 
Дано координати двох клітин шахової дошки. Визначити, чи може королева перейти з першої клітини у другу за один хід. 
Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини. 
Перші два числа - для першої клітини, останні два числа – для другої. 
Програма має вивести "YES", якщо хід можливий, або "NO" в іншому випадку.
"""
x1 = int(input())
y1 = int(input())
x2 = int(input())
y2 = int(input())
if abs(x2 - x1) == abs(y2 - y1):
    print("YES")
elif x1 == x2 or y1 == y2:
    print("YES")
else:
    print("NO")




#-----------------------------------------------------------------


#task11------------------------------------------------------------
"""
	Умова: Шаховий кінь рухається як літера L. Він може переміщатись на дві клітинки по горизонталі і одну клітинку по вертикалі або на дві клітинки по вертикалі і одну по горизонталі. 
Дано координати двох клітин шахової дошки. Визначити, чи може кінь перейти з першої клітини у другу за один хід. 
Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини. 
Перші два числа - для першої клітини, останні два числа – для другої. 
Програма має вивести "YES", якщо хід можливий, або "NO" в іншому випадку.
"""
import math
x1 = int(input())
y1 = int(input())
x2 = int(input())
y2 = int(input())
if (((x2 - x1)**2 + (y2 - y1)**2)**0.5) == math.sqrt(5):
    print("YES")
else:
    print("NO")



#-----------------------------------------------------------------


#task12------------------------------------------------------------
"""
	Умова: Шоколад має форму прямокутника, розділеного на n×m клітин. Шоколад може бути розділений на дві частини тільки по горизонталі або по вертикалі, при цьому клітини мають бути цілими. 
Визначити, чи можна розділити шоколад за один крок таким чином, щоб одна з частин матиме точно k клітин. 
Програма має вивести "YES", якщо шоколад можна поділити, або "NO" в іншому випадку.
"""
n = int(input())
m = int(input())
k = int(input())
a = n * m
if ((k % n == 0 or k % m == 0) and a > k):
    print("YES")
else:
    print("NO")



#-----------------------------------------------------------------