# -*- coding: utf-8 -*- 

"""
	Домашня робота №1
	Тема: "Введення та вивід інформації. Прості операції"
	Студент: Кондратюк Андрій Ігорович
	Група: КМ - 62
"""
#task1------------------------------------------------------------
"""
	Умова: Напишіть програму, яка отримує три числа і друкує їх суму. Кожне число користувач вводить в окремому рядку.
"""
a = float(input('Enter a number for a: '))
b = float(input('Enter a number for b: '))
c = float(input('Enter a number for c: '))
print('The sum of a + b + c = ',a + b + c)

#-----------------------------------------------------------------


#task2------------------------------------------------------------
"""
	Умова: Напишіть програму, яка отримує довжини двох катетів прямокутного трикутника та виводить його площу. Користувач вводить довжини катетів у окремих рядках.
"""
print('The formula for calculating the area of a right triangle: a*b*0.5')
print('a and b is cathetus')
a = float(input('Enter a positive number for a: '))
b = float(input('Enter a positive number for b: '))
print('The area of a right triangle: S = ', a * b * 0.5)

#-----------------------------------------------------------------


#task3------------------------------------------------------------
"""
	Умова: N студентів отримали K яблук і розподілити їх між собою порівну. Неподілені яблука залишились у кошику. Скільки яблук отримає кожен студент? Скільки яблук залишиться в кошику?
Програма отримує числа N і K. Вона повинна вивести два числа: відповіді на поставлені вище питання.
"""
n = int(input('Enter a number of students: '))
k = int(input('Enter a number of apples: '))
print('Every student got a ' + str(k//n) + ' apple(s) and ' + str(k%n) + ' apple(s) left in a basket')


#-----------------------------------------------------------------


#task4------------------------------------------------------------
"""
	Умова: Нехай число N - кількість хвилин, відрахованих після півночі. Скільки годин і хвилин буде показувати цифровий годинник, якщо за відлік взяти 00:00?
"""
n = int(input('Enter a number of minutes: '))
h = n % 1440 // 60
m=n % 60
if 0 <= h < 10 and 0 <= m < 10:
    print('The time: '+'0'+str(h)+ ':'+'0'+str(m))
if h > 10 and m > 10:
    print('The time: '+str(h)+ ':'+str(m))
if 0 <= h < 10 and m > 10:
    print('The time: '+'0'+str(h)+ ':'+str(m))
elif h > 10 and 0 <= m < 10:
    print('The time: '+str(h)+ ':'+"0"+str(m))


#-----------------------------------------------------------------


#task5------------------------------------------------------------
"""
	Умова: Напишіть програму, яка вітає користувача, друкуючи слово "Hello", ім'я користувача і знак оклику після нього. Наприклад “Hello, Mike!”
"""
print('Hello, ' + str(input('What is your name?')) + '! ')

#-----------------------------------------------------------------


#task6------------------------------------------------------------
"""
	Умова:  Напишіть програму, яка зчитує ціле число і друкує його попереднє і наступне значення за форматом:
The next number for the number 179 is 180.
The previous number for the number 179 is 178.
"""
n = int(input('Enter a number'))
print('The next number for the number ' + str(n) + ' is ' + str(n+1) + '. ')
print('The previous number for the number ' + str(n) + ' is ' + str(n-1) + '. ')



#-----------------------------------------------------------------


#task7------------------------------------------------------------
"""
	Умова: Школа вирішила сформувати три нові групи учнів та надати їм окремі класи. У кожному класі необхідно встановити столи для учнів, у розрахунку, що за одним столом може сидіти не більше двох учнів. 
Яку мінімальну кількість столів необхідно придбати?
"""
a = int(input('Enter a number pupils in group "A": '))
b = int(input('Enter a number pupils in group "B": '))
c = int(input('Enter a number pupils in group "C": '))
print('The school need to buy a ' + str((a // 2 + a % 2)+(b // 2 + b % 2)+(c // 2 + c % 2))+ ' desks')



#-----------------------------------------------------------------


