#Задача №1 ------------------------------------------------------------------------
"""

Умова: Напишіть програму, яка отримує три числа і друкує їх суму. Кожне число користувач вводить у окремому рядку.

Вхідні дані: 3 дійсних числа.  Кожне число користувач вводить в окремому рядку.

Вихідні дані: вивести суму трьох чисел на екран.
"""


#input------------------------------------------------------------------
a = int(input())
b = int(input())
c = int(input())
#output-----------------------------------------------------------------
print(a + b + c)

#-----------------------------------------------------------------------------------


#Задача №2--------------------------------------------------------------------------
"""
Умова: Напишіть програму, яка отримує довжини двох катетів прямокутного трикутника та виводить його площу. Користувач вводить довжини катетів у окремих рядках.

Вхідні дані: 2 дійсних числа.  Кожне число користувач вводить в окремому рядку.

Вихідні дані: вивести площу трикутника на екран.
"""


#input------------------------------------------------------------------
b = int(input())
h = int(input())
#output-----------------------------------------------------------------
print(b*h/2)

#----------------------------------------------------------------------------------


#Задача №3-------------------------------------------------------------------------
"""
Умова: N студентів отримали K яблук і розподілити їх між собою порівну. Неподілені яблука залишились у кошику. Скільки яблук отримає кожен студент? Скільки яблук залишиться в кошику?

Програма отримує числа N і K. Вона повинна вивести два числа: відповіді на поставлені вище питання.

Вхідні дані: 2 цілих числа.  Кожне число користувач вводить в окремому рядку.

Вихідні дані: вивести два числа. Перше - кількість яблук у студента, друге - кількість яблук, що лишилось у кошику.
"""


#input------------------------------------------------------------------
students = int(input())
apples = int(input())
#main-------------------------------------------------------------------
every = apples // students
rem = apples % students
#output-----------------------------------------------------------------
print(every)
print(rem)

#-----------------------------------------------------------------------


#Задача №4--------------------------------------------------------------
"""
Умова: Нехай число N - кількість хвилин, відрахованих після півночі. Скільки годин і хвилин буде показувати цифровий годинник, якщо за відлік взяти 00:00?

Програма повинна виводити два числа: кількість годин (від 0 до 23) і кількість хвилин (від 0 до 59). Візьміть до уваги, що починаючи з півночі може пройти декілька днів, тому число N може бути достатньо великим.

Вхідні дані: 1 ціле число, що вводить користувач

Вихідні дані: вивести два числа. Перше - години, друге - хвилини.
"""


#input------------------------------------------------------------------
minutes = int(input())
#main-------------------------------------------------------------------
period = minutes//1440
minutes = minutes - period*1440
hours = minutes//60
newMinutes = minutes - hours*60
#output-----------------------------------------------------------------
print(hours)
print(newMinutes)

#-----------------------------------------------------------------------------------


#Задача №5--------------------------------------------------------------------------
"""
Умова: Напишіть програму, яка вітає користувача, друкуючи слово "Hello", ім'я користувача і знак оклику після нього. Наприклад “Hello, Mike!”

Вхідні дані: ім'я користувача

Вихідні дані: вивести рядок привітання
"""


#input------------------------------------------------------------------
name = input()
#output-----------------------------------------------------------------
print("Hello, "+name+"!")

#-----------------------------------------------------------------------


#Задача №6--------------------------------------------------------------
"""
Умова: Напишіть програму, яка зчитує ціле число і друкує його попереднє і наступне значення за форматом:

 	
The next number for the number 179 is 180.
The previous number for the number 179 is 178.
Вхідні дані: ціле число

Вихідні дані: два рядки за наведеним у завдання форматом.
"""


#input------------------------------------------------------------------
integer = int(input())
#output-----------------------------------------------------------------
print("The next number for the number",str(integer),"is",str(integer+1)+".")
print("The previous number for the number",str(integer),"is",str(integer-1)+".")

#-----------------------------------------------------------------------


#Задача №7-------------------------------------------------------------------------
"""
Умова: Школа вирішила сформувати три нові групи учнів та надати їм окремі класи. У кожному класі необхідно встановити столи для учнів, у розрахунку, що за одним столом може сидіти не більше двох учнів. Яку мінімальну кількість столів необхідно придбати?

Вхідні дані: 3 цілих числа - кількість учнів у кожній групі.  Кожне число користувач вводить в окремому рядку.

Вихідні дані: число - кількість столів
"""


#input------------------------------------------------------------------
firstGroup = int(input())
secondGroup = int(input())
thirdGroup = int(input())
#main-------------------------------------------------------------------
firstPar = firstGroup%2
secondPar = secondGroup%2
thirdPar = thirdGroup%2
firstGroupDesks = firstGroup//2+firstPar
secondGroupDesks = secondGroup//2+secondPar
thirdGroupDesks = thirdGroup//2+thirdPar
#output-----------------------------------------------------------------
print(firstGroupDesks + secondGroupDesks + thirdGroupDesks)

#-----------------------------------------------------------------------
