#task1------------------------------------------------------------
"""
Напишіть програму, яка отримує три числа і друкує їх суму. 
Кожне число користувач вводить у окремому рядку.
"""

a = int(input("Please enter first number "))
b = int(input("Please enter second number "))
c = int(input("Please enter third number "))

print("Sum of a, b and c is " + str(a + b + c))

#-----------------------------------------------------------------


#task2------------------------------------------------------------
"""
 Напишіть програму, яка отримує довжини двох катетів прямокутного трикутника та виводить його площу.
 Користувач вводить довжини катетів у окремих рядках.
"""
a = int(input("Please enter first side of tringle "))
b = int(input("Please enter second side of tringle "))

print("Square of tringle is " + str((a * b) / 2))

#-----------------------------------------------------------------


#task3------------------------------------------------------------
"""
N студентів отримали K яблук і розподілити їх між собою порівну. Неподілені яблука залишились у кошику. 
Скільки яблук отримає кожен студент? Скільки яблук залишиться в кошику?
Програма отримує числа N і K. Вона повинна вивести два числа: відповіді на поставлені вище питання.
"""

k = int(input("Enter quantity of students "))
n = int(input("Enter quantity of apples "))

print("Each student receives " + str(n // k) + " apples")
print(str(n % k) + " apples remains in the basket")

#-----------------------------------------------------------------


#task4------------------------------------------------------------
"""
Нехай число N - кількість хвилин, відрахованих після півночі.
Скільки годин і хвилин буде показувати цифровий годинник, якщо за відлік взяти 00:00?
Програма повинна виводити два числа: кількість годин (від 0 до 23) і кількість хвилин (від 0 до 59). 
Візьміть до уваги, що починаючи з півночі може пройти декілька днів, тому число N може бути достатньо великим.
"""

n = int(input("Enter quantity of minutes "))

print("It's " + str((n // 60) % 24) + ":" + str(n % 60))

#-----------------------------------------------------------------


#task5------------------------------------------------------------
"""
Напишіть програму, яка вітає користувача, друкуючи слово "Hello", ім'я користувача і знак оклику після нього. 
Наприклад “Hello, Mike!”
"""

name = input("Please enter your name ")

print("Hello, " + name + "!")

#-----------------------------------------------------------------


#task6------------------------------------------------------------
"""
Напишіть програму, яка зчитує ціле число і друкує його попереднє і наступне значення за форматом:
The next number for the number 179 is 180.
The previous number for the number 179 is 178.
"""

n = int(input("Enter the number "))

print("The next number for the number " + str(n) + " is " + str(n+1) + ".")
print("The previous number for the number " + str(n) + " is " + str(n-1) + ".")

#-----------------------------------------------------------------


#task7------------------------------------------------------------
"""
Школа вирішила сформувати три нові групи учнів та надати їм окремі класи.
У кожному класі необхідно встановити столи для учнів, у розрахунку, що за одним столом може сидіти не більше двох учнів. 
Яку мінімальну кількість столів необхідно придбати?
"""

n1 = int(input("Please enter quantity of students in first group "))
n2 = int(input("Please enter quantity of students in second group "))
n3 = int(input("Please enter quantity of students in third group "))

print("Minimal number of tables is " + str((n1 + n2 + n3 + 1) // 2))

#-----------------------------------------------------------------