#task1------------------------------------------------------------
“””
Напишіть програму, яка отримує три числа і друкує їх суму. Кожне число користувач вводить у окремому рядку.

“””
#a=float(input("первое число:"))
b=float(input("второе число:"))
c=float (input("третье число:"))
print("сумма:",a+b+c)
#-----------------------------------------------------------------


#task2------------------------------------------------------------
“””
Напишіть програму, яка отримує довжини двох катетів прямокутного трикутника та виводить його площу. Користувач вводить довжини катетів у окремих рядках. 

“””
#a=float(input("первый катет:"))
b=float(input("второй катет:"))
print(a*b*1/2)
#-----------------------------------------------------------------


#task3------------------------------------------------------------
“””
N студентів отримали K яблук і розподілити їх між собою порівну. Неподілені яблука залишились у кошику. Скільки яблук отримає кожен студент? Скільки яблук залишиться в кошику?
Програма отримує числа N і K. Вона повинна вивести два числа: відповіді на поставлені вище питання.

 “””
#N=int(input("к-ство яблок:"))
K=int(input("к-ство студентов:"))
print("к-ство яблок у студента:",N//K)
print("к-ство яблок в корзине:",N%K)
#-----------------------------------------------------------------


#task4------------------------------------------------------------
“””
Нехай число N - кількість хвилин, відрахованих після півночі. Скільки годин і хвилин буде показувати цифровий годинник, якщо за відлік взяти 00:00?
Програма повинна виводити два числа: кількість годин (від 0 до 23) і кількість хвилин (від 0 до 59). Візьміть до уваги, що починаючи з півночі може пройти декілька днів, тому число N може бути достатньо великим.

“””
#N=int(input("к-ство минут:"))
b=N//60
c=N%60
print("часы:",b)
print("минуты:",c)
#-----------------------------------------------------------------


#task5------------------------------------------------------------
“””
Напишіть програму, яка вітає користувача, друкуючи слово "Hello", ім'я користувача і знак оклику після нього. Наприклад “Hello, Mike!”

“””
#name=input("your name:")
print("Hello,",name,"!")
#-----------------------------------------------------------------


#task6------------------------------------------------------------
“””
Напишіть програму, яка зчитує ціле число і друкує його попереднє і наступне значення за форматом: The next number for the number 179 is 180. The previous number for the number 179 is 178.

 “””
#a=input("Введите число:")
print("The next number for the number",a,int(a)+1)
print("The previous number for the number",a,int(a)-1)
#-----------------------------------------------------------------


#task7------------------------------------------------------------
“””
Школа вирішила сформувати три нові групи учнів та надати їм окремі класи. У кожному класі необхідно встановити столи для учнів, у розрахунку, що за одним столом може сидіти не більше двох учнів. Яку мінімальну кількість столів необхідно придбати?

 “””
#a=int(input("первая группа"))
b=int(input("вторая группа"))
c=int(input("третья группа"))
d=a//2+a%2
f=b//2+b%2
e=c//2+c%2
print(d+f+e)
#-----------------------------------------------------------------
