#task1----------------------------------------------------------
'''
Выведите все элементы списка с четными индексами (то есть A[0], 
A[2], A[4], ...).
'''
s = input().split(' ')
for i in range(0,len(s),2):
  print(s[i])

#----------------------------------------------------------------

#task2----------------------------------------------------------
'''
Выведите все четные элементы списка. При этом используйте цикл 
for, перебирающий элементы списка, а не их индексы!
'''
s = input().split(' ')
for i in s:
  if i//2 == 0:
    print(i, end=' ')
    
#task3---------------------------------------------------------
'''
Дан список чисел. Выведите все элементы списка, которые больше
предыдущего элемента.
'''
s = input().split(' ')
for i in range(1,len(s)):
  if s[i]>s[i-1]:
    print(s[i], end=' ')
#---------------------------------------------------------------

#task4---------------------------------------------------------
'''
Дан список чисел. Если в нем есть два соседних элемента одн
ого знака, выведите эти числа. Если соседних элементов одного 
знака нет — не выводите ничего. Если таких пар соседей несколь
ко — выведите первую пару.
'''
s = input().split(' ')
for i in range(1,len(s),2):
  if s[i]*s[i-1]>0:
      print(s[i-1], ' ', s[i])
      break

#---------------------------------------------------------------

#task5---------------------------------------------------------
'''
Дан список чисел. Определите, сколько в этом списке элементов,
которые больше двух своих соседей, и выведите количество таких
элементов. Крайние элементы списка никогда не учитываются, 
поскольку у них недостаточно соседей.
'''
k=0
s = input().split(' ')
for i in range(1,len(s)-1):
  if s[i]>s[i-1] and s[i]>s[i+1]:
     k+=1
print(k)
#---------------------------------------------------------------

#task6---------------------------------------------------------
'''
Дан список чисел. Выведите значение наибольшего элемента в спи
ске, а затем индекс этого элемента в списке. Если наибольших 
элементов несколько, выведите индекс первого из них.
'''
s = input().split(' ')
max = int(s[0])
index_of_max = 0
for i in range(1,len(s)):
    if max<int(s[i]):
        print(max,'<',s[i])
        max = int(s[i])
        index_of_max = i
print(index_of_max)
#---------------------------------------------------------------


#task3---------------------------------------------------------
'''
'''
---------------------------------------------------------------


#task3---------------------------------------------------------
'''
'''
---------------------------------------------------------------


#task3---------------------------------------------------------
'''
'''
---------------------------------------------------------------


#task3---------------------------------------------------------
'''
'''
---------------------------------------------------------------


#task3---------------------------------------------------------
'''
'''
---------------------------------------------------------------


#task3---------------------------------------------------------
'''
'''
---------------------------------------------------------------


#task3---------------------------------------------------------
'''
'''
---------------------------------------------------------------


#task3---------------------------------------------------------
'''
'''
---------------------------------------------------------------


#task3---------------------------------------------------------
'''
'''
---------------------------------------------------------------


#task3---------------------------------------------------------
'''
'''
---------------------------------------------------------------


#task3---------------------------------------------------------
'''
'''
---------------------------------------------------------------


#task3---------------------------------------------------------
'''
'''
---------------------------------------------------------------


#task3---------------------------------------------------------
'''
'''
---------------------------------------------------------------

