#task1-------------------------------------------------------------------------------------------------------
"""

Напишите программу, которая считывает три числа и выводит их сумму. Каждое число записано в отдельной строке.

"""
#Програма для обчислення суми трьох чисел
first_number = int(input())#Введення першого числа
second_number = int(input())#Введення другого числа
third_number = int(input())#Введення третього числа
print(third_number+second_number+first_number)#Виведення суми чисел

#task2-------------------------------------------------------------------------------------------------------
"""

Напишите программу, которая приветствует пользователя, 
выводя слово Hello, введенное имя и знаки препинания по образцу:

"""
#Програма для обчислення площі прямокутного трикутника
first_cathet = int(input())#Введення першого катета
second_cathet = int(input())#Введення другого катета
print(0.5*second_cathet*first_cathet)#Виведення площі

#task3-------------------------------------------------------------------------------------------------------
"""

Напишите программу, которая приветствует пользователя, выводя слово Hello, введенное имя и знаки препинания по образцу:

"""
#Програма для привітання з користувачем
name = input()
print('Hello'+ ', '  + name + '!')

#task4-------------------------------------------------------------------------------------------------------
"""

Напишите программу, которая считывает целое число и выводит текст, аналогичный приведенному в примере (пробелы важны!).

"""
#Програма, що зчитує ціле число і виводить наступне та попереднє число
number = input()#Введене число
print('The next number for the number '+ number + ' is '+ str(int(number)+1) + '.')#Виведення наступного числа
print('The previous number for the number ' + number + ' is '+str(int(number)-1) + '.')#Виведення попереднього числа

#task5-------------------------------------------------------------------------------------------------------
"""

n школьников делят k яблок поровну, неделящийся остаток остается в корзинке.
Сколько яблок достанется каждому школьнику? Сколько яблок останется в корзинке?
Программа получает на вход числа n и k и должна вывести искомое количество яблок (два числа).

"""
#Програма для ділення яблук між школярами та визначення залишку
number_of_students=int(input())#Enter number of students
number_of_apples=int(input())#Enter number of apples
print(number_of_apples//number_of_students)#Кількість яблук, що дістануться кожному школяреві
print(number_of_apples%number_of_students)#Кількість яблук, що залишуться в корзині

#task6-------------------------------------------------------------------------------------------------------
"""

В школе решили набрать три новых математических класса. Так как занятия по математике у них проходят в одно и то же время, 
было решено выделить кабинет для каждого класса и купить в них новые парты. 
За каждой партой может сидеть не больше двух учеников. Известно количество учащихся в каждом из трёх классов.
Сколько всего нужно закупить парт чтобы их хватило на всех учеников? 
Программа получает на вход три натуральных числа: количество учащихся в каждом из трех классов.

"""
#Програма для обчислення кількості парт, що потрібні для трьох класів
#Для розв’язання заданої задачі імпортуємо math
from math import ceil
pupil_of_first_class=int(input())#Введення кількості учнів першого класу
desk_of_first_class=ceil(pupil_of_first_class/2)#Обчислення кількості парт, що потрібні для учнів першого класу
pupil_of_second_class=int(input())#Введення кількості учнів другого класу
desk_of_second_class=ceil(pupil_of_second_class/2)#Обчислення кількості парт, що потрібні для учнів другого класу
pupil_of_third_class=int(input())#Введення кількості учнів третього класу
desk_of_third_class=ceil(pupil_of_third_class/2)#Обчислення кількості парт, що потрібні для учнів третього класу
print(desk_of_first_class+desk_of_second_class+desk_of_third_class)#

#task7-------------------------------------------------------------------------------------------------------
"""

Дано число n. С начала суток прошло n минут. Определите, сколько часов и минут будут показывать электронные часы в этот момент.
Программа должна вывести два числа: количество часов (от 0 до 23) и количество минут (от 0 до 59).
Учтите, что число n может быть больше, чем количество минут в сутках.

"""
#Програма для обчислення того, скільки годин і хвилин показуватиме електронний годинник в цей момент.
minutes=int(input())#Введення кількості хвилин
minutes=minutes%1440#Ми прибираємо дні
hours=minutes//60#Знаходимо години
print(hours,minutes%60)#Виведення того, скільки годин і хвилин показуватиме електронний годинник в цей момент.
