#task1------------------------------------------------------------
""" Умова: Напишіть програму, яка отримує три числа і друкує їх суму. Кожне число користувач вводить у окремому рядку.
Вхідні дані: 3 дійсних числа.  Кожне число користувач вводить в окремому рядку.
Вихідні дані: вивести суму трьох чисел на екран.
"""



#write your answer here...
print('Введите три целых числа')
number_one=(input()) #программа считывает первое число
number_two=(input())#программа считывает второе число
number_three=(input())#программа считывает третье число
print(‘Сумма ваших чисел:’+a+b+c+, '!') #вывод на экран суммы данных чисел





#task2------------------------------------------------------------
Умова: Напишіть програму, яка отримує довжини двох катетів прямокутного трикутника та виводить його площу. Користувач вводить довжини катетів у окремих рядках.
Вхідні дані: 2 дійсних числа.  Кожне число користувач вводить в окремому рядку.
Вихідні дані: вивести площу трикутника на екран.
"""



#write your answer here...
      print('Введите значения катетов прямоугольного треугольника')
cathetus_one=int(input())
      cathetus_two=int(input())
square=(1/2* cathetus_one * cathetus_two)\print('Площадь треугольник равна:', square)



#task3------------------------------------------------------------
"""
Умова: N студентів отримали K яблук і розподілити їх між собою порівну. Неподілені яблука залишились у кошику. Скільки яблук отримає кожен студент? Скільки яблук залишиться в кошику?
Програма отримує числа N і K. Вона повинна вивести два числа: відповіді на поставлені вище питання.
Вхідні дані: 2 цілих числа.  Кожне число користувач вводить в окремому рядку.
Вихідні дані: вивести два числа. Перше - кількість яблук у студента, друге - кількість яблук, що лишилось у кошику.


#write your answer here...

print('Введите количество студентов')
student_amount=int(input()) #программа считывает количество студентов
print('Введите количество яблок') 
apple_amount=int(input()) #программа считывает количество яблок
everyone=(apple_amount//student_amount) #присваивается значение  целого числа от деления
apple_rest=apple_amount%student_amount #присваивается значение остатка яблок
print('Количество яблок, которое получит каждый студент:', everyone )
print('Количество яблок, которое останется в корзине:', apple_rest)



#task4------------------------------------------------------------
"""
Умова: Нехай число N - кількість хвилин, відрахованих після півночі. Скільки годин і хвилин буде показувати цифровий годинник, якщо за відлік взяти 00:00?
Програма повинна виводити два числа: кількість годин (від 0 до 23) і кількість хвилин (від 0 до 59). Візьміть до уваги, що починаючи з півночі може пройти декілька днів, тому число N може бути достатньо великим.
Вхідні дані: 1 ціле число, що вводить користувач
Вихідні дані: вивести два числа. Перше - години, друге - хвилини.


#write your answer here...

print('Введите количество минут после полуночи')
minute_amount=int(input()) #программа присваивает значение количества минут
hour=minute_amount//60 #расчет целого количества часов
min=minute_amount%60 #расчет целого количества минут
print(hour,'часа и', min, 'минуты')



#task5------------------------------------------------------------
"""
Умова: Напишіть програму, яка вітає користувача, друкуючи слово "Hello", ім'я користувача і знак оклику після нього. Наприклад “Hello, Mike!”
Вхідні дані: ім'я користувача
Вихідні дані: вивести рядок привітання

"""



#write your answer here...
print('Введите имя')
name=input() #переменной присваивается значение
print('Hello, ' + name+ '!')


#task6------------------------------------------------------------
"""
Умова: Напишіть програму, яка зчитує ціле число і друкує його попереднє і наступне значення за форматом:
 The next number for the number 179 is 180.
The previous number for the number 179 is 178.Вхідні дані: ціле число
Вихідні дані: два рядки за наведеним у завдання форматом.
"""



#write your answer here...

print('Введите целое число')
number_one=int(input()) # присваивается значение данного числа
previous=number_one-1 #переменная для расчета предыдущего числа данному
next=number_one+1 #переменная для расчета следующего числа данному
print('Предыдущее число:', previous)
print('Следующее число:', next)

#task7------------------------------------------------------------
"""
Умова: Школа вирішила сформувати три нові групи учнів та надати їм окремі класи. У кожному класі необхідно встановити столи для учнів, у розрахунку, що за одним столом може сидіти не більше двох учнів. Яку мінімальну кількість столів необхідно придбати?
Вхідні дані: 3 цілих числа - кількість учнів у кожній групі.  Кожне число користувач вводить в окремому рядку.
Вихідні дані: число - кількість столів
 """
#write your answer here...
print('Введите количество учеников первой группы')
amount_first_group=int(input())
print('Введите количество учеников второй группы')
amount_second_group=int(input())
print('Введите количество учеников третьeй группы')
amount_third_group =int(input())
amount_tables=int((amount_first_group//2 + amount_first_group%2)+(amount_second_group//2+ amount_second_group%2) + (amount_third_group//2+ amount_third_group%2))
print('Необходимое количество парт:', amount_tables)
