#task1------------------------------------------------------------
"""
Умова: Напишіть програму, яка отримує три числа і друкує їх суму. Кожне число користувач вводить у окремому рядку.
Вхідні дані: 3 дійсних числа.  Кожне число користувач вводить в окремому рядку.
Вихідні дані: вивести суму трьох чисел на екран.
"""



#
def main():# main Function
    a = int(input())  # "enter a: "
    b = int(input())  # "enter b: "
    c = int(input())  # "enter c: "
    print(my_sum(a, b, c)) # have your result


def my_sum(a, b, c):  #name sum function 
    res = a + b + c   #explain sum function
    return res        #back to the previous part where function is needed

main()

#-----------------------------------------------------------------


#task2------------------------------------------------------------
"""
Умова: Напишіть програму, яка отримує довжини двох катетів прямокутного трикутника та виводить його площу. Користувач вводить довжини катетів у окремих рядках.

Вхідні дані: 2 дійсних числа.  Кожне число користувач вводить в окремому рядку.

Вихідні дані: вивести площу трикутника на екран.

"""



#
a = int(input())  #"enter a: "
b = int(input())  #"enter b: "
print(a*b/2)

#-----------------------------------------------------------------


#task3------------------------------------------------------------
"""
Умова: N студентів отримали K яблук і розподілити їх між собою порівну. Неподілені яблука залишились у кошику. Скільки яблук отримає кожен студент? Скільки яблук залишиться в кошику?

Програма отримує числа N і K. Вона повинна вивести два числа: відповіді на поставлені вище питання.

Вхідні дані: 2 цілих числа.  Кожне число користувач вводить в окремому рядку.

Вихідні дані: вивести два числа. Перше - кількість яблук у студента, друге - кількість яблук, що лишилось у кошику.
"""



#
N = int(input())#enters number of students
K = int(input())#enters number of apples
print(K//N)#print number of apples for each student
print(K%N)#print how much apples is left

#-----------------------------------------------------------------

#task4------------------------------------------------------------
"""
Умова: Нехай число N - кількість хвилин, відрахованих після півночі. Скільки годин і хвилин буде показувати цифровий годинник, якщо за відлік взяти 00:00?

Програма повинна виводити два числа: кількість годин (від 0 до 23) і кількість хвилин (від 0 до 59). Візьміть до уваги, що починаючи з півночі може пройти декілька днів, тому число N може бути достатньо великим.

Вхідні дані: 1 ціле число, що вводить користувач

Вихідні дані: вивести два числа. Перше - години, друге - хвилини.
"""



#
N = int(input())#enter number of minutes
h = int(N//60)#number of hours
print(h%24)#hours
print(N-h*60)#minutes

#-----------------------------------------------------------------

#task5------------------------------------------------------------
"""
Умова: Напишіть програму, яка вітає користувача, друкуючи слово "Hello", ім'я користувача і знак оклику після нього. Наприклад “Hello, Mike!”

Вхідні дані: ім'я користувача

Вихідні дані: вивести рядок привітання
"""



#
a=str(input())
print("Hello, ",a,"!",sep='')

#-----------------------------------------------------------------
#task6------------------------------------------------------------
"""
Умова: Напишіть програму, яка зчитує ціле число і друкує його попереднє і наступне значення за форматом:
  	

The next number for the number 179 is 180.
The previous number for the number 179 is 178.

Вхідні дані: ціле число

Вихідні дані: два рядки за наведеним у завдання форматом.
"""



#
a = int(input())#Enter your number
print('The next number for the number', a ,'is', a+1)#Prints next number
print('The previous number for the number', a,'is', a-1)#Prints previous number

#-----------------------------------------------------------------
#task7------------------------------------------------------------
"""
Умова: Школа вирішила сформувати три нові групи учнів та надати їм окремі класи. У кожному класі необхідно встановити столи для учнів, у розрахунку, що за одним столом може сидіти не більше двох учнів. Яку мінімальну кількість столів необхідно придбати?

Вхідні дані: 3 цілих числа - кількість учнів у кожній групі.  Кожне число користувач вводить в окремому рядку.

Вихідні дані: число - кількість столів
"""



#
a = int(input())#Enter number of pupils in first group
b = int(input())#Enter number of pupils in second group
c = int(input())#Enter number of pupils in third group
print(a//2+b//2+c//2+a%2+b%2+c%2)#Prints number of desks
#-----------------------------------------------------------------

