#task1------------------------------------------------
"""
Умова: Напишіть програму, яка отримує три числа і друкує їх суму. Кожне число користувач вводить у окремому рядку.

Вхідні дані: 3 дійсних числа.  Кожне число користувач вводить в окремому рядку.

Вихідні дані: вивести суму трьох чисел на екран.
"""
#Програма для обчислення суми трьох заданих чисел
#number1, тип:float. Задане користувачем число 
#number2, тип:float. Задане користувачем число
#number3, тип:float. Задане користувачем число
#Блок введення інформації
number1 = float(input('Введіть дійсне число'))

number2 = float(input('Введіть дійсне число'))

number3 = float(input('Введіть дійсне число'))

#Блок виведення інформації
print('Результат: ', a + b + c)
#----------------------------------------------------


#task2------------------------------------------------
"""
Умова: Напишіть програму, яка отримує довжини двох катетів прямокутного трикутника та виводить його площу. Користувач вводить довжини катетів у окремих рядках.

Вхідні дані: 2 дійсних числа.  Кожне число користувач вводить в окремому рядку.

Вихідні дані: вивести площу трикутника на екран.
"""
#Програма для обчислення площі трикутника
#cathet1, тип:float. Задане користувачем число 
#cathet2, тип:float. Задане користувачем число
#square, тип:float. Результат обчислення програми
#Блок введення інформації
cathet1 = float(input('Введіть перший катет трикутника'))

cathet2 = float(input('Введіть другий катет трикутника'))

#Обчислення
square = cathet1 * cathet2 / 2
#Блок виведення інформації
print('Результат: ', square)
#----------------------------------------------------



#task3------------------------------------------------
"""
Умова: N студентів отримали K яблук і розподілити їх між собою порівну. 
Неподілені яблука залишились у кошику. Скільки яблук отримає кожен студент? 

Скільки яблук залишиться в кошику?

Програма отримує числа N і K. Вона повинна вивести два числа: відповіді на поставлені вище питання.

Вхідні дані: 2 цілих числа.  Кожне число користувач вводить в окремому рядку.

Вихідні дані: вивести два числа. Перше - кількість яблук у студента, друге - кількість яблук, що лишилось у кошику.
"""
#Програма для обчислення кількості яблук у кошику
#students_number, тип:int. Задане користувачем число 
#apples_number, тип:int. Задане користувачем число
#remainder, тип:int. Результат обчислення програми
#student_apple, тип:int. Результат обчислення програми
#Блок введення інформації
students_number = int(input('Введіть кількість студентів'))
apples_number = int(input('Введіть кількість яблук'))

#Обчислення
student_apple = apples_number // students_number

remainder = apples_number % students_number)
#Блок виведення інформації
print('Кількість яблук у студента: ', student_apple)
print('Кількість яблук у кошику: ', remainder)
#----------------------------------------------------


#task4------------------------------------------------
"""
Умова: Нехай число N - кількість хвилин, відрахованих після півночі. Скільки годин і хвилин буде показувати цифровий годинник, якщо за відлік взяти 00:00?

Програма повинна виводити два числа: кількість годин (від 0 до 23) і кількість хвилин (від 0 до 59). Візьміть до уваги, що починаючи з півночі може пройти декілька днів, тому число N може бути достатньо великим.

Вхідні дані: 1 ціле число, що вводить користувач

Вихідні дані: вивести два числа. Перше - години, друге - хвилини.
"""
#Програма для переведення хвилин у години
#minute_number, тип:int. Задане користувачем число 
#hour_number, тип:int. Результат обчислення програми
#remainder_minute, тип:int. Результат обчислення програми
#Блок введення інформації
minute_number = int(input('Введіть кількість хвилин'))
#Обчислення

hour_number = minute_number // 60
remainder_minute = minute_number % 60
#Блок виведення інформації
print('Кількість годин: ', hour_number)
print('Кількість хвилин: ', remainder_minute)
#----------------------------------------------------


#task5------------------------------------------------
"""
Умова: Напишіть програму, яка вітає користувача, друкуючи слово "Hello", ім'я користувача і знак оклику після нього. Наприклад “Hello, Mike!”

Вхідні дані: ім'я користувача

Вихідні дані: вивести рядок привітання
"""
#Програма для вітання користувача
#user_name, тип:string. Задане користувачем ім'я 
#greeting, тип:string. Результат обчислення програми
#Блок введення інформації
user_name = input('Введіть своє ім'я')
#Обчислення
greeting = user_name + "!"
#Блок виведення інформації
print('Hello, ', greeting)
#----------------------------------------------------


#task6------------------------------------------------
"""
Умова: Напишіть програму, яка зчитує ціле число і друкує його попереднє і наступне значення за форматом:

 	
The next number for the number 179 is 180.
The previous number for the number 179 is 178.
Вхідні дані: ціле число

Вихідні дані: два рядки за наведеним у завдання форматом.
"""
#Програма для знаходження сусідніх для числа чисел
#user_number, тип:int. Задане користувачем число
#previous_number, тип:int. Результат обчислення програми
#next_number, тип:int. Результат обчислення програми
#Блок введення інформації
user_number = int(input('Введіть ціле число'))
#Обчислення
previous_number = user_number - 1
next_number = user_number + 1
#Блок виведення інформації
print('The next number for the number', user_number, 'is', next_number)
print('The previous number for the number', user_number, 'is', previous_number)
#----------------------------------------------------


#task7------------------------------------------------
"""
Умова: Школа вирішила сформувати три нові групи учнів та надати їм окремі класи. У кожному класі необхідно встановити столи для учнів, у розрахунку, що за одним столом може сидіти не більше двох учнів. Яку мінімальну кількість столів необхідно придбати?

Вхідні дані: 3 цілих числа - кількість учнів у кожній групі.  Кожне число користувач вводить в окремому рядку.

Вихідні дані: число - кількість столів
"""
#Програма для визначення кількості столів
#pupils_number1, тип:int. Задане користувачем число
#pupils_number2, тип:int. Задане користувачем число
#pupils_number3, тип:int. Задане користувачем число
#table_number, тип:int. Результат обчислення програми
#Блок введення інформації
pupils_number1 = int(input('Введіть кількість учнів у першому класі'))
pupils_number2 = int(input('Введіть кількість учнів у другому класі'))
pupils_number3 = int(input('Введіть кількість учнів у третьому класі'))
#Обчислення
table_number = ((pupils_number1 // 2) + (pupils_number1 % 2)) + ((pupils_number2 // 2) + (pupils_number3 % 2)) + ((pupils_number3 // 2) + (pupils_number3 % 2))
#Блок виведення інформації
print('Кількість столів: ', table_number)
#----------------------------------------------------


