#task1------------------------------------------------
"""
Даны два целых числа A и B (при этом A ? B). 
Выведите все числа от A до B включительно.
"""
#Програма для створення списку квадратів чисел, менших за задане
#number, тип:int. Задане користувачем число 
#i, тип:int. Результат обчислень програми
#Блок введення інформації
number = int(input('Введіть ціле число'))

#Обчислення
i=1

while (i**2)<=N:

    print(i**2)

    i+=1
#-----------------------------------------------------


#task2------------------------------------------------
"""
Дано целое число, не меньшее 2. 
Выведите его наименьший натуральный делитель, отличный от 1.
"""
#Програма для знаходження найменшого натурального дільника
#number, тип:int. Задане користувачем число 
#i, тип:int. Результат обчислень програми
#Блок введення інформації
number = int(input('Введіть ціле число, не менше 2'))

#Обчислення
i=2

if n%2==0:

    print('Найменший натуральний дільник: ', i)

else:

    while n%i!=0:

        i+=1
    
print('Найменший натуральний дільник: ', i)
#-----------------------------------------------------


#task3------------------------------------------------
"""
По данному натуральному числу N найдите наибольшую целую степень двойки, не превосходящую N. 
Выведите показатель степени и саму степень.
Операцией возведения в степень пользоваться нельзя!
"""
#Програма для знаходження найбільшого степеня числа 2
#number, тип:int. Задане користувачем число 
#two_in_power, тип:int. Результат обчислень програми
#power, тип:int. Результат обчислень програми
#Блок введення інформації
number = int(input('Введіть ціле число, не менше 2'))

#Обчислення
two_in_power = 2

power = 1

while two_in_power <= n:

    two_in_power *= 2

    power += 1

print('Степінь: ', power - 1, 'Значення двійки у степені:', 'two_in_power // 2)
#-----------------------------------------------------


#task4------------------------------------------------
"""
В первый день спортсмен пробежал x километров, а затем он каждый день увеличивал пробег на 10% от предыдущего значения. 
По данному числу y определите номер дня, на который пробег спортсмена составит не менее y километров.

Программа получает на вход действительные числа x и y и должна вывести одно натуральное число.
"""
#Програма для розрахунку плану пробіжок
#x, тип:float. Задане користувачем число 
#y, тип:float. Задане користувачем число 
#days, тип:int. Результат обчислень програми
#Блок введення інформації
x = float(input('Введіть початкову кількість кілометрів'))

y = float(input('Введіть кінцеву кількість кілометрів'))

#Обчислення
days = 1

while (x < y):

    x *= 1.1

    days += 1

print('Кількість днів:', days)
#-----------------------------------------------------


#task5------------------------------------------------
"""
Вклад в банке составляет x рублей. Ежегодно он увеличивается на p процентов, после чего дробная часть копеек отбрасывается.
Определите, через сколько лет вклад составит не менее y рублей.
Программа получает на вход три натуральных числа: x, p, y и должна вывести одно целое число.
"""
#Програма для розрахунку депозиту користувача
#x, тип:int. Задане користувачем число
#p, тип:int. Задане користувачем число 
#y, тип:int. Задане користувачем число 
#years, тип:int. Результат обчислень програми
#Блок введення інформації
x = int(input('Введіть розмір початкового вкладу'))

p = int(input('Введіть відсоткову ставку'))

y = int(input('Введіть розмір кінцевого вкладу'))

#Обчислення
years = 1

while (x < y):

    x *= 1 + p / 100

    x = int(100 * x) / 100

    years += 1

print('Кількість років: ', years)
#-----------------------------------------------------


#task6------------------------------------------------
"""
Программа получает на вход последовательность целых неотрицательных чисел, каждое число записано в отдельной строке.
Последовательность завершается числом 0, при считывании которого программа должна закончить свою работу и вывести количество членов последовательности (не считая завершающего числа 0).
Числа, следующие за числом 0, считывать не нужно.
"""
#Програма для розрахунку довжини послідовності
#length, тип:int. Результат обчислень програми 
#Присвоєння 
length = 0
#Обчислення
while int(input("Введіть ціле невід'ємне число")) != 0:

    len += 1

print('Довжина послідовності: ', len)
#-----------------------------------------------------


#task7------------------------------------------------
"""
Определите сумму всех элементов последовательности, завершающейся числом 0. 
В этой и во всех следующих задачах числа, следующие за первым нулем, учитывать не нужно.
"""
#Програма для розрахунку суми послідовності
#sum, тип:int. Результат обчислень програми 
#element, тип:int. Задане користувачем число
#Присвоєння 
sum = 0
#Обчислення
element = int(input("Введіть ціле число"))

while element != 0:

    sum += element

    element = int(input("Введіть ціле число"))

print('Результат: ', sum)
#-----------------------------------------------------


#task8------------------------------------------------
"""
Определите среднее значение всех элементов последовательности, завершающейся числом 0.
"""
#Програма для розрахунку середнього знач послідовності
#sum, тип:int. Результат обчислень програми 
#len, тип:int. Результат обчислень програми 
#element, тип:int. Задане користувачем число
#Обчислення
sum = 0
len = 0

element = int(input('Введіть ціле число'))

while element != 0:

    sum += element

    len += 1

    element = int(input('Введіть ціле число'))

print('Результат: ', sum / len)
#-----------------------------------------------------


#task9------------------------------------------------
"""
Последовательность состоит из натуральных чисел и завершается числом 0. 
Определите значение наибольшего элемента последовательности.
"""
#Програма для розрахунку найбільшого елемента
#max, тип:int. Результат обчислень програми 
#element, тип:int. Задане користувачем число
#Обчислення
max = 0

element = -1

while element != 0:

    element = int(input('Введіть ціле число'))

    if element > max:

        max = element

print('Результат: ', max)
#-----------------------------------------------------


#task10-----------------------------------------------
"""
Последовательность состоит из натуральных чисел и завершается числом 0. Определите индекс наибольшего элемента последовательности. 
Если наибольших элементов несколько, выведите индекс первого из них. Нумерация элементов начинается с нуля.
"""
#Програма для розрахунку індексу найбільшого елемента
#max, тип:int. Результат обчислень програми 
#len, тип:int. Результат обчислень програми 
#index_of_max, тип:int. Результат обчислень програми 
#element, тип:int. Задане користувачем число
#Обчислення
max = 0

index_of_max = -1

element = -1

len = 0

while element != 0:

    element = int(input('Введіть ціле число'))

    if element > max:

        max = element

        index_of_max = len

    len += 1

print('Результат: ', index_of_max)

#-----------------------------------------------------


#task11-----------------------------------------------
"""
Определите количество четных элементов в последовательности, завершающейся числом 0.
"""
#num_even, тип:int. Результат обчислень програми 
#element, тип:int. Задане користувачем число
#Обчислення
num_even = -1

element = -1

while element != 0:

    element = int(input('Введіть ціле число'))

    if element % 2 == 0:

        num_even += 1

print('Результат: ', num_even)
#-----------------------------------------------------


#task12-----------------------------------------------
"""
Последовательность состоит из натуральных чисел и завершается числом 0. 
Определите, сколько элементов этой последовательности больше предыдущего элемента.
"""
#answer, тип:int. Результат обчислень програми 
#prev, тип:int. Задане користувачем число
#next, тип:int. Задане користувачем число
#Обчислення
prev = int(input('Введіть ціле число'))

answer = 0

while prev != 0:

    next = int(input('Введіть ціле число'))

    if next != 0 and prev < next:

        answer += 1

    prev = next

print('Результат: ', answer)
#-----------------------------------------------------


#task13-----------------------------------------------
"""
Последовательность состоит из различных натуральных чисел и завершается числом 0. Определите значение второго по величине элемента в этой последовательности.
Гарантируется, что в последовательности есть хотя бы два элемента.
"""
#first_max, тип:int. Результат обчислень програми 
#second_max, тип:int. Результат обчислень програми 
#element, тип:int. Задане користувачем число
#Обчислення
first_max=0

while 1==1:

    element=int(input('Введіть ціле число'))

    if x > first_max:

        second_max = first_max

        first_max = element

    elif element > second_max:

        second_max = element
    if element == 0:

        print('Результат: ', second_max)

        break
#-----------------------------------------------------


#task14-----------------------------------------------
"""
Последовательность состоит из натуральных чисел и завершается числом 0. 
Определите, сколько элементов этой последовательности равны ее наибольшему элементу.
"""
#max, тип:int. Результат обчислень програми 
#i, тип:int. Результат обчислень програми 
#element, тип:int. Задане користувачем число
#Обчислення
max=0

i=1

while 1==1:

    element=int(input('Введіть ціле число'))

    if element>max:

        max=element

        i=1

    elif element==max:

        i+=1

    if element==0:

        print(i)

        break
#-----------------------------------------------------


#task15-----------------------------------------------
"""
По данному числу n определите n-е число Фибоначчи ?n.

Эту задачу можно решать и циклом for.
"""
#n, тип:int. Задане користувачем число 
#a,b,c,i, тип:int. Результат обчислень програми
#Обчислення
n=int(input())

a=1

b=1

c=1

i=2

if n==0:
    print("0")

else:

    while i<n:

        c=a+b

        a=b

        b=c

        i+=1

    print(c)
#-----------------------------------------------------


#task16-----------------------------------------------
"""
Дано натуральное число A. 
Определите, каким по счету числом Фибоначчи оно является, то есть выведите такое число n, что ?n = A. 
Если А не является числом Фибоначчи, выведите число -1.
"""
#a,b,c,i, тип:int. Результат обчислень програми 
#X, тип:int. Задане користувачем число
#Обчислення
X=int(input())

a=1

b=1

c=0

i=2

while c<X:
    c=a+b

    a=b

    b=c

    i+=1

if c==X:

    print(i)

else:

    print("-1")
#-----------------------------------------------------


#task17-----------------------------------------------
"""
Дана последовательность натуральных чисел, завершающаяся числом 0. 
Определите, какое наибольшее число подряд идущих элементов этой последовательности равны друг другу.
"""
#y,i,j тип:int. Результат обчислень програми 
#x, тип:int. Задане користувачем число
#Обчислення
y=0

i=1

j=1

while 1==1:

    x=int(input())

    if x==y:

        i+=1

    else:

        if j<i:

            j=i

        i=1

    y=x

    if x==0:

        print(j)

        break
#-----------------------------------------------------