#task1------------------------------------------------
"""
Даны два целых числа A и B (при этом A ? B). 
Выведите все числа от A до B включительно.
"""
#Програма для створення ряду за заданими числами
#number1, тип:int. Задане користувачем число 
#number2, тип:int. Задане користувачем число
#i, тип:int. Лічильник
#Блок введення інформації
number1 = int(input('Введіть ціле число'))

number2 = int(input('Введіть ціле число'))

#Обчислення
for i in range(number1, number2):

    print(i)
#-----------------------------------------------------


#task2------------------------------------------------
"""
Даны два целых числа A и В. 
Выведите все числа от A до B включительно, в порядке возрастания, если A < B, 
или в порядке убывания в противном случае.
"""
#Програма для створення ряду за заданими числами
#number1, тип:int. Задане користувачем число 
#number2, тип:int. Задане користувачем число
#i, тип:int. Лічильник
#Блок введення інформації
number1 = int(input('Введіть ціле число'))

number2 = int(input('Введіть ціле число'))

#Обчислення
if (A<B):

    for i in range(A, B+1):

        print(i)

elif (A==B):

    print(A)

else :

    for i in range(A, B-1, -1):

        print(i)
#-----------------------------------------------------


#task3------------------------------------------------
"""
Даны два целых числа A и В, A>BA>B. Выведите все нечётные числа от A до B включительно. 
В этой задаче можно обойтись без инструкции if.
"""
#Програма для створення ряду за заданими числами
#number1, тип:int. Задане користувачем число 
#number2, тип:int. Задане користувачем число
#i, тип:int. Лічильник
#Блок введення інформації
number1 = int(input('Введіть ціле число'))

number2 = int(input('Введіть ціле число'))

#Обчислення
for i in range(number1 - (number1 + 1) % 2, number2 - number2 % 2, -2):

    print(i, end=' ')
#-----------------------------------------------------



#task4------------------------------------------------
"""
Дано 10 целых чисел. Вычислите их сумму. 
Напишите программу, использующую наименьшее число переменных.
"""
#Програма для обчислення суми 10 чисел
#number, тип:int. Задане користувачем число 
#sum, тип:int. Результат обчислень програми
#i, тип:int. Лічильник
#Обчислення
sum = 0

for i in range(10):
#Блок введення інформації
    number = int(input('Введіть ціле число'))

    sum += number

print("Сума:", sum)
#-----------------------------------------------------


#task5------------------------------------------------
"""
Дано несколько чисел. Вычислите их сумму. Сначала вводите количество чисел N, затем вводится ровно N целых чисел. 
Какое наименьшее число переменных нужно для решения этой задачи?
"""
#Програма для обчислення суми n чисел
#n, тип:int. Задане користувачем число, кількість чисел
#number, тип:int. Задане користувачем число 
#sum, тип:int. Результат обчислень програми
#i, тип:int. Лічильник
#Блок введення інформації
n = int(input('Введіть кількість чисел'))
#Обчислення
sum = 0

for i in range(10):
#Блок введення інформації
    number = int(input('Введіть ціле число'))

    sum += number

print("Сума:", sum)
#-----------------------------------------------------


#task6------------------------------------------------
"""
По данному натуральном n вычислите сумму 1^3+2^3+3^3+...+n^3
"""
#Програма для обчислення суми кубів n чисел
#n, тип:int. Задане користувачем число, кількість чисел
#sum, тип:int. Результат обчислень програми
#i, тип:int. Лічильник
#Блок введення інформації
n = int(input('Введіть кількість чисел'))
#Обчислення
sum = 0

for i in range(10):
    i = i**3
    sum += i

print("Сума:", sum)
#-----------------------------------------------------


#task7------------------------------------------------
"""
Факториалом числа n называется произведение 1 ? 2 ? ... ? n. Обозначение: n!.
По данному натуральному n вычислите значение n!. 
Пользоваться математической библиотекой math в этой задаче запрещено.
"""
#Програма для обчислення факторіала числа 
#number, тип:int. Задане користувачем число
#prod, тип:int. Результат обчислень програми
#i, тип:int. Лічильник
#Блок введення інформації
number = int(input('Введіть натуральне число'))
#Обчислення
res = 1

for i in range(1, n + 1):

    res *= i

print('Результат: ', res)
#-----------------------------------------------------


#task8------------------------------------------------
"""
По данному натуральном n вычислите сумму 1!+2!+3!+...+n!1!+2!+3!+...+n!.
В решении этой задачи можно использовать только один цикл. 
Пользоваться математической библиотекой math в этой задаче запрещено.
"""
#Програма для обчислення суми факторіалів 
#number, тип:int. Задане користувачем число
#factorial, тип:int. Результат обчислень програми
#sum, тип:int. Результат обчислень програми
#i, тип:int. Лічильник
#Блок введення інформації
number = int(input('Введіть натуральне число'))
#Обчислення
factorial = 1

sum = 0

for i in range(1, n + 1):

    factorial *= i
    
    sum += factorial

print('Результат: ', sum)
#-----------------------------------------------------


#task9------------------------------------------------
"""
Дано N чисел: сначала вводится число N, затем вводится ровно N целых чисел. Подсчитайте количество нулей среди введенных чисел и выведите это количество. 
Вам нужно подсчитать количество чисел, равных нулю, а не количество цифр.
"""
#Програма для обчислення кількості нулів 
#n, тип:int. Задане користувачем число
#number, тип:int. Задане користувачем число, кількість чисел
#sum, тип:int. Результат обчислень програми
#i, тип:int. Лічильник
#Блок введення інформації
n = int(input('Введіть кількість чисел'))
#Обчислення
sum = 0

for i in range(1, n+1):

    number=int(input(Введіть ціле число))
    if number == 0:

        sum +=1

print('Результат: ', sum)
#-----------------------------------------------------


#task10------------------------------------------------
"""
По данному натуральному n ? 9 выведите лесенку из n ступенек, i-я ступенька состоит из чисел от 1 до i без пробелов.
"""
#Програма для виведення сходинок 
#number, тип:int. Задане користувачем число
#j, тип:int. Лічильник
#i, тип:int. Лічильник
#Блок введення інформації
number = int(input('Введіть натуральне число, не більше 9'))
#Обчислення
for i in range(1, n+1):

    for j in range (1, i+1):

        print(j, end = '')

    print()
#-----------------------------------------------------