#task1------------------------------------------------------------
"""
Дано два цілих числа. Вивести найменше з них.
"""
a = int(input())
b = int(input())
if (a>b):
    print (b)
else:
    print(a)
#-----------------------------------------------------------------


#task2------------------------------------------------------------
"""
Вивести результат функціїsign(x), що визначається наступним чином: 
sign(x) = 1, if x > 0, 
sign(x) = -1, if x < 0, 
sign(x) = 0, if x = 0..

"""
x = int(input())
if x>0:
    print(1)
if x==0:
    print(0)
if x<0:
    print(-1)
#-----------------------------------------------------------------


#task3------------------------------------------------------------
"""
Дано три цілих числа. Вивести найменше з них.
"""
a = int(input())
b = int(input())
c = int(input())
if a<b<=c:
    print (a) 
if a<c<b:
    print (a)
if b<a<=c:
    print (b)
if b<c<a:
    print (b)
if c<a<=b:
    print (c)
if c<b<a:
    print (c)
#-----------------------------------------------------------------


#task4------------------------------------------------------------
"""
Дано ціле число, що визначає рік. Визначити, чи є вказаний рік високосним. Якщо так, то вивести користувачу "LEAP", в іншому випадку – "СOMMON".
"""
a = int(input())
if (((a%4)==0) and ((a%100)!=0)) or ((a%400)==0):
    print ('LEAP')
else:
    print ('COMMON')
#-----------------------------------------------------------------


#task5------------------------------------------------------------
"""
Дано три цілих числа. Визначте, скільки з них дорівнюють один одному. Програма повинна виводити одне з чисел: 3 (якщо всі числа однакові), 
2 (якщо два з них дорівнюють один одному, а третє відрізняється) або 0 (якщо всі числа різні).

"""
a = int(input())
b = int(input())
c = int(input())
if a==b==c:
    print ('3')
if a==b!=c or b==c!=a or c==a!=b:
    print ('2')
if a!=b and b!=c and c!=a:
    print ('0')
#-----------------------------------------------------------------


#task6------------------------------------------------------------
"""
Шахова тура переміщається по горизонталі або по вертикалі. Дано координати двох клітин шахової дошки. Визначити, чи може тура перейти з першої клітини у другу за один хід. 
Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини. Перші два числа - для першої клітини, останні два числа – для другої. 
Програма має вивести "YES", якщо тура може виконати переміщення, або "NO" в іншому випадку.
"""
a = int(input())
b = int(input())
c = int(input())
d = int(input())
if a==c or b==d:
    print('YES')
else:
    print('NO')
#-----------------------------------------------------------------


#task7------------------------------------------------------------
"""
Дано координати двох клітин шахової дошки. Визначити, чи однакового вони кольору. Користувач вводить чотири цілих числа від 1 до 8, 
кожне з яких визначає номер рядку та стовпчика клітини. Перші два числа - для першої клітини, останні два числа – для другої. 
Програма має вивести "YES", якщо колір однаковий, або "NO" в іншому випадку.
"""
a = int(input())
b = int(input())
c = int(input())
d = int(input())
if ((a+b)%2)==((c+d)%2):
    print('YES')
else:
    print('NO')
#-----------------------------------------------------------------


#task8------------------------------------------------------------
"""
Шаховий король переміщується по горизонталі, по вертикалі або по діагоналі на будь-яку сусідню клітинку. Дано координати двох клітин шахової дошки. Визначити, 
чи може король перейти з першої клітини у другу за один хід. Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини. 
Перші два числа - для першої клітини, останні два числа – для другої. Програма має вивести "YES", якщо хід можливий, або "NO" в іншому випадку.

"""
a = int(input())
b = int(input())
c = int(input())
d = int(input())
if ((a==c) and ((b-d)==1 or (d-b)==1)) or (b==d and ((a-c)==1 or (c-a)==1)) or (((a-c)==1) and ((b-d)==1 or (d-b)==1)) or (((c-a)==1) and ((b-d)==1 or (d-b)==1)):
    print ('YES')    
else:
    print ('NO')
#-----------------------------------------------------------------


#task9------------------------------------------------------------
"""
Шаховий слон рухається по діагоналі на будь-яку кількість клітин. Дано координати двох клітин шахової дошки. Визначити, чи може слон перейти з першої клітини у другу за один хід. 
Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини. Перші два числа - для першої клітини, останні два числа – для другої. 
Програма має вивести "YES", якщо хід можливий, або "NO" в іншому випадку.
"""
a = int(input())
b = int(input())
c = int(input())
d = int(input())
if ((a-c)==(b-d) or (a-c)==(d-b)) or ((c-a)==(b-d) or (a-c)==(d-b)):  
    print ('YES')    
else:
    print ('NO')
#-----------------------------------------------------------------


#task10------------------------------------------------------------
"""
Шахова королева рухається по горизонталі, по вертикалі або по діагоналі на будь-яку кількість клітин. Дано координати двох клітин шахової дошки. Визначити, 
чи може королева перейти з першої клітини у другу за один хід. Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини. 
Перші два числа - для першої клітини, останні два числа – для другої. Програма має вивести "YES", якщо хід можливий, або "NO" в іншому випадку.
"""
a = int(input())
b = int(input())
c = int(input())
d = int(input())
if ((a-c)==(b-d) or (a-c)==(d-b)) or ((c-a)==(b-d) or (a-c)==(d-b)) or (a==c or b==d):  
    print ('YES')    
else:
    print ('NO')
#-----------------------------------------------------------------


#task11------------------------------------------------------------
"""
Шаховий кінь рухається як літера L. Він може переміщатись на дві клітинки по горизонталі і одну клітинку по вертикалі або на дві клітинки по вертикалі і одну по горизонталі. 
Дано координати двох клітин шахової дошки. Визначити, чи може кінь перейти з першої клітини у другу за один хід. Користувач вводить чотири цілих числа від 1 до 8, 
кожне з яких визначає номер рядку та стовпчика клітини. Перші два числа - для першої клітини, останні два числа – для другої. 
Програма має вивести "YES", якщо хід можливий, або "NO" в іншому випадку.

"""
a = int(input())
b = int(input())
c = int(input())
d = int(input())
if (((b-d)==2) or ((d-b)==2)) and (((a-c)==1)or((c-a)==1)) or (((a-c)==2) or ((c-a)==2)) and (((b-d)==1)or((d-b)==1)):
    print ('YES')
else:
    print('NO')
#-----------------------------------------------------------------


#task12------------------------------------------------------------
"""
Шоколад має форму прямокутника, розділеного на n?m клітин. Шоколад може бути розділений на дві частини тільки по горизонталі або по вертикалі, 
при цьому клітини мають бути цілими. Визначити, чи можна розділити шоколад за один крок таким чином, щоб одна з частин матиме точно k клітин. 
Програма має вивести "YES", якщо шоколад можна поділити, або "NO" в іншому випадку.
"""
n = int(input())
m = int(input())
k = int(input())
a=n*m
b=a-k
if b>0 and (b%n==0 or b%m==0):
    print ('YES')
else:
    print ('NO')
#-----------------------------------------------------------------