#task1------------------------------------------------------------
"""
Напишіть програму, яка отримує три числа і друкує їх суму. Кожне число користувач вводить у окремому рядку.
"""
a = int(input())
b = int(input())
c = int(input())
print(a + b + c)
#-----------------------------------------------------------------


#task2------------------------------------------------------------
"""
Напишіть програму, яка отримує довжини двох катетів прямокутного трикутника та виводить його площу. Користувач вводить довжини катетів у окремих рядках.

"""
b = int(input())
h = int(input())
print(1/2*b*h)
#-----------------------------------------------------------------


#task3------------------------------------------------------------
"""
N студентів отримали K яблук і розподілити їх між собою порівну. Неподілені яблука залишились у кошику. Скільки яблук отримає кожен студент? Скільки яблук залишиться в кошику?
"""
n = int(input())
k = int(input())
print(k // n)
print(k % n)
#-----------------------------------------------------------------


#task4------------------------------------------------------------
"""
Нехай число N - кількість хвилин, відрахованих після півночі. Скільки годин і хвилин буде показувати цифровий годинник, якщо за відлік взяти 00:00?
"""
a = int(input())
b=a//60
b=b%24
c=a%60
print(b,c)
#-----------------------------------------------------------------


#task5------------------------------------------------------------
"""
Напишіть програму, яка вітає користувача, друкуючи слово "Hello", ім'я користувача і знак оклику після нього. Наприклад “Hello, Mike!”

"""
a = str(input())
print("Hello, "+a+"!")
#-----------------------------------------------------------------


#task6------------------------------------------------------------
"""
Напишіть програму, яка зчитує ціле число і друкує його попереднє і наступне значення за форматом:
"""
a = int(input())
b=(a+1)
c=(a-1)
a=str(a)
b=str(b)
c=str(c)
print("The next number for the number "+a+" is "+b+".")
print("The previous number for the number "+a+" is "+c+".")

#-----------------------------------------------------------------


#task7------------------------------------------------------------
"""
Школа вирішила сформувати три нові групи учнів та надати їм окремі класи. У кожному класі необхідно встановити столи для учнів, 
у розрахунку, що за одним столом може сидіти не більше двох учнів. Яку мінімальну кількість столів необхідно придбати?
"""
a = int(input())
b = int(input())
c = int(input())
d=(a+1)//2
e=(b+1)//2
f=(c+1)//2
print(d+e+f)
#-----------------------------------------------------------------