#task1------------------------------------------------------------
"""
Дано два цілих числа. Вивести найменше з них.
"""


number1 = int(input()) #перше число
number2 = int(input())  #друге число
if (number1 > number2 ):  
  print(number2)
else:
  print(number1)


#task2------------------------------------------------------------
"""
Вивести результат функціїsign(x), що визначається наступним чином: 
sign(x) = 1, if x > 0, 
sign(x) = -1, if x < 0, 
sign(x) = 0, if x = 0..
"""


x= int(input()) #дійсне число
if  x > 0:
     sign = 1 
if  x < 0:
     sign =-1
if  x == 0:
     sign  =0
print (sign)


#task3------------------------------------------------------------

"""
Дано три цілих числа. Вивести найменше з них.
"""


number1 = int(input())#перше число
number2 = int(input())#друге число
number3 = int(input())#третє число
if number2 >= number1 and number3 >= number1: # перше число менше від другого і третього числа
    print(number1) 
elif number1 >= number2 and number3 >= number2: # друге число менше від першого і третього числа
    print(number2)
else: # якщо ані перше число, ані друге число не є найменшими, то найменшим числом є третє число
    print(number3)


#task4------------------------------------------------------------
"""
Дано ціле число, що визначає рік. Визначити, чи є вказаний рік високосним. Якщо так, то вивести користувачу "LEAP", в іншому випадку – "СOMMON".
"""


year  = int(input()) #число яким заданий рік
if ( (year %4 == 0) and (year %100 != 0) or (year %400 == 0)):
     print ("LEAP") #рік високосний
else:
       print ("COMMON") #рік не високосний


#task5------------------------------------------------------------
"""
Дано три цілих числа. Визначте, скільки з них дорівнюють один одному. Програма повинна виводити одне з чисел: 3 (якщо всі числа однакові), 2 (якщо два з них дорівнюють один одному, а третє відрізняється) або 0 (якщо всі числа різні).
"""


number1 = int(input())#перше число
number2 = int(input())#друге число
number3 = int(input())#третє число
if ( number1 == number2) and (number2 == number3):
     print ("3") # всі числа одинакові 
else:
     if (number1 == number2) or (number1 == number3) or (number2 == number3):
         print ("2") #двоє з чисел дорівнюють один одному, а третє відрізняється
     else: 
         print ("0") #всі числа різні
  

#task6------------------------------------------------------------
"""
Шахова тура переміщається по горизонталі або по вертикалі. Дано координати двох клітин шахової дошки. Визначити, чи може тура перейти з першої клітини у другу за один хід. Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини. Перші два числа - для першої клітини, останні два числа – для другої. Програма має вивести "YES", якщо тура може виконати переміщення, або "NO" в іншому випадку.
"""


x1 = int(input()) # перша координата першої клітинки
y1 = int(input())# друга координата першої клітинки
x2 = int(input())# перша координата другої клітинки
y2 = int(input())# друга координата другої клітинки
if x1==x2 or y1==y2:  
     print ("YES") #фігура переміщається лише по горизонталі або вертикалі
else: 	
    print ("NO") #фігура  не переміщається лише по горизонталі або вертикалі


#task7------------------------------------------------------------
"""
Дано координати двох клітин шахової дошки. Визначити, чи однакового вони кольору. Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини. Перші два числа - для першої клітини, останні два числа – для другої. Програма має вивести "YES", якщо колір однаковий, або "NO" в іншому випадку.
"""


x1 = int(input()) # перша координата першої клітинки
y1 = int(input())# друга координата першої клітинки
x2 = int(input())# перша координата другої клітинки
y2 = int(input())# друга координата другої клітинки
if ((x1-x2)%2==0 and (y1-y2)%2==0 ) or  ((x1-x2)%2 != 0 and (y1-y2)%2 !=0 ) : 
      print ("YES") # клітинки одного коліру
else: 
     print ("NO") # клітинки різних колірів


#task8------------------------------------------------------------
"""
Шаховий король переміщується по горизонталі, по вертикалі або по діагоналі на будь-яку сусідню клітинку. Дано координати двох клітин шахової дошки. Визначити, чи може король перейти з першої клітини у другу за один хід. Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини. Перші два числа - для першої клітини, останні два числа – для другої. Програма має вивести "YES", якщо хід можливий, або "NO" в іншому випадку.
"""


x1 = int(input()) # перша координата першої клітинки
y1 = int(input())# друга координата першої клітинки
x2 = int(input())# перша координата другої клітинки
y2 = int(input())# друга координата другої клітинки
if abs(y1 - y2) <= 1 and abs(x1 - x2) <= 1 :
    print('YES') # шаховий король переміщується по горизонталі, по вертикалі або по діагоналі на будь-яку сусідню клітинку
else:
    print('NO') # шаховий король не переміщується по горизонталі, по вертикалі або по діагоналі на будь-яку сусідню клітинку


#task9------------------------------------------------------------
"""
Шаховий слон рухається по діагоналі на будь-яку кількість клітин. Дано координати двох клітин шахової дошки. Визначити, чи може слон перейти з першої клітини у другу за один хід. Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини. Перші два числа - для першої клітини, останні два числа – для другої. Програма має вивести "YES", якщо хід можливий, або "NO" в іншому випадку.
 """


x1 = int(input()) # перша координата першої клітинки
y1 = int(input())# друга координата першої клітинки
x2 = int(input())# перша координата другої клітинки
y2 = int(input())# друга координата другої клітинки
if x1-x2==y1-y2 or x1+x2==y1+y2:
     print ("YES") #шаховий слон рухається по діагоналі на будь-яку кількість клітин
else: 
    print ("NO") #шаховий слон не рухається по діагоналі на будь-яку кількість клітин


#task10------------------------------------------------------------
"""
Шахова королева рухається по горизонталі, по вертикалі або по діагоналі на будь-яку кількість клітин. Дано координати двох клітин шахової дошки. Визначити, чи може королева перейти з першої клітини у другу за один хід. Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини. Перші два числа - для першої клітини, останні два числа – для другої. Програма має вивести "YES", якщо хід можливий, або "NO" в іншому випадку.
"""


x1 = int(input()) # перша координата першої клітинки
y1 = int(input())# друга координата першої клітинки
x2 = int(input())# перша координата другої клітинки
y2 = int(input())# друга координата другої клітинки
if x1-y1==x2-y2 or x1+y1==x2+y2 or  x1==x2 or y1==y2:
     print ("YES") #шахова королева рухається по горизонталі, по вертикалі або по діагоналі на будь яку кількість клітинок.
else: 
    print ("NO") #шахова королева не рухається по горизонталі, по вертикалі або по діагоналі на будь яку кількість клітинок.


#task11------------------------------------------------------------
"""
Шаховий кінь рухається як літера L. Він може переміщатись на дві клітинки по горизонталі і одну клітинку по вертикалі або на дві клітинки по вертикалі і одну по горизонталі. Дано координати двох клітин шахової дошки. Визначити, чи може кінь перейти з першої клітини у другу за один хід. Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини. Перші два числа - для першої клітини, останні два числа – для другої. Програма має вивести "YES", якщо хід можливий, або "NO" в іншому випадку.
"""


x1 = int(input()) # перша координата першої клітинки
y1 = int(input())# друга координата першої клітинки
x2 = int(input())# перша координата другої клітинки
y2 = int(input())# друга координата другої клітинки
if abs(x1 - x2) == 1 and abs(y1 - y2) == 2 or abs(x1 - x2) == 2 and abs(y1 - y2)== 1:
         print ("YES") # шаховий кінь рухається як літера L.
else: 
    print ("NO") # шаховий кінь не  рухається як літера L


#task12------------------------------------------------------------
"""
Шоколад має форму прямокутника, розділеного на n×m клітин. Шоколад може бути розділений на дві частини тільки по горизонталі або по вертикалі, при цьому клітини мають бути цілими. Визначити, чи можна розділити шоколад за один крок таким чином, щоб одна з частин матиме точно k клітин. Програма має вивести "YES", якщо шоколад можна поділити, або "NO" в іншому випадку. 
"""


n = int(input()) #довжина шоколадки
m = int(input())#ширина шоколадки
k = int(input())#кількість клітинок в шоколадці, якщо її розділити на дві частини тільки по горизонталі або по вертикалі
if k<=m*n and (k % n == 0 or k % m == 0):
         print("YES") #шоколад може бути розділений на дві частини тільки по горизонталі або по вертикалі так щоб у ній знаходилося k клітинок.
else:
    print("NO") #шоколад не може бути розділений на дві частини тільки по горизонталі або по вертикалі так щоб у ній знаходилося k клітинок.



