#task1------------------------------------------------------------
"""
Напишіть програму, яка отримує три числа і друкує їх суму. Кожне число користувач вводить у окремому рядку. 
# a, b, c  будь які дійсні числа
"""


a = int(input())
b = int(input())
c = int(input())
print(a + b + c)


#task2------------------------------------------------------------
"""
Напишіть програму, яка отримує довжини двох катетів прямокутного трикутника та виводить його площу. Користувач вводить довжини катетів у окремих рядках.
"""


# b і h є катетами прямокутного трикутника
b = int(input())
h = int(input())
#  виводиться площа трикутника
print(1/2*b*h)


#task3------------------------------------------------------------
"""
N студентів отримали K яблук і розподілити їх між собою порівну. Неподілені яблука залишились у кошику. Скільки яблук отримає кожен студент? Скільки яблук залишиться в кошику?
"""


# n -кількість студентів
n = int(input())
# k-кількість яблук
k = int(input())
# знаходимо скільки яблук отримає кожен студент, а потім знаходимо скільки яблук залишиться в кошику
 print(k // n)
print(k % n)


#task4------------------------------------------------------------
"""
Нехай число N - кількість хвилин, відрахованих після півночі. Скільки годин і хвилин буде показувати цифровий годинник, якщо за відлік взяти 00:00?
Програма повинна виводити два числа: кількість годин (від 0 до 23) і кількість хвилин (від 0 до 59). Візьміть до уваги, що починаючи з півночі може пройти декілька днів, тому число N може бути достатньо великим
"""


# N - кількість хвилин
N = int(input())
# котра зараз година
print( ((N  // 60)%24)  )
# котра зараз хвилина
print(N % 60)



#task5------------------------------------------------------------
"""
Напишіть програму, яка вітає користувача, друкуючи слово "Hello", ім'я користувача і знак оклику після нього. Наприклад “Hello, Mike!”
"""


name = input()
print('Hello, ' + name + '!')



#task6------------------------------------------------------------

"""
Напишіть програму, яка зчитує ціле число і друкує його попереднє і наступне значення за форматом: 
The next number for the number 179 is 180.
The previous number for the number 179 is 178.

"""

# a будь яке ціле числа
a = int(input())
print( 'The next number for the number ' + str(a) + ' is ' + str(a+1))
print( 'The previous number for the number ' + str(a) + ' is ' + str(a-1))



#task7------------------------------------------------------------
"""
 Школа вирішила сформувати три нові групи учнів та надати їм окремі класи. У кожному класі необхідно встановити столи для учнів, у розрахунку, що за одним столом може сидіти не більше двох учнів. Яку мінімальну кількість столів необхідно придбати 
"""


# a, b, c кількість учнів у кожному класі
a = int(input())
b = int(input())
c = int(input())
#  обчислюємо яку мінімальну кількість столів необхідно придбати


print((a+1) // 2 + (b+1) // 2 + (c+1) // 2 ) 


