# -*- coding: utf-8 -*-

"""
    Домашня робота №3
    Тема: "Цикл for"
    Студент: Козирєв Антон Юрійович
    Група: КМ - 62
"""

#Task_1----------------------------------------------------#

"""
    Условие:
    Факториалом числа n называется произведение 1 × 2 × ... × n. Обозначение: n!.
    По данному натуральному n вычислите значение n!. Пользоваться математической библиотекой math в этой задаче запрещено.
"""

Default_Number = 1 #Default N
Step = 0 #
Number = int(input()) #"Enter N: "
for i in range(Number):
    Step += 1
    Default_Number = Default_Number * Step
print(Default_Number)

#----------------------------------------------------------#


#Task_2----------------------------------------------------#

"""
    Условие:
    По данному натуральном nn вычислите сумму 1!+2!+3!+...+n!1!+2!+3!+...+n!.
    В решении этой задачи можно использовать только один цикл. Пользоваться математической библиотекой math в этой задаче запрещено.
"""

Default_Number = 1 #Default N
Sum = 0 #Default sum
Step = 0 #
Number = int(input()) #"Enter N: "
# 1! + 2! + 3! + ... + n! -> x! + (x+1)! + (x+2)! + ...
for i in range(Number):
    Step += 1
    Default_Number = Default_Number * Step
    Sum = Sum + Default_Number
print(Sum)

#----------------------------------------------------------#



#Task_3----------------------------------------------------#

"""
    Условие:
    Дано N чисел: сначала вводится число N, затем вводится ровно N целых чисел.
    Подсчитайте количество нулей среди введенных чисел и выведите это количество.
    Вам нужно подсчитать количество чисел, равных нулю, а не количество цифр.
"""

Amount_of_Numbers = int(input()) # N numbers
Zero_Number = 0; #Zero numbers
for i in range(Amount_of_Numbers):
    Number = int(input())
    if Number == 0:
        Zero_Number += 1
print(Zero_Number)

#----------------------------------------------------------#



#Task_4----------------------------------------------------#

"""
    Условие:
    По данному натуральному n ≤ 9 выведите лесенку из n ступенек, i-я ступенька состоит из чисел от 1 до i без пробелов.
"""

Stairs_Number = int(input()) # Stairs number
Step = 1 #
Number = " " # Count of number per stair
if Stairs_Number >= 9:
    print("Too much")
else:
    for i in range(Stairs_Number):
        Number = Number + str(Step)
        print(Number)
        Step += 1

# N = 1 => num = " " + "1" 
# N = 2 => num = " " + "1" + "2"

#----------------------------------------------------------#



