#task1------------------------------------------------------------
“””
Дано два цілих числа. Вивести найменше з них. 
“””
#a=int(input("First number:"))
b=int(input("Secound number:"))
if a<b:
    print(a)
elif a>b:
    print(b)
else:
    print("none")
#-----------------------------------------------------------------


#task2------------------------------------------------------------
“””
Вивести результат функціїsign(x), що визначається наступним чином: 
sign(x) = 1, if x > 0, 
sign(x) = -1, if x < 0, 
sign(x) = 0, if x = 0.

 “””
#x=float(input("Enter number:"))
if x>0:
    print("sign(x) = 1")
elif x<0:
    print("sign(x) = -1")
else:
    print("sign(x) = 0")
#-----------------------------------------------------------------


#task3------------------------------------------------------------
“””
Дано три цілих числа. Вивести найменше з них.

 “””
#a=int(input("First number:"))
b=int(input("Secound number:"))
c=int(input("Third number:"))
if a<b and a<c:
    print(a)
elif b<c and b<a:
    print(b)
elif c<b and c<a:
    print(c)
else:
    print("a=b=c")
#-----------------------------------------------------------------


#task4------------------------------------------------------------
“””
Дано ціле число, що визначає рік. Визначити, чи є вказаний рік високосним. Якщо так, то вивести користувачу "LEAP", в іншому випадку – "СOMMON".
Рік високосний, якщо виконується хоча б одна з умов:
•рік завжди високосним, якщо його номер ділиться на 4 без остачі і не ділиться без остачі на 100
•рік завжди високосним, якщо його номер ділиться на 400 без остачі

 “””
#a=int(input("Enter the year:"))
b=a%4
c=a%100
d=a%400
if b==0 and c!=0:
   print("LEAP")
elif d==0:
    print("LEAP")
else:
	 print("СOMMON")
#-----------------------------------------------------------------


#task5------------------------------------------------------------
“””
Дано три цілих числа. Визначте, скільки з них дорівнюють один одному. Програма повинна виводити одне з чисел: 3 (якщо всі числа однакові), 2 (якщо два з них дорівнюють один одному, а третє відрізняється) або 0 (якщо всі числа різні).

 “””
#a=int(input("First number:"))
b=int(input("Secound number:"))
c=int(input("Third number:"))
if a!=b and a!=c and c!=b:
    print(0)
elif b!=c or a!=b or a!=c:
    print(2)
else:
    print(3)
#-----------------------------------------------------------------


#task6------------------------------------------------------------
“””
Шахова тура переміщається по горизонталі або по вертикалі. Дано координати двох клітин шахової дошки. Визначити, чи може тура перейти з першої клітини у другу за один хід. Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини. Перші два числа - для першої клітини, останні два числа – для другої. Програма має вивести "YES", якщо тура може виконати переміщення, або "NO" в іншому випадку.

 “””
#a=int(input("First number:"))
b=int(input("Secound number:"))
c=int(input("Third number:"))
z=int(input("Fourth number:"))
x=list(range(1,9))
if (a not in x or b not in x or c not in x or z not in x):
    print("Inccorect input")
elif (a==c or b==z):
    print("YES")
else:
    print("NO")
#-----------------------------------------------------------------


#task7------------------------------------------------------------
“””
Дано координати двох клітин шахової дошки. Визначити, чи однакового вони кольору. Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини. Перші два числа - для першої клітини, останні два числа – для другої. Програма має вивести "YES", якщо колір однаковий, або "NO" в іншому випадку.

“””
#a=int(input("First number:"))
b=int(input("Secound number:"))
c=int(input("Third number:"))
z=int(input("Fourth number:"))
x=list(range(1,9))
line=list(range(1,9,2))
line2=list(range(2,9,2))
if (a not in x or b not in x or c not in x or z not in x):
    print("Inccorect input")
elif (a in line and b in line and c in line and z in line):
    print("YES")
elif (a==b and c==z):
    print("YES")
elif (a in line2 and b in line2 and c in line2 and z in line2):
    print("YES")
else:
    print("NO")
#-----------------------------------------------------------------


#task8------------------------------------------------------------
“””
Шаховий король переміщується по горизонталі, по вертикалі або по діагоналі на будь-яку сусідню клітинку. Дано координати двох клітин шахової дошки. Визначити, чи може король перейти з першої клітини у другу за один хід. Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини. Перші два числа - для першої клітини, останні два числа – для другої. Програма має вивести "YES", якщо хід можливий, або "NO" в іншому випадку. 

“””
#a=int(input("First number:"))
b=int(input("Secound number:"))
c=int(input("Third number:"))
z=int(input("Fourth number:"))
x=list(range(1,9))
if (a not in x or b not in x or c not in x or z not in x):
    rint("Inccorect input")
elif ((a+1)==c and b==z) or ((b+1)==z and a==c):
    print("YES")
elif ((a+1)==c ) and ((b+1)==z):
    print("YES")
else:
    print("NO")
#-----------------------------------------------------------------


#task9------------------------------------------------------------
“””
Шаховий слон рухається по діагоналі на будь-яку кількість клітин. Дано координати двох клітин шахової дошки. Визначити, чи може слон перейти з першої клітини у другу за один хід. Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини. Перші два числа - для першої клітини, останні два числа – для другої. Програма має вивести "YES", якщо хід можливий, або "NO" в іншому випадку. 

“””
#a=int(input("First number:"))
b=int(input("Secound number:"))
с=int(input("Third number:"))
z=int(input("Fourth number:"))
x=list(range(1,9))
if (a not in x or b not in x or c not in x or z not in x):
    print("Inccorect input")
elif (a+z==b+c) or (a+b==c+z):
    print("YES")
else:
    print("NO")
#-----------------------------------------------------------------


#task10------------------------------------------------------------
“””
Шахова королева рухається по горизонталі, по вертикалі або по діагоналі на будь-яку кількість клітин. Дано координати двох клітин шахової дошки. Визначити, чи може королева перейти з першої клітини у другу за один хід. Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини. Перші два числа - для першої клітини, останні два числа – для другої. Програма має вивести "YES", якщо хід можливий, або "NO" в іншому випадку. 

“””
#a=int(input("First number:"))
b=int(input("Secound number:"))
c=int(input("Third number:"))
z=int(input("Fourth number:"))
x=list(range(1,9))
if (a not in x or b not in x or c not in x or z not in x):
    print("Inccorect input")
elif (a==c or b==z):
    print("YES")
elif (a+z==b+c) or (a+b==c+z):
    print("YES")
else:
    print("NO")

#-----------------------------------------------------------------


#task11------------------------------------------------------------
“””
Шаховий кінь рухається як літера L. Він може переміщатись на дві клітинки по горизонталі і одну клітинку по вертикалі або на дві клітинки по вертикалі і одну по горизонталі. Дано координати двох клітин шахової дошки. Визначити, чи може кінь перейти з першої клітини у другу за один хід. Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини. Перші два числа - для першої клітини, останні два числа – для другої. Програма має вивести "YES", якщо хід можливий, або "NO" в іншому випадку. 
“””
#a=int(input("First number:")) 
b=int(input("Secound number:")) 
c=int(input("Third number:")) 
z=int(input("Fourth number:")) 
x=list(range(1,9)) 
if (a not in x or b not in x or c not in x or z not in x): 
    print("Inccorect input") 
elif ((a-c)==2 and (b-z)==-1) or ((a-c)==-2 and (b-z)==1) or ((a-c)==2 and (b-z)==-1) or ((a-c)==-2 and (b-z)==-1): 
    print("YES") 
elif (a-c==-1 and b-z==2) or (a-c==1 and b-z==2) or (a-c==1 and b-z==-2) or (a-c==-1 and b-z==-2): 
    print("YES") 
else: 
    print("NO")
#-----------------------------------------------------------------
